keeper999/EngineControl_Aurix/01_Get_Src/BSW/VD56_BSW/VD56_GEN_BSW/MCAL_TC29X_DRV_P1/Drv/IfxEray_bf.h
/** \\brief  Mask for Ifx_ERAY_EIR_Bits.EDB */
#define IFX_ERAY_EIR_EDB_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_EIR_Bits.EDB */
#define IFX_ERAY_EIR_EDB_OFF (24)

/** \\brief  Length for Ifx_ERAY_EIR_Bits.EERR */
#define IFX_ERAY_EIR_EERR_LEN (1)

/** \\brief  Mask for Ifx_ERAY_EIR_Bits.EERR */
#define IFX_ERAY_EIR_EERR_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_EIR_Bits.EERR */
#define IFX_ERAY_EIR_EERR_OFF (6)

/** \\brief  Length for Ifx_ERAY_EIR_Bits.EFA */
#define IFX_ERAY_EIR_EFA_LEN (1)

/** \\brief  Mask for Ifx_ERAY_EIR_Bits.EFA */
#define IFX_ERAY_EIR_EFA_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_EIR_Bits.EFA */
#define IFX_ERAY_EIR_EFA_OFF (8)

/** \\brief  Length for Ifx_ERAY_EIR_Bits.IIBA */
#define IFX_ERAY_EIR_IIBA_LEN (1)

/** \\brief  Mask for Ifx_ERAY_EIR_Bits.IIBA */
#define IFX_ERAY_EIR_IIBA_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_EIR_Bits.IIBA */
#define IFX_ERAY_EIR_IIBA_OFF (9)

/** \\brief  Length for Ifx_ERAY_EIR_Bits.IOBA */
#define IFX_ERAY_EIR_IOBA_LEN (1)

/** \\brief  Mask for Ifx_ERAY_EIR_Bits.IOBA */
#define IFX_ERAY_EIR_IOBA_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_EIR_Bits.IOBA */
#define IFX_ERAY_EIR_IOBA_OFF (10)

/** \\brief  Length for Ifx_ERAY_EIR_Bits.LTVA */
#define IFX_ERAY_EIR_LTVA_LEN (1)

/** \\brief  Mask for Ifx_ERAY_EIR_Bits.LTVA */
#define IFX_ERAY_EIR_LTVA_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_EIR_Bits.LTVA */
#define IFX_ERAY_EIR_LTVA_OFF (17)

/** \\brief  Length for Ifx_ERAY_EIR_Bits.LTVB */
#define IFX_ERAY_EIR_LTVB_LEN (1)

/** \\brief  Mask for Ifx_ERAY_EIR_Bits.LTVB */
#define IFX_ERAY_EIR_LTVB_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_EIR_Bits.LTVB */
#define IFX_ERAY_EIR_LTVB_OFF (25)

/** \\brief  Length for Ifx_ERAY_EIR_Bits.MHF */
#define IFX_ERAY_EIR_MHF_LEN (1)

/** \\brief  Mask for Ifx_ERAY_EIR_Bits.MHF */
#define IFX_ERAY_EIR_MHF_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_EIR_Bits.MHF */
#define IFX_ERAY_EIR_MHF_OFF (11)

/** \\brief  Length for Ifx_ERAY_EIR_Bits.PEMC */
#define IFX_ERAY_EIR_PEMC_LEN (1)

/** \\brief  Mask for Ifx_ERAY_EIR_Bits.PEMC */
#define IFX_ERAY_EIR_PEMC_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_EIR_Bits.PEMC */
#define IFX_ERAY_EIR_PEMC_OFF (0)

/** \\brief  Length for Ifx_ERAY_EIR_Bits.RFO */
#define IFX_ERAY_EIR_RFO_LEN (1)

/** \\brief  Mask for Ifx_ERAY_EIR_Bits.RFO */
#define IFX_ERAY_EIR_RFO_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_EIR_Bits.RFO */
#define IFX_ERAY_EIR_RFO_OFF (7)

/** \\brief  Length for Ifx_ERAY_EIR_Bits.SFBM */
#define IFX_ERAY_EIR_SFBM_LEN (1)

/** \\brief  Mask for Ifx_ERAY_EIR_Bits.SFBM */
#define IFX_ERAY_EIR_SFBM_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_EIR_Bits.SFBM */
#define IFX_ERAY_EIR_SFBM_OFF (2)

/** \\brief  Length for Ifx_ERAY_EIR_Bits.SFO */
#define IFX_ERAY_EIR_SFO_LEN (1)

/** \\brief  Mask for Ifx_ERAY_EIR_Bits.SFO */
#define IFX_ERAY_EIR_SFO_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_EIR_Bits.SFO */
#define IFX_ERAY_EIR_SFO_OFF (3)

/** \\brief  Length for Ifx_ERAY_EIR_Bits.TABA */
#define IFX_ERAY_EIR_TABA_LEN (1)

/** \\brief  Mask for Ifx_ERAY_EIR_Bits.TABA */
#define IFX_ERAY_EIR_TABA_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_EIR_Bits.TABA */
#define IFX_ERAY_EIR_TABA_OFF (18)

/** \\brief  Length for Ifx_ERAY_EIR_Bits.TABB */
#define IFX_ERAY_EIR_TABB_LEN (1)

/** \\brief  Mask for Ifx_ERAY_EIR_Bits.TABB */
#define IFX_ERAY_EIR_TABB_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_EIR_Bits.TABB */
#define IFX_ERAY_EIR_TABB_OFF (26)

/** \\brief  Length for Ifx_ERAY_ENDN_Bits.ETV */
#define IFX_ERAY_ENDN_ETV_LEN (32)

/** \\brief  Mask for Ifx_ERAY_ENDN_Bits.ETV */
#define IFX_ERAY_ENDN_ETV_MSK (0xffffffff)

/** \\brief  Offset for Ifx_ERAY_ENDN_Bits.ETV */
#define IFX_ERAY_ENDN_ETV_OFF (0)

/** \\brief  Length for Ifx_ERAY_ESID_Bits.EID */
#define IFX_ERAY_ESID_EID_LEN (10)

/** \\brief  Mask for Ifx_ERAY_ESID_Bits.EID */
#define IFX_ERAY_ESID_EID_MSK (0x3ff)

/** \\brief  Offset for Ifx_ERAY_ESID_Bits.EID */
#define IFX_ERAY_ESID_EID_OFF (0)

/** \\brief  Length for Ifx_ERAY_ESID_Bits.RXEA */
#define IFX_ERAY_ESID_RXEA_LEN (1)

/** \\brief  Mask for Ifx_ERAY_ESID_Bits.RXEA */
#define IFX_ERAY_ESID_RXEA_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_ESID_Bits.RXEA */
#define IFX_ERAY_ESID_RXEA_OFF (14)

/** \\brief  Length for Ifx_ERAY_ESID_Bits.RXEB */
#define IFX_ERAY_ESID_RXEB_LEN (1)

/** \\brief  Mask for Ifx_ERAY_ESID_Bits.RXEB */
#define IFX_ERAY_ESID_RXEB_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_ESID_Bits.RXEB */
#define IFX_ERAY_ESID_RXEB_OFF (15)

/** \\brief  Length for Ifx_ERAY_FCL_Bits.CL */
#define IFX_ERAY_FCL_CL_LEN (8)

/** \\brief  Mask for Ifx_ERAY_FCL_Bits.CL */
#define IFX_ERAY_FCL_CL_MSK (0xff)

/** \\brief  Offset for Ifx_ERAY_FCL_Bits.CL */
#define IFX_ERAY_FCL_CL_OFF (0)

/** \\brief  Length for Ifx_ERAY_FRF_Bits.CH */
#define IFX_ERAY_FRF_CH_LEN (2)

/** \\brief  Mask for Ifx_ERAY_FRF_Bits.CH */
#define IFX_ERAY_FRF_CH_MSK (0x3)

/** \\brief  Offset for Ifx_ERAY_FRF_Bits.CH */
#define IFX_ERAY_FRF_CH_OFF (0)

/** \\brief  Length for Ifx_ERAY_FRF_Bits.CYF */
#define IFX_ERAY_FRF_CYF_LEN (7)

/** \\brief  Mask for Ifx_ERAY_FRF_Bits.CYF */
#define IFX_ERAY_FRF_CYF_MSK (0x7f)

/** \\brief  Offset for Ifx_ERAY_FRF_Bits.CYF */
#define IFX_ERAY_FRF_CYF_OFF (16)

/** \\brief  Length for Ifx_ERAY_FRF_Bits.FID */
#define IFX_ERAY_FRF_FID_LEN (11)

/** \\brief  Mask for Ifx_ERAY_FRF_Bits.FID */
#define IFX_ERAY_FRF_FID_MSK (0x7ff)

/** \\brief  Offset for Ifx_ERAY_FRF_Bits.FID */
#define IFX_ERAY_FRF_FID_OFF (2)

/** \\brief  Length for Ifx_ERAY_FRF_Bits.RNF */
#define IFX_ERAY_FRF_RNF_LEN (1)

/** \\brief  Mask for Ifx_ERAY_FRF_Bits.RNF */
#define IFX_ERAY_FRF_RNF_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_FRF_Bits.RNF */
#define IFX_ERAY_FRF_RNF_OFF (24)

/** \\brief  Length for Ifx_ERAY_FRF_Bits.RSS */
#define IFX_ERAY_FRF_RSS_LEN (1)

/** \\brief  Mask for Ifx_ERAY_FRF_Bits.RSS */
#define IFX_ERAY_FRF_RSS_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_FRF_Bits.RSS */
#define IFX_ERAY_FRF_RSS_OFF (23)

/** \\brief  Length for Ifx_ERAY_FRFM_Bits.MFID */
#define IFX_ERAY_FRFM_MFID_LEN (11)

/** \\brief  Mask for Ifx_ERAY_FRFM_Bits.MFID */
#define IFX_ERAY_FRFM_MFID_MSK (0x7ff)

