keeper999/EngineControl_Aurix/01_Get_Src/BSW/VD56_BSW/VD56_GEN_BSW/MCAL_TC29X_DRV_P1/Drv/IfxEray_bf.h
/** \\brief  Offset for Ifx_ERAY_ILE_Bits.EINT1 */
#define IFX_ERAY_ILE_EINT1_OFF (1)

/** \\brief  Length for Ifx_ERAY_KRST0_Bits.RST */
#define IFX_ERAY_KRST0_RST_LEN (1)

/** \\brief  Mask for Ifx_ERAY_KRST0_Bits.RST */
#define IFX_ERAY_KRST0_RST_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_KRST0_Bits.RST */
#define IFX_ERAY_KRST0_RST_OFF (0)

/** \\brief  Length for Ifx_ERAY_KRST0_Bits.RSTSTAT */
#define IFX_ERAY_KRST0_RSTSTAT_LEN (1)

/** \\brief  Mask for Ifx_ERAY_KRST0_Bits.RSTSTAT */
#define IFX_ERAY_KRST0_RSTSTAT_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_KRST0_Bits.RSTSTAT */
#define IFX_ERAY_KRST0_RSTSTAT_OFF (1)

/** \\brief  Length for Ifx_ERAY_KRST1_Bits.RST */
#define IFX_ERAY_KRST1_RST_LEN (1)

/** \\brief  Mask for Ifx_ERAY_KRST1_Bits.RST */
#define IFX_ERAY_KRST1_RST_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_KRST1_Bits.RST */
#define IFX_ERAY_KRST1_RST_OFF (0)

/** \\brief  Length for Ifx_ERAY_KRSTCLR_Bits.CLR */
#define IFX_ERAY_KRSTCLR_CLR_LEN (1)

/** \\brief  Mask for Ifx_ERAY_KRSTCLR_Bits.CLR */
#define IFX_ERAY_KRSTCLR_CLR_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_KRSTCLR_Bits.CLR */
#define IFX_ERAY_KRSTCLR_CLR_OFF (0)

/** \\brief  Length for Ifx_ERAY_LCK_Bits.CLK */
#define IFX_ERAY_LCK_CLK_LEN (8)

/** \\brief  Mask for Ifx_ERAY_LCK_Bits.CLK */
#define IFX_ERAY_LCK_CLK_MSK (0xff)

/** \\brief  Offset for Ifx_ERAY_LCK_Bits.CLK */
#define IFX_ERAY_LCK_CLK_OFF (0)

/** \\brief  Length for Ifx_ERAY_LCK_Bits.TMK */
#define IFX_ERAY_LCK_TMK_LEN (8)

/** \\brief  Mask for Ifx_ERAY_LCK_Bits.TMK */
#define IFX_ERAY_LCK_TMK_MSK (0xff)

/** \\brief  Offset for Ifx_ERAY_LCK_Bits.TMK */
#define IFX_ERAY_LCK_TMK_OFF (8)

/** \\brief  Length for Ifx_ERAY_LDTS_Bits.LDTA */
#define IFX_ERAY_LDTS_LDTA_LEN (11)

/** \\brief  Mask for Ifx_ERAY_LDTS_Bits.LDTA */
#define IFX_ERAY_LDTS_LDTA_MSK (0x7ff)

/** \\brief  Offset for Ifx_ERAY_LDTS_Bits.LDTA */
#define IFX_ERAY_LDTS_LDTA_OFF (0)

/** \\brief  Length for Ifx_ERAY_LDTS_Bits.LDTB */
#define IFX_ERAY_LDTS_LDTB_LEN (11)

/** \\brief  Mask for Ifx_ERAY_LDTS_Bits.LDTB */
#define IFX_ERAY_LDTS_LDTB_MSK (0x7ff)

/** \\brief  Offset for Ifx_ERAY_LDTS_Bits.LDTB */
#define IFX_ERAY_LDTS_LDTB_OFF (16)

/** \\brief  Length for Ifx_ERAY_MBS_Bits.CCS */
#define IFX_ERAY_MBS_CCS_LEN (6)

/** \\brief  Mask for Ifx_ERAY_MBS_Bits.CCS */
#define IFX_ERAY_MBS_CCS_MSK (0x3f)

/** \\brief  Offset for Ifx_ERAY_MBS_Bits.CCS */
#define IFX_ERAY_MBS_CCS_OFF (16)

/** \\brief  Length for Ifx_ERAY_MBS_Bits.CEOA */
#define IFX_ERAY_MBS_CEOA_LEN (1)

/** \\brief  Mask for Ifx_ERAY_MBS_Bits.CEOA */
#define IFX_ERAY_MBS_CEOA_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_MBS_Bits.CEOA */
#define IFX_ERAY_MBS_CEOA_OFF (4)

/** \\brief  Length for Ifx_ERAY_MBS_Bits.CEOB */
#define IFX_ERAY_MBS_CEOB_LEN (1)

/** \\brief  Mask for Ifx_ERAY_MBS_Bits.CEOB */
#define IFX_ERAY_MBS_CEOB_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_MBS_Bits.CEOB */
#define IFX_ERAY_MBS_CEOB_OFF (5)

/** \\brief  Length for Ifx_ERAY_MBS_Bits.ESA */
#define IFX_ERAY_MBS_ESA_LEN (1)

/** \\brief  Mask for Ifx_ERAY_MBS_Bits.ESA */
#define IFX_ERAY_MBS_ESA_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_MBS_Bits.ESA */
#define IFX_ERAY_MBS_ESA_OFF (10)

/** \\brief  Length for Ifx_ERAY_MBS_Bits.ESB */
#define IFX_ERAY_MBS_ESB_LEN (1)

/** \\brief  Mask for Ifx_ERAY_MBS_Bits.ESB */
#define IFX_ERAY_MBS_ESB_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_MBS_Bits.ESB */
#define IFX_ERAY_MBS_ESB_OFF (11)

/** \\brief  Length for Ifx_ERAY_MBS_Bits.FTA */
#define IFX_ERAY_MBS_FTA_LEN (1)

/** \\brief  Mask for Ifx_ERAY_MBS_Bits.FTA */
#define IFX_ERAY_MBS_FTA_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_MBS_Bits.FTA */
#define IFX_ERAY_MBS_FTA_OFF (14)

/** \\brief  Length for Ifx_ERAY_MBS_Bits.FTB */
#define IFX_ERAY_MBS_FTB_LEN (1)

/** \\brief  Mask for Ifx_ERAY_MBS_Bits.FTB */
#define IFX_ERAY_MBS_FTB_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_MBS_Bits.FTB */
#define IFX_ERAY_MBS_FTB_OFF (15)

/** \\brief  Length for Ifx_ERAY_MBS_Bits.MLST */
#define IFX_ERAY_MBS_MLST_LEN (1)

/** \\brief  Mask for Ifx_ERAY_MBS_Bits.MLST */
#define IFX_ERAY_MBS_MLST_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_MBS_Bits.MLST */
#define IFX_ERAY_MBS_MLST_OFF (12)

/** \\brief  Length for Ifx_ERAY_MBS_Bits.NFIS */
#define IFX_ERAY_MBS_NFIS_LEN (1)

/** \\brief  Mask for Ifx_ERAY_MBS_Bits.NFIS */
#define IFX_ERAY_MBS_NFIS_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_MBS_Bits.NFIS */
#define IFX_ERAY_MBS_NFIS_OFF (27)

/** \\brief  Length for Ifx_ERAY_MBS_Bits.PPIS */
#define IFX_ERAY_MBS_PPIS_LEN (1)

/** \\brief  Mask for Ifx_ERAY_MBS_Bits.PPIS */
#define IFX_ERAY_MBS_PPIS_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_MBS_Bits.PPIS */
#define IFX_ERAY_MBS_PPIS_OFF (28)

/** \\brief  Length for Ifx_ERAY_MBS_Bits.RCIS */
#define IFX_ERAY_MBS_RCIS_LEN (1)

/** \\brief  Mask for Ifx_ERAY_MBS_Bits.RCIS */
#define IFX_ERAY_MBS_RCIS_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_MBS_Bits.RCIS */
#define IFX_ERAY_MBS_RCIS_OFF (24)

/** \\brief  Length for Ifx_ERAY_MBS_Bits.RESS */
#define IFX_ERAY_MBS_RESS_LEN (1)

/** \\brief  Mask for Ifx_ERAY_MBS_Bits.RESS */
#define IFX_ERAY_MBS_RESS_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_MBS_Bits.RESS */
#define IFX_ERAY_MBS_RESS_OFF (29)

/** \\brief  Length for Ifx_ERAY_MBS_Bits.SEOA */
#define IFX_ERAY_MBS_SEOA_LEN (1)

/** \\brief  Mask for Ifx_ERAY_MBS_Bits.SEOA */
#define IFX_ERAY_MBS_SEOA_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_MBS_Bits.SEOA */
#define IFX_ERAY_MBS_SEOA_OFF (2)

/** \\brief  Length for Ifx_ERAY_MBS_Bits.SEOB */
#define IFX_ERAY_MBS_SEOB_LEN (1)

/** \\brief  Mask for Ifx_ERAY_MBS_Bits.SEOB */
#define IFX_ERAY_MBS_SEOB_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_MBS_Bits.SEOB */
#define IFX_ERAY_MBS_SEOB_OFF (3)

/** \\brief  Length for Ifx_ERAY_MBS_Bits.SFIS */
#define IFX_ERAY_MBS_SFIS_LEN (1)

/** \\brief  Mask for Ifx_ERAY_MBS_Bits.SFIS */
#define IFX_ERAY_MBS_SFIS_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_MBS_Bits.SFIS */
#define IFX_ERAY_MBS_SFIS_OFF (25)

/** \\brief  Length for Ifx_ERAY_MBS_Bits.SVOA */
#define IFX_ERAY_MBS_SVOA_LEN (1)

