keeper999/EngineControl_Aurix/01_Get_Src/BSW/VD56_BSW/VD56_GEN_BSW/MCAL_TC29X_DRV_P1/Drv/IfxEray_bf.h
/** \\brief  Length for Ifx_ERAY_MBSC1_Bits.MBC24 */
#define IFX_ERAY_MBSC1_MBC24_LEN (1)

/** \\brief  Mask for Ifx_ERAY_MBSC1_Bits.MBC24 */
#define IFX_ERAY_MBSC1_MBC24_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_MBSC1_Bits.MBC24 */
#define IFX_ERAY_MBSC1_MBC24_OFF (24)

/** \\brief  Length for Ifx_ERAY_MBSC1_Bits.MBC25 */
#define IFX_ERAY_MBSC1_MBC25_LEN (1)

/** \\brief  Mask for Ifx_ERAY_MBSC1_Bits.MBC25 */
#define IFX_ERAY_MBSC1_MBC25_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_MBSC1_Bits.MBC25 */
#define IFX_ERAY_MBSC1_MBC25_OFF (25)

/** \\brief  Length for Ifx_ERAY_MBSC1_Bits.MBC26 */
#define IFX_ERAY_MBSC1_MBC26_LEN (1)

/** \\brief  Mask for Ifx_ERAY_MBSC1_Bits.MBC26 */
#define IFX_ERAY_MBSC1_MBC26_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_MBSC1_Bits.MBC26 */
#define IFX_ERAY_MBSC1_MBC26_OFF (26)

/** \\brief  Length for Ifx_ERAY_MBSC1_Bits.MBC27 */
#define IFX_ERAY_MBSC1_MBC27_LEN (1)

/** \\brief  Mask for Ifx_ERAY_MBSC1_Bits.MBC27 */
#define IFX_ERAY_MBSC1_MBC27_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_MBSC1_Bits.MBC27 */
#define IFX_ERAY_MBSC1_MBC27_OFF (27)

/** \\brief  Length for Ifx_ERAY_MBSC1_Bits.MBC28 */
#define IFX_ERAY_MBSC1_MBC28_LEN (1)

/** \\brief  Mask for Ifx_ERAY_MBSC1_Bits.MBC28 */
#define IFX_ERAY_MBSC1_MBC28_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_MBSC1_Bits.MBC28 */
#define IFX_ERAY_MBSC1_MBC28_OFF (28)

/** \\brief  Length for Ifx_ERAY_MBSC1_Bits.MBC29 */
#define IFX_ERAY_MBSC1_MBC29_LEN (1)

/** \\brief  Mask for Ifx_ERAY_MBSC1_Bits.MBC29 */
#define IFX_ERAY_MBSC1_MBC29_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_MBSC1_Bits.MBC29 */
#define IFX_ERAY_MBSC1_MBC29_OFF (29)

/** \\brief  Length for Ifx_ERAY_MBSC1_Bits.MBC2 */
#define IFX_ERAY_MBSC1_MBC2_LEN (1)

/** \\brief  Mask for Ifx_ERAY_MBSC1_Bits.MBC2 */
#define IFX_ERAY_MBSC1_MBC2_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_MBSC1_Bits.MBC2 */
#define IFX_ERAY_MBSC1_MBC2_OFF (2)

/** \\brief  Length for Ifx_ERAY_MBSC1_Bits.MBC30 */
#define IFX_ERAY_MBSC1_MBC30_LEN (1)

/** \\brief  Mask for Ifx_ERAY_MBSC1_Bits.MBC30 */
#define IFX_ERAY_MBSC1_MBC30_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_MBSC1_Bits.MBC30 */
#define IFX_ERAY_MBSC1_MBC30_OFF (30)

/** \\brief  Length for Ifx_ERAY_MBSC1_Bits.MBC31 */
#define IFX_ERAY_MBSC1_MBC31_LEN (1)

/** \\brief  Mask for Ifx_ERAY_MBSC1_Bits.MBC31 */
#define IFX_ERAY_MBSC1_MBC31_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_MBSC1_Bits.MBC31 */
#define IFX_ERAY_MBSC1_MBC31_OFF (31)

/** \\brief  Length for Ifx_ERAY_MBSC1_Bits.MBC3 */
#define IFX_ERAY_MBSC1_MBC3_LEN (1)

/** \\brief  Mask for Ifx_ERAY_MBSC1_Bits.MBC3 */
#define IFX_ERAY_MBSC1_MBC3_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_MBSC1_Bits.MBC3 */
#define IFX_ERAY_MBSC1_MBC3_OFF (3)

/** \\brief  Length for Ifx_ERAY_MBSC1_Bits.MBC4 */
#define IFX_ERAY_MBSC1_MBC4_LEN (1)

/** \\brief  Mask for Ifx_ERAY_MBSC1_Bits.MBC4 */
#define IFX_ERAY_MBSC1_MBC4_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_MBSC1_Bits.MBC4 */
#define IFX_ERAY_MBSC1_MBC4_OFF (4)

/** \\brief  Length for Ifx_ERAY_MBSC1_Bits.MBC5 */
#define IFX_ERAY_MBSC1_MBC5_LEN (1)

/** \\brief  Mask for Ifx_ERAY_MBSC1_Bits.MBC5 */
#define IFX_ERAY_MBSC1_MBC5_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_MBSC1_Bits.MBC5 */
#define IFX_ERAY_MBSC1_MBC5_OFF (5)

/** \\brief  Length for Ifx_ERAY_MBSC1_Bits.MBC6 */
#define IFX_ERAY_MBSC1_MBC6_LEN (1)

/** \\brief  Mask for Ifx_ERAY_MBSC1_Bits.MBC6 */
#define IFX_ERAY_MBSC1_MBC6_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_MBSC1_Bits.MBC6 */
#define IFX_ERAY_MBSC1_MBC6_OFF (6)

/** \\brief  Length for Ifx_ERAY_MBSC1_Bits.MBC7 */
#define IFX_ERAY_MBSC1_MBC7_LEN (1)

/** \\brief  Mask for Ifx_ERAY_MBSC1_Bits.MBC7 */
#define IFX_ERAY_MBSC1_MBC7_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_MBSC1_Bits.MBC7 */
#define IFX_ERAY_MBSC1_MBC7_OFF (7)

/** \\brief  Length for Ifx_ERAY_MBSC1_Bits.MBC8 */
#define IFX_ERAY_MBSC1_MBC8_LEN (1)

/** \\brief  Mask for Ifx_ERAY_MBSC1_Bits.MBC8 */
#define IFX_ERAY_MBSC1_MBC8_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_MBSC1_Bits.MBC8 */
#define IFX_ERAY_MBSC1_MBC8_OFF (8)

/** \\brief  Length for Ifx_ERAY_MBSC1_Bits.MBC9 */
#define IFX_ERAY_MBSC1_MBC9_LEN (1)

/** \\brief  Mask for Ifx_ERAY_MBSC1_Bits.MBC9 */
#define IFX_ERAY_MBSC1_MBC9_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_MBSC1_Bits.MBC9 */
#define IFX_ERAY_MBSC1_MBC9_OFF (9)

/** \\brief  Length for Ifx_ERAY_MBSC2_Bits.MBC32 */
#define IFX_ERAY_MBSC2_MBC32_LEN (1)

/** \\brief  Mask for Ifx_ERAY_MBSC2_Bits.MBC32 */
#define IFX_ERAY_MBSC2_MBC32_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_MBSC2_Bits.MBC32 */
#define IFX_ERAY_MBSC2_MBC32_OFF (0)

/** \\brief  Length for Ifx_ERAY_MBSC2_Bits.MBC33 */
#define IFX_ERAY_MBSC2_MBC33_LEN (1)

/** \\brief  Mask for Ifx_ERAY_MBSC2_Bits.MBC33 */
#define IFX_ERAY_MBSC2_MBC33_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_MBSC2_Bits.MBC33 */
#define IFX_ERAY_MBSC2_MBC33_OFF (1)

/** \\brief  Length for Ifx_ERAY_MBSC2_Bits.MBC34 */
#define IFX_ERAY_MBSC2_MBC34_LEN (1)

/** \\brief  Mask for Ifx_ERAY_MBSC2_Bits.MBC34 */
#define IFX_ERAY_MBSC2_MBC34_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_MBSC2_Bits.MBC34 */
#define IFX_ERAY_MBSC2_MBC34_OFF (2)

/** \\brief  Length for Ifx_ERAY_MBSC2_Bits.MBC35 */
#define IFX_ERAY_MBSC2_MBC35_LEN (1)

/** \\brief  Mask for Ifx_ERAY_MBSC2_Bits.MBC35 */
#define IFX_ERAY_MBSC2_MBC35_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_MBSC2_Bits.MBC35 */
#define IFX_ERAY_MBSC2_MBC35_OFF (3)

/** \\brief  Length for Ifx_ERAY_MBSC2_Bits.MBC36 */
#define IFX_ERAY_MBSC2_MBC36_LEN (1)

/** \\brief  Mask for Ifx_ERAY_MBSC2_Bits.MBC36 */
#define IFX_ERAY_MBSC2_MBC36_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_MBSC2_Bits.MBC36 */
#define IFX_ERAY_MBSC2_MBC36_OFF (4)

/** \\brief  Length for Ifx_ERAY_MBSC2_Bits.MBC37 */
#define IFX_ERAY_MBSC2_MBC37_LEN (1)

/** \\brief  Mask for Ifx_ERAY_MBSC2_Bits.MBC37 */
#define IFX_ERAY_MBSC2_MBC37_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_MBSC2_Bits.MBC37 */
#define IFX_ERAY_MBSC2_MBC37_OFF (5)

/** \\brief  Length for Ifx_ERAY_MBSC2_Bits.MBC38 */
#define IFX_ERAY_MBSC2_MBC38_LEN (1)

/** \\brief  Mask for Ifx_ERAY_MBSC2_Bits.MBC38 */
#define IFX_ERAY_MBSC2_MBC38_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_MBSC2_Bits.MBC38 */
#define IFX_ERAY_MBSC2_MBC38_OFF (6)

