keeper999/EngineControl_Aurix/01_Get_Src/BSW/VD56_BSW/VD56_GEN_BSW/MCAL_TC29X_DRV_P1/Drv/IfxEray_bf.h
/** \\brief  Offset for Ifx_ERAY_MHDC_Bits.SFDL */
#define IFX_ERAY_MHDC_SFDL_OFF (0)

/** \\brief  Length for Ifx_ERAY_MHDC_Bits.SLT */
#define IFX_ERAY_MHDC_SLT_LEN (13)

/** \\brief  Mask for Ifx_ERAY_MHDC_Bits.SLT */
#define IFX_ERAY_MHDC_SLT_MSK (0x1fff)

/** \\brief  Offset for Ifx_ERAY_MHDC_Bits.SLT */
#define IFX_ERAY_MHDC_SLT_OFF (16)

/** \\brief  Length for Ifx_ERAY_MHDF_Bits.FNFA */
#define IFX_ERAY_MHDF_FNFA_LEN (1)

/** \\brief  Mask for Ifx_ERAY_MHDF_Bits.FNFA */
#define IFX_ERAY_MHDF_FNFA_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_MHDF_Bits.FNFA */
#define IFX_ERAY_MHDF_FNFA_OFF (2)

/** \\brief  Length for Ifx_ERAY_MHDF_Bits.FNFB */
#define IFX_ERAY_MHDF_FNFB_LEN (1)

/** \\brief  Mask for Ifx_ERAY_MHDF_Bits.FNFB */
#define IFX_ERAY_MHDF_FNFB_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_MHDF_Bits.FNFB */
#define IFX_ERAY_MHDF_FNFB_OFF (3)

/** \\brief  Length for Ifx_ERAY_MHDF_Bits.SNUA */
#define IFX_ERAY_MHDF_SNUA_LEN (1)

/** \\brief  Mask for Ifx_ERAY_MHDF_Bits.SNUA */
#define IFX_ERAY_MHDF_SNUA_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_MHDF_Bits.SNUA */
#define IFX_ERAY_MHDF_SNUA_OFF (0)

/** \\brief  Length for Ifx_ERAY_MHDF_Bits.SNUB */
#define IFX_ERAY_MHDF_SNUB_LEN (1)

/** \\brief  Mask for Ifx_ERAY_MHDF_Bits.SNUB */
#define IFX_ERAY_MHDF_SNUB_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_MHDF_Bits.SNUB */
#define IFX_ERAY_MHDF_SNUB_OFF (1)

/** \\brief  Length for Ifx_ERAY_MHDF_Bits.TBFA */
#define IFX_ERAY_MHDF_TBFA_LEN (1)

/** \\brief  Mask for Ifx_ERAY_MHDF_Bits.TBFA */
#define IFX_ERAY_MHDF_TBFA_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_MHDF_Bits.TBFA */
#define IFX_ERAY_MHDF_TBFA_OFF (4)

/** \\brief  Length for Ifx_ERAY_MHDF_Bits.TBFB */
#define IFX_ERAY_MHDF_TBFB_LEN (1)

/** \\brief  Mask for Ifx_ERAY_MHDF_Bits.TBFB */
#define IFX_ERAY_MHDF_TBFB_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_MHDF_Bits.TBFB */
#define IFX_ERAY_MHDF_TBFB_OFF (5)

/** \\brief  Length for Ifx_ERAY_MHDF_Bits.TNSA */
#define IFX_ERAY_MHDF_TNSA_LEN (1)

/** \\brief  Mask for Ifx_ERAY_MHDF_Bits.TNSA */
#define IFX_ERAY_MHDF_TNSA_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_MHDF_Bits.TNSA */
#define IFX_ERAY_MHDF_TNSA_OFF (6)

/** \\brief  Length for Ifx_ERAY_MHDF_Bits.TNSB */
#define IFX_ERAY_MHDF_TNSB_LEN (1)

/** \\brief  Mask for Ifx_ERAY_MHDF_Bits.TNSB */
#define IFX_ERAY_MHDF_TNSB_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_MHDF_Bits.TNSB */
#define IFX_ERAY_MHDF_TNSB_OFF (7)

/** \\brief  Length for Ifx_ERAY_MHDF_Bits.WAHP */
#define IFX_ERAY_MHDF_WAHP_LEN (1)

/** \\brief  Mask for Ifx_ERAY_MHDF_Bits.WAHP */
#define IFX_ERAY_MHDF_WAHP_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_MHDF_Bits.WAHP */
#define IFX_ERAY_MHDF_WAHP_OFF (8)

/** \\brief  Length for Ifx_ERAY_MHDS_Bits.CRAM */
#define IFX_ERAY_MHDS_CRAM_LEN (1)

/** \\brief  Mask for Ifx_ERAY_MHDS_Bits.CRAM */
#define IFX_ERAY_MHDS_CRAM_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_MHDS_Bits.CRAM */
#define IFX_ERAY_MHDS_CRAM_OFF (7)

/** \\brief  Length for Ifx_ERAY_MHDS_Bits.EIBF */
#define IFX_ERAY_MHDS_EIBF_LEN (1)

/** \\brief  Mask for Ifx_ERAY_MHDS_Bits.EIBF */
#define IFX_ERAY_MHDS_EIBF_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_MHDS_Bits.EIBF */
#define IFX_ERAY_MHDS_EIBF_OFF (0)

/** \\brief  Length for Ifx_ERAY_MHDS_Bits.EMR */
#define IFX_ERAY_MHDS_EMR_LEN (1)

/** \\brief  Mask for Ifx_ERAY_MHDS_Bits.EMR */
#define IFX_ERAY_MHDS_EMR_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_MHDS_Bits.EMR */
#define IFX_ERAY_MHDS_EMR_OFF (2)

/** \\brief  Length for Ifx_ERAY_MHDS_Bits.EOBF */
#define IFX_ERAY_MHDS_EOBF_LEN (1)

/** \\brief  Mask for Ifx_ERAY_MHDS_Bits.EOBF */
#define IFX_ERAY_MHDS_EOBF_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_MHDS_Bits.EOBF */
#define IFX_ERAY_MHDS_EOBF_OFF (1)

/** \\brief  Length for Ifx_ERAY_MHDS_Bits.ETBF1 */
#define IFX_ERAY_MHDS_ETBF1_LEN (1)

/** \\brief  Mask for Ifx_ERAY_MHDS_Bits.ETBF1 */
#define IFX_ERAY_MHDS_ETBF1_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_MHDS_Bits.ETBF1 */
#define IFX_ERAY_MHDS_ETBF1_OFF (3)

/** \\brief  Length for Ifx_ERAY_MHDS_Bits.ETBF2 */
#define IFX_ERAY_MHDS_ETBF2_LEN (1)

/** \\brief  Mask for Ifx_ERAY_MHDS_Bits.ETBF2 */
#define IFX_ERAY_MHDS_ETBF2_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_MHDS_Bits.ETBF2 */
#define IFX_ERAY_MHDS_ETBF2_OFF (4)

/** \\brief  Length for Ifx_ERAY_MHDS_Bits.FMB */
#define IFX_ERAY_MHDS_FMB_LEN (7)

/** \\brief  Mask for Ifx_ERAY_MHDS_Bits.FMB */
#define IFX_ERAY_MHDS_FMB_MSK (0x7f)

/** \\brief  Offset for Ifx_ERAY_MHDS_Bits.FMB */
#define IFX_ERAY_MHDS_FMB_OFF (8)

/** \\brief  Length for Ifx_ERAY_MHDS_Bits.FMBD */
#define IFX_ERAY_MHDS_FMBD_LEN (1)

/** \\brief  Mask for Ifx_ERAY_MHDS_Bits.FMBD */
#define IFX_ERAY_MHDS_FMBD_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_MHDS_Bits.FMBD */
#define IFX_ERAY_MHDS_FMBD_OFF (5)

/** \\brief  Length for Ifx_ERAY_MHDS_Bits.MBT */
#define IFX_ERAY_MHDS_MBT_LEN (7)

/** \\brief  Mask for Ifx_ERAY_MHDS_Bits.MBT */
#define IFX_ERAY_MHDS_MBT_MSK (0x7f)

/** \\brief  Offset for Ifx_ERAY_MHDS_Bits.MBT */
#define IFX_ERAY_MHDS_MBT_OFF (16)

/** \\brief  Length for Ifx_ERAY_MHDS_Bits.MBU */
#define IFX_ERAY_MHDS_MBU_LEN (7)

/** \\brief  Mask for Ifx_ERAY_MHDS_Bits.MBU */
#define IFX_ERAY_MHDS_MBU_MSK (0x7f)

/** \\brief  Offset for Ifx_ERAY_MHDS_Bits.MBU */
#define IFX_ERAY_MHDS_MBU_OFF (24)

/** \\brief  Length for Ifx_ERAY_MHDS_Bits.MFMB */
#define IFX_ERAY_MHDS_MFMB_LEN (1)

/** \\brief  Mask for Ifx_ERAY_MHDS_Bits.MFMB */
#define IFX_ERAY_MHDS_MFMB_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_MHDS_Bits.MFMB */
#define IFX_ERAY_MHDS_MFMB_OFF (6)

/** \\brief  Length for Ifx_ERAY_MRC_Bits.FDB */
#define IFX_ERAY_MRC_FDB_LEN (8)

/** \\brief  Mask for Ifx_ERAY_MRC_Bits.FDB */
#define IFX_ERAY_MRC_FDB_MSK (0xff)

/** \\brief  Offset for Ifx_ERAY_MRC_Bits.FDB */
#define IFX_ERAY_MRC_FDB_OFF (0)

