keeper999/EngineControl_Aurix/01_Get_Src/BSW/VD56_BSW/VD56_GEN_BSW/MCAL_TC29X_DRV_P1/Drv/IfxEray_bf.h
/** \\brief  Length for Ifx_ERAY_MRC_Bits.FFB */
#define IFX_ERAY_MRC_FFB_LEN (8)

/** \\brief  Mask for Ifx_ERAY_MRC_Bits.FFB */
#define IFX_ERAY_MRC_FFB_MSK (0xff)

/** \\brief  Offset for Ifx_ERAY_MRC_Bits.FFB */
#define IFX_ERAY_MRC_FFB_OFF (8)

/** \\brief  Length for Ifx_ERAY_MRC_Bits.LCB */
#define IFX_ERAY_MRC_LCB_LEN (8)

/** \\brief  Mask for Ifx_ERAY_MRC_Bits.LCB */
#define IFX_ERAY_MRC_LCB_MSK (0xff)

/** \\brief  Offset for Ifx_ERAY_MRC_Bits.LCB */
#define IFX_ERAY_MRC_LCB_OFF (16)

/** \\brief  Length for Ifx_ERAY_MRC_Bits.SEC */
#define IFX_ERAY_MRC_SEC_LEN (2)

/** \\brief  Mask for Ifx_ERAY_MRC_Bits.SEC */
#define IFX_ERAY_MRC_SEC_MSK (0x3)

/** \\brief  Offset for Ifx_ERAY_MRC_Bits.SEC */
#define IFX_ERAY_MRC_SEC_OFF (24)

/** \\brief  Length for Ifx_ERAY_MRC_Bits.SPLM */
#define IFX_ERAY_MRC_SPLM_LEN (1)

/** \\brief  Mask for Ifx_ERAY_MRC_Bits.SPLM */
#define IFX_ERAY_MRC_SPLM_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_MRC_Bits.SPLM */
#define IFX_ERAY_MRC_SPLM_OFF (26)

/** \\brief  Length for Ifx_ERAY_MSIC1_Bits.MSIP0 */
#define IFX_ERAY_MSIC1_MSIP0_LEN (1)

/** \\brief  Mask for Ifx_ERAY_MSIC1_Bits.MSIP0 */
#define IFX_ERAY_MSIC1_MSIP0_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_MSIC1_Bits.MSIP0 */
#define IFX_ERAY_MSIC1_MSIP0_OFF (0)

/** \\brief  Length for Ifx_ERAY_MSIC1_Bits.MSIP10 */
#define IFX_ERAY_MSIC1_MSIP10_LEN (1)

/** \\brief  Mask for Ifx_ERAY_MSIC1_Bits.MSIP10 */
#define IFX_ERAY_MSIC1_MSIP10_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_MSIC1_Bits.MSIP10 */
#define IFX_ERAY_MSIC1_MSIP10_OFF (10)

/** \\brief  Length for Ifx_ERAY_MSIC1_Bits.MSIP11 */
#define IFX_ERAY_MSIC1_MSIP11_LEN (1)

/** \\brief  Mask for Ifx_ERAY_MSIC1_Bits.MSIP11 */
#define IFX_ERAY_MSIC1_MSIP11_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_MSIC1_Bits.MSIP11 */
#define IFX_ERAY_MSIC1_MSIP11_OFF (11)

/** \\brief  Length for Ifx_ERAY_MSIC1_Bits.MSIP12 */
#define IFX_ERAY_MSIC1_MSIP12_LEN (1)

/** \\brief  Mask for Ifx_ERAY_MSIC1_Bits.MSIP12 */
#define IFX_ERAY_MSIC1_MSIP12_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_MSIC1_Bits.MSIP12 */
#define IFX_ERAY_MSIC1_MSIP12_OFF (12)

/** \\brief  Length for Ifx_ERAY_MSIC1_Bits.MSIP13 */
#define IFX_ERAY_MSIC1_MSIP13_LEN (1)

/** \\brief  Mask for Ifx_ERAY_MSIC1_Bits.MSIP13 */
#define IFX_ERAY_MSIC1_MSIP13_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_MSIC1_Bits.MSIP13 */
#define IFX_ERAY_MSIC1_MSIP13_OFF (13)

/** \\brief  Length for Ifx_ERAY_MSIC1_Bits.MSIP14 */
#define IFX_ERAY_MSIC1_MSIP14_LEN (1)

/** \\brief  Mask for Ifx_ERAY_MSIC1_Bits.MSIP14 */
#define IFX_ERAY_MSIC1_MSIP14_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_MSIC1_Bits.MSIP14 */
#define IFX_ERAY_MSIC1_MSIP14_OFF (14)

/** \\brief  Length for Ifx_ERAY_MSIC1_Bits.MSIP15 */
#define IFX_ERAY_MSIC1_MSIP15_LEN (1)

/** \\brief  Mask for Ifx_ERAY_MSIC1_Bits.MSIP15 */
#define IFX_ERAY_MSIC1_MSIP15_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_MSIC1_Bits.MSIP15 */
#define IFX_ERAY_MSIC1_MSIP15_OFF (15)

/** \\brief  Length for Ifx_ERAY_MSIC1_Bits.MSIP16 */
#define IFX_ERAY_MSIC1_MSIP16_LEN (1)

/** \\brief  Mask for Ifx_ERAY_MSIC1_Bits.MSIP16 */
#define IFX_ERAY_MSIC1_MSIP16_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_MSIC1_Bits.MSIP16 */
#define IFX_ERAY_MSIC1_MSIP16_OFF (16)

/** \\brief  Length for Ifx_ERAY_MSIC1_Bits.MSIP17 */
#define IFX_ERAY_MSIC1_MSIP17_LEN (1)

/** \\brief  Mask for Ifx_ERAY_MSIC1_Bits.MSIP17 */
#define IFX_ERAY_MSIC1_MSIP17_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_MSIC1_Bits.MSIP17 */
#define IFX_ERAY_MSIC1_MSIP17_OFF (17)

/** \\brief  Length for Ifx_ERAY_MSIC1_Bits.MSIP18 */
#define IFX_ERAY_MSIC1_MSIP18_LEN (1)

/** \\brief  Mask for Ifx_ERAY_MSIC1_Bits.MSIP18 */
#define IFX_ERAY_MSIC1_MSIP18_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_MSIC1_Bits.MSIP18 */
#define IFX_ERAY_MSIC1_MSIP18_OFF (18)

/** \\brief  Length for Ifx_ERAY_MSIC1_Bits.MSIP19 */
#define IFX_ERAY_MSIC1_MSIP19_LEN (1)

/** \\brief  Mask for Ifx_ERAY_MSIC1_Bits.MSIP19 */
#define IFX_ERAY_MSIC1_MSIP19_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_MSIC1_Bits.MSIP19 */
#define IFX_ERAY_MSIC1_MSIP19_OFF (19)

/** \\brief  Length for Ifx_ERAY_MSIC1_Bits.MSIP1 */
#define IFX_ERAY_MSIC1_MSIP1_LEN (1)

/** \\brief  Mask for Ifx_ERAY_MSIC1_Bits.MSIP1 */
#define IFX_ERAY_MSIC1_MSIP1_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_MSIC1_Bits.MSIP1 */
#define IFX_ERAY_MSIC1_MSIP1_OFF (1)

/** \\brief  Length for Ifx_ERAY_MSIC1_Bits.MSIP20 */
#define IFX_ERAY_MSIC1_MSIP20_LEN (1)

/** \\brief  Mask for Ifx_ERAY_MSIC1_Bits.MSIP20 */
#define IFX_ERAY_MSIC1_MSIP20_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_MSIC1_Bits.MSIP20 */
#define IFX_ERAY_MSIC1_MSIP20_OFF (20)

/** \\brief  Length for Ifx_ERAY_MSIC1_Bits.MSIP21 */
#define IFX_ERAY_MSIC1_MSIP21_LEN (1)

/** \\brief  Mask for Ifx_ERAY_MSIC1_Bits.MSIP21 */
#define IFX_ERAY_MSIC1_MSIP21_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_MSIC1_Bits.MSIP21 */
#define IFX_ERAY_MSIC1_MSIP21_OFF (21)

/** \\brief  Length for Ifx_ERAY_MSIC1_Bits.MSIP22 */
#define IFX_ERAY_MSIC1_MSIP22_LEN (1)

/** \\brief  Mask for Ifx_ERAY_MSIC1_Bits.MSIP22 */
#define IFX_ERAY_MSIC1_MSIP22_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_MSIC1_Bits.MSIP22 */
#define IFX_ERAY_MSIC1_MSIP22_OFF (22)

/** \\brief  Length for Ifx_ERAY_MSIC1_Bits.MSIP23 */
#define IFX_ERAY_MSIC1_MSIP23_LEN (1)

/** \\brief  Mask for Ifx_ERAY_MSIC1_Bits.MSIP23 */
#define IFX_ERAY_MSIC1_MSIP23_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_MSIC1_Bits.MSIP23 */
#define IFX_ERAY_MSIC1_MSIP23_OFF (23)

/** \\brief  Length for Ifx_ERAY_MSIC1_Bits.MSIP24 */
#define IFX_ERAY_MSIC1_MSIP24_LEN (1)

/** \\brief  Mask for Ifx_ERAY_MSIC1_Bits.MSIP24 */
#define IFX_ERAY_MSIC1_MSIP24_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_MSIC1_Bits.MSIP24 */
#define IFX_ERAY_MSIC1_MSIP24_OFF (24)

/** \\brief  Length for Ifx_ERAY_MSIC1_Bits.MSIP25 */
#define IFX_ERAY_MSIC1_MSIP25_LEN (1)

/** \\brief  Mask for Ifx_ERAY_MSIC1_Bits.MSIP25 */
#define IFX_ERAY_MSIC1_MSIP25_MSK (0x1)

