keeper999/EngineControl_Aurix/01_Get_Src/BSW/VD56_BSW/VD56_GEN_BSW/MCAL_TC29X_DRV_P1/Drv/IfxEray_bf.h
/** \\brief  Offset for Ifx_ERAY_MSIC1_Bits.MSIP25 */
#define IFX_ERAY_MSIC1_MSIP25_OFF (25)

/** \\brief  Length for Ifx_ERAY_MSIC1_Bits.MSIP26 */
#define IFX_ERAY_MSIC1_MSIP26_LEN (1)

/** \\brief  Mask for Ifx_ERAY_MSIC1_Bits.MSIP26 */
#define IFX_ERAY_MSIC1_MSIP26_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_MSIC1_Bits.MSIP26 */
#define IFX_ERAY_MSIC1_MSIP26_OFF (26)

/** \\brief  Length for Ifx_ERAY_MSIC1_Bits.MSIP27 */
#define IFX_ERAY_MSIC1_MSIP27_LEN (1)

/** \\brief  Mask for Ifx_ERAY_MSIC1_Bits.MSIP27 */
#define IFX_ERAY_MSIC1_MSIP27_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_MSIC1_Bits.MSIP27 */
#define IFX_ERAY_MSIC1_MSIP27_OFF (27)

/** \\brief  Length for Ifx_ERAY_MSIC1_Bits.MSIP28 */
#define IFX_ERAY_MSIC1_MSIP28_LEN (1)

/** \\brief  Mask for Ifx_ERAY_MSIC1_Bits.MSIP28 */
#define IFX_ERAY_MSIC1_MSIP28_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_MSIC1_Bits.MSIP28 */
#define IFX_ERAY_MSIC1_MSIP28_OFF (28)

/** \\brief  Length for Ifx_ERAY_MSIC1_Bits.MSIP29 */
#define IFX_ERAY_MSIC1_MSIP29_LEN (1)

/** \\brief  Mask for Ifx_ERAY_MSIC1_Bits.MSIP29 */
#define IFX_ERAY_MSIC1_MSIP29_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_MSIC1_Bits.MSIP29 */
#define IFX_ERAY_MSIC1_MSIP29_OFF (29)

/** \\brief  Length for Ifx_ERAY_MSIC1_Bits.MSIP2 */
#define IFX_ERAY_MSIC1_MSIP2_LEN (1)

/** \\brief  Mask for Ifx_ERAY_MSIC1_Bits.MSIP2 */
#define IFX_ERAY_MSIC1_MSIP2_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_MSIC1_Bits.MSIP2 */
#define IFX_ERAY_MSIC1_MSIP2_OFF (2)

/** \\brief  Length for Ifx_ERAY_MSIC1_Bits.MSIP30 */
#define IFX_ERAY_MSIC1_MSIP30_LEN (1)

/** \\brief  Mask for Ifx_ERAY_MSIC1_Bits.MSIP30 */
#define IFX_ERAY_MSIC1_MSIP30_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_MSIC1_Bits.MSIP30 */
#define IFX_ERAY_MSIC1_MSIP30_OFF (30)

/** \\brief  Length for Ifx_ERAY_MSIC1_Bits.MSIP31 */
#define IFX_ERAY_MSIC1_MSIP31_LEN (1)

/** \\brief  Mask for Ifx_ERAY_MSIC1_Bits.MSIP31 */
#define IFX_ERAY_MSIC1_MSIP31_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_MSIC1_Bits.MSIP31 */
#define IFX_ERAY_MSIC1_MSIP31_OFF (31)

/** \\brief  Length for Ifx_ERAY_MSIC1_Bits.MSIP3 */
#define IFX_ERAY_MSIC1_MSIP3_LEN (1)

/** \\brief  Mask for Ifx_ERAY_MSIC1_Bits.MSIP3 */
#define IFX_ERAY_MSIC1_MSIP3_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_MSIC1_Bits.MSIP3 */
#define IFX_ERAY_MSIC1_MSIP3_OFF (3)

/** \\brief  Length for Ifx_ERAY_MSIC1_Bits.MSIP4 */
#define IFX_ERAY_MSIC1_MSIP4_LEN (1)

/** \\brief  Mask for Ifx_ERAY_MSIC1_Bits.MSIP4 */
#define IFX_ERAY_MSIC1_MSIP4_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_MSIC1_Bits.MSIP4 */
#define IFX_ERAY_MSIC1_MSIP4_OFF (4)

/** \\brief  Length for Ifx_ERAY_MSIC1_Bits.MSIP5 */
#define IFX_ERAY_MSIC1_MSIP5_LEN (1)

/** \\brief  Mask for Ifx_ERAY_MSIC1_Bits.MSIP5 */
#define IFX_ERAY_MSIC1_MSIP5_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_MSIC1_Bits.MSIP5 */
#define IFX_ERAY_MSIC1_MSIP5_OFF (5)

/** \\brief  Length for Ifx_ERAY_MSIC1_Bits.MSIP6 */
#define IFX_ERAY_MSIC1_MSIP6_LEN (1)

/** \\brief  Mask for Ifx_ERAY_MSIC1_Bits.MSIP6 */
#define IFX_ERAY_MSIC1_MSIP6_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_MSIC1_Bits.MSIP6 */
#define IFX_ERAY_MSIC1_MSIP6_OFF (6)

/** \\brief  Length for Ifx_ERAY_MSIC1_Bits.MSIP7 */
#define IFX_ERAY_MSIC1_MSIP7_LEN (1)

/** \\brief  Mask for Ifx_ERAY_MSIC1_Bits.MSIP7 */
#define IFX_ERAY_MSIC1_MSIP7_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_MSIC1_Bits.MSIP7 */
#define IFX_ERAY_MSIC1_MSIP7_OFF (7)

/** \\brief  Length for Ifx_ERAY_MSIC1_Bits.MSIP8 */
#define IFX_ERAY_MSIC1_MSIP8_LEN (1)

/** \\brief  Mask for Ifx_ERAY_MSIC1_Bits.MSIP8 */
#define IFX_ERAY_MSIC1_MSIP8_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_MSIC1_Bits.MSIP8 */
#define IFX_ERAY_MSIC1_MSIP8_OFF (8)

/** \\brief  Length for Ifx_ERAY_MSIC1_Bits.MSIP9 */
#define IFX_ERAY_MSIC1_MSIP9_LEN (1)

/** \\brief  Mask for Ifx_ERAY_MSIC1_Bits.MSIP9 */
#define IFX_ERAY_MSIC1_MSIP9_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_MSIC1_Bits.MSIP9 */
#define IFX_ERAY_MSIC1_MSIP9_OFF (9)

/** \\brief  Length for Ifx_ERAY_MSIC2_Bits.MSIP32 */
#define IFX_ERAY_MSIC2_MSIP32_LEN (1)

/** \\brief  Mask for Ifx_ERAY_MSIC2_Bits.MSIP32 */
#define IFX_ERAY_MSIC2_MSIP32_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_MSIC2_Bits.MSIP32 */
#define IFX_ERAY_MSIC2_MSIP32_OFF (0)

/** \\brief  Length for Ifx_ERAY_MSIC2_Bits.MSIP33 */
#define IFX_ERAY_MSIC2_MSIP33_LEN (1)

/** \\brief  Mask for Ifx_ERAY_MSIC2_Bits.MSIP33 */
#define IFX_ERAY_MSIC2_MSIP33_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_MSIC2_Bits.MSIP33 */
#define IFX_ERAY_MSIC2_MSIP33_OFF (1)

/** \\brief  Length for Ifx_ERAY_MSIC2_Bits.MSIP34 */
#define IFX_ERAY_MSIC2_MSIP34_LEN (1)

/** \\brief  Mask for Ifx_ERAY_MSIC2_Bits.MSIP34 */
#define IFX_ERAY_MSIC2_MSIP34_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_MSIC2_Bits.MSIP34 */
#define IFX_ERAY_MSIC2_MSIP34_OFF (2)

/** \\brief  Length for Ifx_ERAY_MSIC2_Bits.MSIP35 */
#define IFX_ERAY_MSIC2_MSIP35_LEN (1)

/** \\brief  Mask for Ifx_ERAY_MSIC2_Bits.MSIP35 */
#define IFX_ERAY_MSIC2_MSIP35_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_MSIC2_Bits.MSIP35 */
#define IFX_ERAY_MSIC2_MSIP35_OFF (3)

/** \\brief  Length for Ifx_ERAY_MSIC2_Bits.MSIP36 */
#define IFX_ERAY_MSIC2_MSIP36_LEN (1)

/** \\brief  Mask for Ifx_ERAY_MSIC2_Bits.MSIP36 */
#define IFX_ERAY_MSIC2_MSIP36_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_MSIC2_Bits.MSIP36 */
#define IFX_ERAY_MSIC2_MSIP36_OFF (4)

/** \\brief  Length for Ifx_ERAY_MSIC2_Bits.MSIP37 */
#define IFX_ERAY_MSIC2_MSIP37_LEN (1)

/** \\brief  Mask for Ifx_ERAY_MSIC2_Bits.MSIP37 */
#define IFX_ERAY_MSIC2_MSIP37_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_MSIC2_Bits.MSIP37 */
#define IFX_ERAY_MSIC2_MSIP37_OFF (5)

/** \\brief  Length for Ifx_ERAY_MSIC2_Bits.MSIP38 */
#define IFX_ERAY_MSIC2_MSIP38_LEN (1)

/** \\brief  Mask for Ifx_ERAY_MSIC2_Bits.MSIP38 */
#define IFX_ERAY_MSIC2_MSIP38_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_MSIC2_Bits.MSIP38 */
#define IFX_ERAY_MSIC2_MSIP38_OFF (6)

