keeper999/EngineControl_Aurix/01_Get_Src/BSW/VD56_BSW/VD56_GEN_BSW/MCAL_TC29X_DRV_P1/Drv/IfxEray_bf.h
/** \\brief  Length for Ifx_ERAY_MSIC2_Bits.MSIP39 */
#define IFX_ERAY_MSIC2_MSIP39_LEN (1)

/** \\brief  Mask for Ifx_ERAY_MSIC2_Bits.MSIP39 */
#define IFX_ERAY_MSIC2_MSIP39_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_MSIC2_Bits.MSIP39 */
#define IFX_ERAY_MSIC2_MSIP39_OFF (7)

/** \\brief  Length for Ifx_ERAY_MSIC2_Bits.MSIP40 */
#define IFX_ERAY_MSIC2_MSIP40_LEN (1)

/** \\brief  Mask for Ifx_ERAY_MSIC2_Bits.MSIP40 */
#define IFX_ERAY_MSIC2_MSIP40_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_MSIC2_Bits.MSIP40 */
#define IFX_ERAY_MSIC2_MSIP40_OFF (8)

/** \\brief  Length for Ifx_ERAY_MSIC2_Bits.MSIP41 */
#define IFX_ERAY_MSIC2_MSIP41_LEN (1)

/** \\brief  Mask for Ifx_ERAY_MSIC2_Bits.MSIP41 */
#define IFX_ERAY_MSIC2_MSIP41_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_MSIC2_Bits.MSIP41 */
#define IFX_ERAY_MSIC2_MSIP41_OFF (9)

/** \\brief  Length for Ifx_ERAY_MSIC2_Bits.MSIP42 */
#define IFX_ERAY_MSIC2_MSIP42_LEN (1)

/** \\brief  Mask for Ifx_ERAY_MSIC2_Bits.MSIP42 */
#define IFX_ERAY_MSIC2_MSIP42_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_MSIC2_Bits.MSIP42 */
#define IFX_ERAY_MSIC2_MSIP42_OFF (10)

/** \\brief  Length for Ifx_ERAY_MSIC2_Bits.MSIP43 */
#define IFX_ERAY_MSIC2_MSIP43_LEN (1)

/** \\brief  Mask for Ifx_ERAY_MSIC2_Bits.MSIP43 */
#define IFX_ERAY_MSIC2_MSIP43_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_MSIC2_Bits.MSIP43 */
#define IFX_ERAY_MSIC2_MSIP43_OFF (11)

/** \\brief  Length for Ifx_ERAY_MSIC2_Bits.MSIP44 */
#define IFX_ERAY_MSIC2_MSIP44_LEN (1)

/** \\brief  Mask for Ifx_ERAY_MSIC2_Bits.MSIP44 */
#define IFX_ERAY_MSIC2_MSIP44_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_MSIC2_Bits.MSIP44 */
#define IFX_ERAY_MSIC2_MSIP44_OFF (12)

/** \\brief  Length for Ifx_ERAY_MSIC2_Bits.MSIP45 */
#define IFX_ERAY_MSIC2_MSIP45_LEN (1)

/** \\brief  Mask for Ifx_ERAY_MSIC2_Bits.MSIP45 */
#define IFX_ERAY_MSIC2_MSIP45_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_MSIC2_Bits.MSIP45 */
#define IFX_ERAY_MSIC2_MSIP45_OFF (13)

/** \\brief  Length for Ifx_ERAY_MSIC2_Bits.MSIP46 */
#define IFX_ERAY_MSIC2_MSIP46_LEN (1)

/** \\brief  Mask for Ifx_ERAY_MSIC2_Bits.MSIP46 */
#define IFX_ERAY_MSIC2_MSIP46_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_MSIC2_Bits.MSIP46 */
#define IFX_ERAY_MSIC2_MSIP46_OFF (14)

/** \\brief  Length for Ifx_ERAY_MSIC2_Bits.MSIP47 */
#define IFX_ERAY_MSIC2_MSIP47_LEN (1)

/** \\brief  Mask for Ifx_ERAY_MSIC2_Bits.MSIP47 */
#define IFX_ERAY_MSIC2_MSIP47_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_MSIC2_Bits.MSIP47 */
#define IFX_ERAY_MSIC2_MSIP47_OFF (15)

/** \\brief  Length for Ifx_ERAY_MSIC2_Bits.MSIP48 */
#define IFX_ERAY_MSIC2_MSIP48_LEN (1)

/** \\brief  Mask for Ifx_ERAY_MSIC2_Bits.MSIP48 */
#define IFX_ERAY_MSIC2_MSIP48_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_MSIC2_Bits.MSIP48 */
#define IFX_ERAY_MSIC2_MSIP48_OFF (16)

/** \\brief  Length for Ifx_ERAY_MSIC2_Bits.MSIP49 */
#define IFX_ERAY_MSIC2_MSIP49_LEN (1)

/** \\brief  Mask for Ifx_ERAY_MSIC2_Bits.MSIP49 */
#define IFX_ERAY_MSIC2_MSIP49_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_MSIC2_Bits.MSIP49 */
#define IFX_ERAY_MSIC2_MSIP49_OFF (17)

/** \\brief  Length for Ifx_ERAY_MSIC2_Bits.MSIP50 */
#define IFX_ERAY_MSIC2_MSIP50_LEN (1)

/** \\brief  Mask for Ifx_ERAY_MSIC2_Bits.MSIP50 */
#define IFX_ERAY_MSIC2_MSIP50_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_MSIC2_Bits.MSIP50 */
#define IFX_ERAY_MSIC2_MSIP50_OFF (18)

/** \\brief  Length for Ifx_ERAY_MSIC2_Bits.MSIP51 */
#define IFX_ERAY_MSIC2_MSIP51_LEN (1)

/** \\brief  Mask for Ifx_ERAY_MSIC2_Bits.MSIP51 */
#define IFX_ERAY_MSIC2_MSIP51_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_MSIC2_Bits.MSIP51 */
#define IFX_ERAY_MSIC2_MSIP51_OFF (19)

/** \\brief  Length for Ifx_ERAY_MSIC2_Bits.MSIP52 */
#define IFX_ERAY_MSIC2_MSIP52_LEN (1)

/** \\brief  Mask for Ifx_ERAY_MSIC2_Bits.MSIP52 */
#define IFX_ERAY_MSIC2_MSIP52_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_MSIC2_Bits.MSIP52 */
#define IFX_ERAY_MSIC2_MSIP52_OFF (20)

/** \\brief  Length for Ifx_ERAY_MSIC2_Bits.MSIP53 */
#define IFX_ERAY_MSIC2_MSIP53_LEN (1)

/** \\brief  Mask for Ifx_ERAY_MSIC2_Bits.MSIP53 */
#define IFX_ERAY_MSIC2_MSIP53_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_MSIC2_Bits.MSIP53 */
#define IFX_ERAY_MSIC2_MSIP53_OFF (21)

/** \\brief  Length for Ifx_ERAY_MSIC2_Bits.MSIP54 */
#define IFX_ERAY_MSIC2_MSIP54_LEN (1)

/** \\brief  Mask for Ifx_ERAY_MSIC2_Bits.MSIP54 */
#define IFX_ERAY_MSIC2_MSIP54_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_MSIC2_Bits.MSIP54 */
#define IFX_ERAY_MSIC2_MSIP54_OFF (22)

/** \\brief  Length for Ifx_ERAY_MSIC2_Bits.MSIP55 */
#define IFX_ERAY_MSIC2_MSIP55_LEN (1)

/** \\brief  Mask for Ifx_ERAY_MSIC2_Bits.MSIP55 */
#define IFX_ERAY_MSIC2_MSIP55_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_MSIC2_Bits.MSIP55 */
#define IFX_ERAY_MSIC2_MSIP55_OFF (23)

/** \\brief  Length for Ifx_ERAY_MSIC2_Bits.MSIP56 */
#define IFX_ERAY_MSIC2_MSIP56_LEN (1)

/** \\brief  Mask for Ifx_ERAY_MSIC2_Bits.MSIP56 */
#define IFX_ERAY_MSIC2_MSIP56_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_MSIC2_Bits.MSIP56 */
#define IFX_ERAY_MSIC2_MSIP56_OFF (24)

/** \\brief  Length for Ifx_ERAY_MSIC2_Bits.MSIP57 */
#define IFX_ERAY_MSIC2_MSIP57_LEN (1)

/** \\brief  Mask for Ifx_ERAY_MSIC2_Bits.MSIP57 */
#define IFX_ERAY_MSIC2_MSIP57_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_MSIC2_Bits.MSIP57 */
#define IFX_ERAY_MSIC2_MSIP57_OFF (25)

/** \\brief  Length for Ifx_ERAY_MSIC2_Bits.MSIP58 */
#define IFX_ERAY_MSIC2_MSIP58_LEN (1)

/** \\brief  Mask for Ifx_ERAY_MSIC2_Bits.MSIP58 */
#define IFX_ERAY_MSIC2_MSIP58_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_MSIC2_Bits.MSIP58 */
#define IFX_ERAY_MSIC2_MSIP58_OFF (26)

/** \\brief  Length for Ifx_ERAY_MSIC2_Bits.MSIP59 */
#define IFX_ERAY_MSIC2_MSIP59_LEN (1)

/** \\brief  Mask for Ifx_ERAY_MSIC2_Bits.MSIP59 */
#define IFX_ERAY_MSIC2_MSIP59_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_MSIC2_Bits.MSIP59 */
#define IFX_ERAY_MSIC2_MSIP59_OFF (27)

/** \\brief  Length for Ifx_ERAY_MSIC2_Bits.MSIP60 */
#define IFX_ERAY_MSIC2_MSIP60_LEN (1)

/** \\brief  Mask for Ifx_ERAY_MSIC2_Bits.MSIP60 */
#define IFX_ERAY_MSIC2_MSIP60_MSK (0x1)

