keeper999/EngineControl_Aurix/01_Get_Src/BSW/VD56_BSW/VD56_GEN_BSW/MCAL_TC29X_DRV_P1/Drv/IfxEray_bf.h
/** \\brief  Offset for Ifx_ERAY_MSIC2_Bits.MSIP60 */
#define IFX_ERAY_MSIC2_MSIP60_OFF (28)

/** \\brief  Length for Ifx_ERAY_MSIC2_Bits.MSIP61 */
#define IFX_ERAY_MSIC2_MSIP61_LEN (1)

/** \\brief  Mask for Ifx_ERAY_MSIC2_Bits.MSIP61 */
#define IFX_ERAY_MSIC2_MSIP61_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_MSIC2_Bits.MSIP61 */
#define IFX_ERAY_MSIC2_MSIP61_OFF (29)

/** \\brief  Length for Ifx_ERAY_MSIC2_Bits.MSIP62 */
#define IFX_ERAY_MSIC2_MSIP62_LEN (1)

/** \\brief  Mask for Ifx_ERAY_MSIC2_Bits.MSIP62 */
#define IFX_ERAY_MSIC2_MSIP62_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_MSIC2_Bits.MSIP62 */
#define IFX_ERAY_MSIC2_MSIP62_OFF (30)

/** \\brief  Length for Ifx_ERAY_MSIC2_Bits.MSIP63 */
#define IFX_ERAY_MSIC2_MSIP63_LEN (1)

/** \\brief  Mask for Ifx_ERAY_MSIC2_Bits.MSIP63 */
#define IFX_ERAY_MSIC2_MSIP63_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_MSIC2_Bits.MSIP63 */
#define IFX_ERAY_MSIC2_MSIP63_OFF (31)

/** \\brief  Length for Ifx_ERAY_MSIC3_Bits.MSIP64 */
#define IFX_ERAY_MSIC3_MSIP64_LEN (1)

/** \\brief  Mask for Ifx_ERAY_MSIC3_Bits.MSIP64 */
#define IFX_ERAY_MSIC3_MSIP64_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_MSIC3_Bits.MSIP64 */
#define IFX_ERAY_MSIC3_MSIP64_OFF (0)

/** \\brief  Length for Ifx_ERAY_MSIC3_Bits.MSIP65 */
#define IFX_ERAY_MSIC3_MSIP65_LEN (1)

/** \\brief  Mask for Ifx_ERAY_MSIC3_Bits.MSIP65 */
#define IFX_ERAY_MSIC3_MSIP65_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_MSIC3_Bits.MSIP65 */
#define IFX_ERAY_MSIC3_MSIP65_OFF (1)

/** \\brief  Length for Ifx_ERAY_MSIC3_Bits.MSIP66 */
#define IFX_ERAY_MSIC3_MSIP66_LEN (1)

/** \\brief  Mask for Ifx_ERAY_MSIC3_Bits.MSIP66 */
#define IFX_ERAY_MSIC3_MSIP66_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_MSIC3_Bits.MSIP66 */
#define IFX_ERAY_MSIC3_MSIP66_OFF (2)

/** \\brief  Length for Ifx_ERAY_MSIC3_Bits.MSIP67 */
#define IFX_ERAY_MSIC3_MSIP67_LEN (1)

/** \\brief  Mask for Ifx_ERAY_MSIC3_Bits.MSIP67 */
#define IFX_ERAY_MSIC3_MSIP67_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_MSIC3_Bits.MSIP67 */
#define IFX_ERAY_MSIC3_MSIP67_OFF (3)

/** \\brief  Length for Ifx_ERAY_MSIC3_Bits.MSIP68 */
#define IFX_ERAY_MSIC3_MSIP68_LEN (1)

/** \\brief  Mask for Ifx_ERAY_MSIC3_Bits.MSIP68 */
#define IFX_ERAY_MSIC3_MSIP68_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_MSIC3_Bits.MSIP68 */
#define IFX_ERAY_MSIC3_MSIP68_OFF (4)

/** \\brief  Length for Ifx_ERAY_MSIC3_Bits.MSIP69 */
#define IFX_ERAY_MSIC3_MSIP69_LEN (1)

/** \\brief  Mask for Ifx_ERAY_MSIC3_Bits.MSIP69 */
#define IFX_ERAY_MSIC3_MSIP69_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_MSIC3_Bits.MSIP69 */
#define IFX_ERAY_MSIC3_MSIP69_OFF (5)

/** \\brief  Length for Ifx_ERAY_MSIC3_Bits.MSIP70 */
#define IFX_ERAY_MSIC3_MSIP70_LEN (1)

/** \\brief  Mask for Ifx_ERAY_MSIC3_Bits.MSIP70 */
#define IFX_ERAY_MSIC3_MSIP70_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_MSIC3_Bits.MSIP70 */
#define IFX_ERAY_MSIC3_MSIP70_OFF (6)

/** \\brief  Length for Ifx_ERAY_MSIC3_Bits.MSIP71 */
#define IFX_ERAY_MSIC3_MSIP71_LEN (1)

/** \\brief  Mask for Ifx_ERAY_MSIC3_Bits.MSIP71 */
#define IFX_ERAY_MSIC3_MSIP71_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_MSIC3_Bits.MSIP71 */
#define IFX_ERAY_MSIC3_MSIP71_OFF (7)

/** \\brief  Length for Ifx_ERAY_MSIC3_Bits.MSIP72 */
#define IFX_ERAY_MSIC3_MSIP72_LEN (1)

/** \\brief  Mask for Ifx_ERAY_MSIC3_Bits.MSIP72 */
#define IFX_ERAY_MSIC3_MSIP72_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_MSIC3_Bits.MSIP72 */
#define IFX_ERAY_MSIC3_MSIP72_OFF (8)

/** \\brief  Length for Ifx_ERAY_MSIC3_Bits.MSIP73 */
#define IFX_ERAY_MSIC3_MSIP73_LEN (1)

/** \\brief  Mask for Ifx_ERAY_MSIC3_Bits.MSIP73 */
#define IFX_ERAY_MSIC3_MSIP73_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_MSIC3_Bits.MSIP73 */
#define IFX_ERAY_MSIC3_MSIP73_OFF (9)

/** \\brief  Length for Ifx_ERAY_MSIC3_Bits.MSIP74 */
#define IFX_ERAY_MSIC3_MSIP74_LEN (1)

/** \\brief  Mask for Ifx_ERAY_MSIC3_Bits.MSIP74 */
#define IFX_ERAY_MSIC3_MSIP74_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_MSIC3_Bits.MSIP74 */
#define IFX_ERAY_MSIC3_MSIP74_OFF (10)

/** \\brief  Length for Ifx_ERAY_MSIC3_Bits.MSIP75 */
#define IFX_ERAY_MSIC3_MSIP75_LEN (1)

/** \\brief  Mask for Ifx_ERAY_MSIC3_Bits.MSIP75 */
#define IFX_ERAY_MSIC3_MSIP75_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_MSIC3_Bits.MSIP75 */
#define IFX_ERAY_MSIC3_MSIP75_OFF (11)

/** \\brief  Length for Ifx_ERAY_MSIC3_Bits.MSIP76 */
#define IFX_ERAY_MSIC3_MSIP76_LEN (1)

/** \\brief  Mask for Ifx_ERAY_MSIC3_Bits.MSIP76 */
#define IFX_ERAY_MSIC3_MSIP76_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_MSIC3_Bits.MSIP76 */
#define IFX_ERAY_MSIC3_MSIP76_OFF (12)

/** \\brief  Length for Ifx_ERAY_MSIC3_Bits.MSIP77 */
#define IFX_ERAY_MSIC3_MSIP77_LEN (1)

/** \\brief  Mask for Ifx_ERAY_MSIC3_Bits.MSIP77 */
#define IFX_ERAY_MSIC3_MSIP77_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_MSIC3_Bits.MSIP77 */
#define IFX_ERAY_MSIC3_MSIP77_OFF (13)

/** \\brief  Length for Ifx_ERAY_MSIC3_Bits.MSIP78 */
#define IFX_ERAY_MSIC3_MSIP78_LEN (1)

/** \\brief  Mask for Ifx_ERAY_MSIC3_Bits.MSIP78 */
#define IFX_ERAY_MSIC3_MSIP78_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_MSIC3_Bits.MSIP78 */
#define IFX_ERAY_MSIC3_MSIP78_OFF (14)

/** \\brief  Length for Ifx_ERAY_MSIC3_Bits.MSIP79 */
#define IFX_ERAY_MSIC3_MSIP79_LEN (1)

/** \\brief  Mask for Ifx_ERAY_MSIC3_Bits.MSIP79 */
#define IFX_ERAY_MSIC3_MSIP79_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_MSIC3_Bits.MSIP79 */
#define IFX_ERAY_MSIC3_MSIP79_OFF (15)

/** \\brief  Length for Ifx_ERAY_MSIC3_Bits.MSIP80 */
#define IFX_ERAY_MSIC3_MSIP80_LEN (1)

/** \\brief  Mask for Ifx_ERAY_MSIC3_Bits.MSIP80 */
#define IFX_ERAY_MSIC3_MSIP80_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_MSIC3_Bits.MSIP80 */
#define IFX_ERAY_MSIC3_MSIP80_OFF (16)

/** \\brief  Length for Ifx_ERAY_MSIC3_Bits.MSIP81 */
#define IFX_ERAY_MSIC3_MSIP81_LEN (1)

/** \\brief  Mask for Ifx_ERAY_MSIC3_Bits.MSIP81 */
#define IFX_ERAY_MSIC3_MSIP81_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_MSIC3_Bits.MSIP81 */
#define IFX_ERAY_MSIC3_MSIP81_OFF (17)

/** \\brief  Length for Ifx_ERAY_MSIC3_Bits.MSIP82 */
#define IFX_ERAY_MSIC3_MSIP82_LEN (1)

/** \\brief  Mask for Ifx_ERAY_MSIC3_Bits.MSIP82 */
#define IFX_ERAY_MSIC3_MSIP82_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_MSIC3_Bits.MSIP82 */
#define IFX_ERAY_MSIC3_MSIP82_OFF (18)

