keeper999/EngineControl_Aurix/01_Get_Src/BSW/VD56_BSW/VD56_GEN_BSW/MCAL_TC29X_DRV_P1/Drv/IfxEray_bf.h
/** \\brief  Length for Ifx_ERAY_MSIC3_Bits.MSIP83 */
#define IFX_ERAY_MSIC3_MSIP83_LEN (1)

/** \\brief  Mask for Ifx_ERAY_MSIC3_Bits.MSIP83 */
#define IFX_ERAY_MSIC3_MSIP83_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_MSIC3_Bits.MSIP83 */
#define IFX_ERAY_MSIC3_MSIP83_OFF (19)

/** \\brief  Length for Ifx_ERAY_MSIC3_Bits.MSIP84 */
#define IFX_ERAY_MSIC3_MSIP84_LEN (1)

/** \\brief  Mask for Ifx_ERAY_MSIC3_Bits.MSIP84 */
#define IFX_ERAY_MSIC3_MSIP84_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_MSIC3_Bits.MSIP84 */
#define IFX_ERAY_MSIC3_MSIP84_OFF (20)

/** \\brief  Length for Ifx_ERAY_MSIC3_Bits.MSIP85 */
#define IFX_ERAY_MSIC3_MSIP85_LEN (1)

/** \\brief  Mask for Ifx_ERAY_MSIC3_Bits.MSIP85 */
#define IFX_ERAY_MSIC3_MSIP85_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_MSIC3_Bits.MSIP85 */
#define IFX_ERAY_MSIC3_MSIP85_OFF (21)

/** \\brief  Length for Ifx_ERAY_MSIC3_Bits.MSIP86 */
#define IFX_ERAY_MSIC3_MSIP86_LEN (1)

/** \\brief  Mask for Ifx_ERAY_MSIC3_Bits.MSIP86 */
#define IFX_ERAY_MSIC3_MSIP86_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_MSIC3_Bits.MSIP86 */
#define IFX_ERAY_MSIC3_MSIP86_OFF (22)

/** \\brief  Length for Ifx_ERAY_MSIC3_Bits.MSIP87 */
#define IFX_ERAY_MSIC3_MSIP87_LEN (1)

/** \\brief  Mask for Ifx_ERAY_MSIC3_Bits.MSIP87 */
#define IFX_ERAY_MSIC3_MSIP87_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_MSIC3_Bits.MSIP87 */
#define IFX_ERAY_MSIC3_MSIP87_OFF (23)

/** \\brief  Length for Ifx_ERAY_MSIC3_Bits.MSIP88 */
#define IFX_ERAY_MSIC3_MSIP88_LEN (1)

/** \\brief  Mask for Ifx_ERAY_MSIC3_Bits.MSIP88 */
#define IFX_ERAY_MSIC3_MSIP88_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_MSIC3_Bits.MSIP88 */
#define IFX_ERAY_MSIC3_MSIP88_OFF (24)

/** \\brief  Length for Ifx_ERAY_MSIC3_Bits.MSIP89 */
#define IFX_ERAY_MSIC3_MSIP89_LEN (1)

/** \\brief  Mask for Ifx_ERAY_MSIC3_Bits.MSIP89 */
#define IFX_ERAY_MSIC3_MSIP89_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_MSIC3_Bits.MSIP89 */
#define IFX_ERAY_MSIC3_MSIP89_OFF (25)

/** \\brief  Length for Ifx_ERAY_MSIC3_Bits.MSIP90 */
#define IFX_ERAY_MSIC3_MSIP90_LEN (1)

/** \\brief  Mask for Ifx_ERAY_MSIC3_Bits.MSIP90 */
#define IFX_ERAY_MSIC3_MSIP90_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_MSIC3_Bits.MSIP90 */
#define IFX_ERAY_MSIC3_MSIP90_OFF (26)

/** \\brief  Length for Ifx_ERAY_MSIC3_Bits.MSIP91 */
#define IFX_ERAY_MSIC3_MSIP91_LEN (1)

/** \\brief  Mask for Ifx_ERAY_MSIC3_Bits.MSIP91 */
#define IFX_ERAY_MSIC3_MSIP91_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_MSIC3_Bits.MSIP91 */
#define IFX_ERAY_MSIC3_MSIP91_OFF (27)

/** \\brief  Length for Ifx_ERAY_MSIC3_Bits.MSIP92 */
#define IFX_ERAY_MSIC3_MSIP92_LEN (1)

/** \\brief  Mask for Ifx_ERAY_MSIC3_Bits.MSIP92 */
#define IFX_ERAY_MSIC3_MSIP92_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_MSIC3_Bits.MSIP92 */
#define IFX_ERAY_MSIC3_MSIP92_OFF (28)

/** \\brief  Length for Ifx_ERAY_MSIC3_Bits.MSIP93 */
#define IFX_ERAY_MSIC3_MSIP93_LEN (1)

/** \\brief  Mask for Ifx_ERAY_MSIC3_Bits.MSIP93 */
#define IFX_ERAY_MSIC3_MSIP93_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_MSIC3_Bits.MSIP93 */
#define IFX_ERAY_MSIC3_MSIP93_OFF (29)

/** \\brief  Length for Ifx_ERAY_MSIC3_Bits.MSIP94 */
#define IFX_ERAY_MSIC3_MSIP94_LEN (1)

/** \\brief  Mask for Ifx_ERAY_MSIC3_Bits.MSIP94 */
#define IFX_ERAY_MSIC3_MSIP94_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_MSIC3_Bits.MSIP94 */
#define IFX_ERAY_MSIC3_MSIP94_OFF (30)

/** \\brief  Length for Ifx_ERAY_MSIC3_Bits.MSIP95 */
#define IFX_ERAY_MSIC3_MSIP95_LEN (1)

/** \\brief  Mask for Ifx_ERAY_MSIC3_Bits.MSIP95 */
#define IFX_ERAY_MSIC3_MSIP95_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_MSIC3_Bits.MSIP95 */
#define IFX_ERAY_MSIC3_MSIP95_OFF (31)

/** \\brief  Length for Ifx_ERAY_MSIC4_Bits.MSIP100 */
#define IFX_ERAY_MSIC4_MSIP100_LEN (1)

/** \\brief  Mask for Ifx_ERAY_MSIC4_Bits.MSIP100 */
#define IFX_ERAY_MSIC4_MSIP100_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_MSIC4_Bits.MSIP100 */
#define IFX_ERAY_MSIC4_MSIP100_OFF (4)

/** \\brief  Length for Ifx_ERAY_MSIC4_Bits.MSIP101 */
#define IFX_ERAY_MSIC4_MSIP101_LEN (1)

/** \\brief  Mask for Ifx_ERAY_MSIC4_Bits.MSIP101 */
#define IFX_ERAY_MSIC4_MSIP101_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_MSIC4_Bits.MSIP101 */
#define IFX_ERAY_MSIC4_MSIP101_OFF (5)

/** \\brief  Length for Ifx_ERAY_MSIC4_Bits.MSIP102 */
#define IFX_ERAY_MSIC4_MSIP102_LEN (1)

/** \\brief  Mask for Ifx_ERAY_MSIC4_Bits.MSIP102 */
#define IFX_ERAY_MSIC4_MSIP102_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_MSIC4_Bits.MSIP102 */
#define IFX_ERAY_MSIC4_MSIP102_OFF (6)

/** \\brief  Length for Ifx_ERAY_MSIC4_Bits.MSIP103 */
#define IFX_ERAY_MSIC4_MSIP103_LEN (1)

/** \\brief  Mask for Ifx_ERAY_MSIC4_Bits.MSIP103 */
#define IFX_ERAY_MSIC4_MSIP103_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_MSIC4_Bits.MSIP103 */
#define IFX_ERAY_MSIC4_MSIP103_OFF (7)

/** \\brief  Length for Ifx_ERAY_MSIC4_Bits.MSIP104 */
#define IFX_ERAY_MSIC4_MSIP104_LEN (1)

/** \\brief  Mask for Ifx_ERAY_MSIC4_Bits.MSIP104 */
#define IFX_ERAY_MSIC4_MSIP104_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_MSIC4_Bits.MSIP104 */
#define IFX_ERAY_MSIC4_MSIP104_OFF (8)

/** \\brief  Length for Ifx_ERAY_MSIC4_Bits.MSIP105 */
#define IFX_ERAY_MSIC4_MSIP105_LEN (1)

/** \\brief  Mask for Ifx_ERAY_MSIC4_Bits.MSIP105 */
#define IFX_ERAY_MSIC4_MSIP105_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_MSIC4_Bits.MSIP105 */
#define IFX_ERAY_MSIC4_MSIP105_OFF (9)

/** \\brief  Length for Ifx_ERAY_MSIC4_Bits.MSIP106 */
#define IFX_ERAY_MSIC4_MSIP106_LEN (1)

/** \\brief  Mask for Ifx_ERAY_MSIC4_Bits.MSIP106 */
#define IFX_ERAY_MSIC4_MSIP106_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_MSIC4_Bits.MSIP106 */
#define IFX_ERAY_MSIC4_MSIP106_OFF (10)

/** \\brief  Length for Ifx_ERAY_MSIC4_Bits.MSIP107 */
#define IFX_ERAY_MSIC4_MSIP107_LEN (1)

/** \\brief  Mask for Ifx_ERAY_MSIC4_Bits.MSIP107 */
#define IFX_ERAY_MSIC4_MSIP107_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_MSIC4_Bits.MSIP107 */
#define IFX_ERAY_MSIC4_MSIP107_OFF (11)

/** \\brief  Length for Ifx_ERAY_MSIC4_Bits.MSIP108 */
#define IFX_ERAY_MSIC4_MSIP108_LEN (1)

