keeper999/EngineControl_Aurix/01_Get_Src/BSW/VD56_BSW/VD56_GEN_BSW/MCAL_TC29X_DRV_P1/Drv/IfxEray_bf.h
/** \\brief  Mask for Ifx_ERAY_MSIC4_Bits.MSIP108 */
#define IFX_ERAY_MSIC4_MSIP108_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_MSIC4_Bits.MSIP108 */
#define IFX_ERAY_MSIC4_MSIP108_OFF (12)

/** \\brief  Length for Ifx_ERAY_MSIC4_Bits.MSIP109 */
#define IFX_ERAY_MSIC4_MSIP109_LEN (1)

/** \\brief  Mask for Ifx_ERAY_MSIC4_Bits.MSIP109 */
#define IFX_ERAY_MSIC4_MSIP109_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_MSIC4_Bits.MSIP109 */
#define IFX_ERAY_MSIC4_MSIP109_OFF (13)

/** \\brief  Length for Ifx_ERAY_MSIC4_Bits.MSIP110 */
#define IFX_ERAY_MSIC4_MSIP110_LEN (1)

/** \\brief  Mask for Ifx_ERAY_MSIC4_Bits.MSIP110 */
#define IFX_ERAY_MSIC4_MSIP110_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_MSIC4_Bits.MSIP110 */
#define IFX_ERAY_MSIC4_MSIP110_OFF (14)

/** \\brief  Length for Ifx_ERAY_MSIC4_Bits.MSIP111 */
#define IFX_ERAY_MSIC4_MSIP111_LEN (1)

/** \\brief  Mask for Ifx_ERAY_MSIC4_Bits.MSIP111 */
#define IFX_ERAY_MSIC4_MSIP111_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_MSIC4_Bits.MSIP111 */
#define IFX_ERAY_MSIC4_MSIP111_OFF (15)

/** \\brief  Length for Ifx_ERAY_MSIC4_Bits.MSIP112 */
#define IFX_ERAY_MSIC4_MSIP112_LEN (1)

/** \\brief  Mask for Ifx_ERAY_MSIC4_Bits.MSIP112 */
#define IFX_ERAY_MSIC4_MSIP112_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_MSIC4_Bits.MSIP112 */
#define IFX_ERAY_MSIC4_MSIP112_OFF (16)

/** \\brief  Length for Ifx_ERAY_MSIC4_Bits.MSIP113 */
#define IFX_ERAY_MSIC4_MSIP113_LEN (1)

/** \\brief  Mask for Ifx_ERAY_MSIC4_Bits.MSIP113 */
#define IFX_ERAY_MSIC4_MSIP113_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_MSIC4_Bits.MSIP113 */
#define IFX_ERAY_MSIC4_MSIP113_OFF (17)

/** \\brief  Length for Ifx_ERAY_MSIC4_Bits.MSIP114 */
#define IFX_ERAY_MSIC4_MSIP114_LEN (1)

/** \\brief  Mask for Ifx_ERAY_MSIC4_Bits.MSIP114 */
#define IFX_ERAY_MSIC4_MSIP114_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_MSIC4_Bits.MSIP114 */
#define IFX_ERAY_MSIC4_MSIP114_OFF (18)

/** \\brief  Length for Ifx_ERAY_MSIC4_Bits.MSIP115 */
#define IFX_ERAY_MSIC4_MSIP115_LEN (1)

/** \\brief  Mask for Ifx_ERAY_MSIC4_Bits.MSIP115 */
#define IFX_ERAY_MSIC4_MSIP115_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_MSIC4_Bits.MSIP115 */
#define IFX_ERAY_MSIC4_MSIP115_OFF (19)

/** \\brief  Length for Ifx_ERAY_MSIC4_Bits.MSIP116 */
#define IFX_ERAY_MSIC4_MSIP116_LEN (1)

/** \\brief  Mask for Ifx_ERAY_MSIC4_Bits.MSIP116 */
#define IFX_ERAY_MSIC4_MSIP116_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_MSIC4_Bits.MSIP116 */
#define IFX_ERAY_MSIC4_MSIP116_OFF (20)

/** \\brief  Length for Ifx_ERAY_MSIC4_Bits.MSIP117 */
#define IFX_ERAY_MSIC4_MSIP117_LEN (1)

/** \\brief  Mask for Ifx_ERAY_MSIC4_Bits.MSIP117 */
#define IFX_ERAY_MSIC4_MSIP117_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_MSIC4_Bits.MSIP117 */
#define IFX_ERAY_MSIC4_MSIP117_OFF (21)

/** \\brief  Length for Ifx_ERAY_MSIC4_Bits.MSIP118 */
#define IFX_ERAY_MSIC4_MSIP118_LEN (1)

/** \\brief  Mask for Ifx_ERAY_MSIC4_Bits.MSIP118 */
#define IFX_ERAY_MSIC4_MSIP118_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_MSIC4_Bits.MSIP118 */
#define IFX_ERAY_MSIC4_MSIP118_OFF (22)

/** \\brief  Length for Ifx_ERAY_MSIC4_Bits.MSIP119 */
#define IFX_ERAY_MSIC4_MSIP119_LEN (1)

/** \\brief  Mask for Ifx_ERAY_MSIC4_Bits.MSIP119 */
#define IFX_ERAY_MSIC4_MSIP119_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_MSIC4_Bits.MSIP119 */
#define IFX_ERAY_MSIC4_MSIP119_OFF (23)

/** \\brief  Length for Ifx_ERAY_MSIC4_Bits.MSIP120 */
#define IFX_ERAY_MSIC4_MSIP120_LEN (1)

/** \\brief  Mask for Ifx_ERAY_MSIC4_Bits.MSIP120 */
#define IFX_ERAY_MSIC4_MSIP120_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_MSIC4_Bits.MSIP120 */
#define IFX_ERAY_MSIC4_MSIP120_OFF (24)

/** \\brief  Length for Ifx_ERAY_MSIC4_Bits.MSIP121 */
#define IFX_ERAY_MSIC4_MSIP121_LEN (1)

/** \\brief  Mask for Ifx_ERAY_MSIC4_Bits.MSIP121 */
#define IFX_ERAY_MSIC4_MSIP121_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_MSIC4_Bits.MSIP121 */
#define IFX_ERAY_MSIC4_MSIP121_OFF (25)

/** \\brief  Length for Ifx_ERAY_MSIC4_Bits.MSIP122 */
#define IFX_ERAY_MSIC4_MSIP122_LEN (1)

/** \\brief  Mask for Ifx_ERAY_MSIC4_Bits.MSIP122 */
#define IFX_ERAY_MSIC4_MSIP122_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_MSIC4_Bits.MSIP122 */
#define IFX_ERAY_MSIC4_MSIP122_OFF (26)

/** \\brief  Length for Ifx_ERAY_MSIC4_Bits.MSIP123 */
#define IFX_ERAY_MSIC4_MSIP123_LEN (1)

/** \\brief  Mask for Ifx_ERAY_MSIC4_Bits.MSIP123 */
#define IFX_ERAY_MSIC4_MSIP123_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_MSIC4_Bits.MSIP123 */
#define IFX_ERAY_MSIC4_MSIP123_OFF (27)

/** \\brief  Length for Ifx_ERAY_MSIC4_Bits.MSIP124 */
#define IFX_ERAY_MSIC4_MSIP124_LEN (1)

/** \\brief  Mask for Ifx_ERAY_MSIC4_Bits.MSIP124 */
#define IFX_ERAY_MSIC4_MSIP124_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_MSIC4_Bits.MSIP124 */
#define IFX_ERAY_MSIC4_MSIP124_OFF (28)

/** \\brief  Length for Ifx_ERAY_MSIC4_Bits.MSIP125 */
#define IFX_ERAY_MSIC4_MSIP125_LEN (1)

/** \\brief  Mask for Ifx_ERAY_MSIC4_Bits.MSIP125 */
#define IFX_ERAY_MSIC4_MSIP125_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_MSIC4_Bits.MSIP125 */
#define IFX_ERAY_MSIC4_MSIP125_OFF (29)

/** \\brief  Length for Ifx_ERAY_MSIC4_Bits.MSIP126 */
#define IFX_ERAY_MSIC4_MSIP126_LEN (1)

/** \\brief  Mask for Ifx_ERAY_MSIC4_Bits.MSIP126 */
#define IFX_ERAY_MSIC4_MSIP126_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_MSIC4_Bits.MSIP126 */
#define IFX_ERAY_MSIC4_MSIP126_OFF (30)

/** \\brief  Length for Ifx_ERAY_MSIC4_Bits.MSIP127 */
#define IFX_ERAY_MSIC4_MSIP127_LEN (1)

/** \\brief  Mask for Ifx_ERAY_MSIC4_Bits.MSIP127 */
#define IFX_ERAY_MSIC4_MSIP127_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_MSIC4_Bits.MSIP127 */
#define IFX_ERAY_MSIC4_MSIP127_OFF (31)

/** \\brief  Length for Ifx_ERAY_MSIC4_Bits.MSIP96 */
#define IFX_ERAY_MSIC4_MSIP96_LEN (1)

/** \\brief  Mask for Ifx_ERAY_MSIC4_Bits.MSIP96 */
#define IFX_ERAY_MSIC4_MSIP96_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_MSIC4_Bits.MSIP96 */
#define IFX_ERAY_MSIC4_MSIP96_OFF (0)

/** \\brief  Length for Ifx_ERAY_MSIC4_Bits.MSIP97 */
#define IFX_ERAY_MSIC4_MSIP97_LEN (1)

/** \\brief  Mask for Ifx_ERAY_MSIC4_Bits.MSIP97 */
#define IFX_ERAY_MSIC4_MSIP97_MSK (0x1)

