keeper999/EngineControl_Aurix/01_Get_Src/BSW/VD56_BSW/VD56_GEN_BSW/MCAL_TC29X_DRV_P1/Drv/IfxEray_bf.h
/** \\brief  Offset for Ifx_ERAY_MSIC4_Bits.MSIP97 */
#define IFX_ERAY_MSIC4_MSIP97_OFF (1)

/** \\brief  Length for Ifx_ERAY_MSIC4_Bits.MSIP98 */
#define IFX_ERAY_MSIC4_MSIP98_LEN (1)

/** \\brief  Mask for Ifx_ERAY_MSIC4_Bits.MSIP98 */
#define IFX_ERAY_MSIC4_MSIP98_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_MSIC4_Bits.MSIP98 */
#define IFX_ERAY_MSIC4_MSIP98_OFF (2)

/** \\brief  Length for Ifx_ERAY_MSIC4_Bits.MSIP99 */
#define IFX_ERAY_MSIC4_MSIP99_LEN (1)

/** \\brief  Mask for Ifx_ERAY_MSIC4_Bits.MSIP99 */
#define IFX_ERAY_MSIC4_MSIP99_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_MSIC4_Bits.MSIP99 */
#define IFX_ERAY_MSIC4_MSIP99_OFF (3)

/** \\brief  Length for Ifx_ERAY_MTCCV_Bits.CCV */
#define IFX_ERAY_MTCCV_CCV_LEN (6)

/** \\brief  Mask for Ifx_ERAY_MTCCV_Bits.CCV */
#define IFX_ERAY_MTCCV_CCV_MSK (0x3f)

/** \\brief  Offset for Ifx_ERAY_MTCCV_Bits.CCV */
#define IFX_ERAY_MTCCV_CCV_OFF (16)

/** \\brief  Length for Ifx_ERAY_MTCCV_Bits.MTV */
#define IFX_ERAY_MTCCV_MTV_LEN (14)

/** \\brief  Mask for Ifx_ERAY_MTCCV_Bits.MTV */
#define IFX_ERAY_MTCCV_MTV_MSK (0x3fff)

/** \\brief  Offset for Ifx_ERAY_MTCCV_Bits.MTV */
#define IFX_ERAY_MTCCV_MTV_OFF (0)

/** \\brief  Length for Ifx_ERAY_NDAT1_Bits.ND0 */
#define IFX_ERAY_NDAT1_ND0_LEN (1)

/** \\brief  Mask for Ifx_ERAY_NDAT1_Bits.ND0 */
#define IFX_ERAY_NDAT1_ND0_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_NDAT1_Bits.ND0 */
#define IFX_ERAY_NDAT1_ND0_OFF (0)

/** \\brief  Length for Ifx_ERAY_NDAT1_Bits.ND10 */
#define IFX_ERAY_NDAT1_ND10_LEN (1)

/** \\brief  Mask for Ifx_ERAY_NDAT1_Bits.ND10 */
#define IFX_ERAY_NDAT1_ND10_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_NDAT1_Bits.ND10 */
#define IFX_ERAY_NDAT1_ND10_OFF (10)

/** \\brief  Length for Ifx_ERAY_NDAT1_Bits.ND11 */
#define IFX_ERAY_NDAT1_ND11_LEN (1)

/** \\brief  Mask for Ifx_ERAY_NDAT1_Bits.ND11 */
#define IFX_ERAY_NDAT1_ND11_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_NDAT1_Bits.ND11 */
#define IFX_ERAY_NDAT1_ND11_OFF (11)

/** \\brief  Length for Ifx_ERAY_NDAT1_Bits.ND12 */
#define IFX_ERAY_NDAT1_ND12_LEN (1)

/** \\brief  Mask for Ifx_ERAY_NDAT1_Bits.ND12 */
#define IFX_ERAY_NDAT1_ND12_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_NDAT1_Bits.ND12 */
#define IFX_ERAY_NDAT1_ND12_OFF (12)

/** \\brief  Length for Ifx_ERAY_NDAT1_Bits.ND13 */
#define IFX_ERAY_NDAT1_ND13_LEN (1)

/** \\brief  Mask for Ifx_ERAY_NDAT1_Bits.ND13 */
#define IFX_ERAY_NDAT1_ND13_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_NDAT1_Bits.ND13 */
#define IFX_ERAY_NDAT1_ND13_OFF (13)

/** \\brief  Length for Ifx_ERAY_NDAT1_Bits.ND14 */
#define IFX_ERAY_NDAT1_ND14_LEN (1)

/** \\brief  Mask for Ifx_ERAY_NDAT1_Bits.ND14 */
#define IFX_ERAY_NDAT1_ND14_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_NDAT1_Bits.ND14 */
#define IFX_ERAY_NDAT1_ND14_OFF (14)

/** \\brief  Length for Ifx_ERAY_NDAT1_Bits.ND15 */
#define IFX_ERAY_NDAT1_ND15_LEN (1)

/** \\brief  Mask for Ifx_ERAY_NDAT1_Bits.ND15 */
#define IFX_ERAY_NDAT1_ND15_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_NDAT1_Bits.ND15 */
#define IFX_ERAY_NDAT1_ND15_OFF (15)

/** \\brief  Length for Ifx_ERAY_NDAT1_Bits.ND16 */
#define IFX_ERAY_NDAT1_ND16_LEN (1)

/** \\brief  Mask for Ifx_ERAY_NDAT1_Bits.ND16 */
#define IFX_ERAY_NDAT1_ND16_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_NDAT1_Bits.ND16 */
#define IFX_ERAY_NDAT1_ND16_OFF (16)

/** \\brief  Length for Ifx_ERAY_NDAT1_Bits.ND17 */
#define IFX_ERAY_NDAT1_ND17_LEN (1)

/** \\brief  Mask for Ifx_ERAY_NDAT1_Bits.ND17 */
#define IFX_ERAY_NDAT1_ND17_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_NDAT1_Bits.ND17 */
#define IFX_ERAY_NDAT1_ND17_OFF (17)

/** \\brief  Length for Ifx_ERAY_NDAT1_Bits.ND18 */
#define IFX_ERAY_NDAT1_ND18_LEN (1)

/** \\brief  Mask for Ifx_ERAY_NDAT1_Bits.ND18 */
#define IFX_ERAY_NDAT1_ND18_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_NDAT1_Bits.ND18 */
#define IFX_ERAY_NDAT1_ND18_OFF (18)

/** \\brief  Length for Ifx_ERAY_NDAT1_Bits.ND19 */
#define IFX_ERAY_NDAT1_ND19_LEN (1)

/** \\brief  Mask for Ifx_ERAY_NDAT1_Bits.ND19 */
#define IFX_ERAY_NDAT1_ND19_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_NDAT1_Bits.ND19 */
#define IFX_ERAY_NDAT1_ND19_OFF (19)

/** \\brief  Length for Ifx_ERAY_NDAT1_Bits.ND1 */
#define IFX_ERAY_NDAT1_ND1_LEN (1)

/** \\brief  Mask for Ifx_ERAY_NDAT1_Bits.ND1 */
#define IFX_ERAY_NDAT1_ND1_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_NDAT1_Bits.ND1 */
#define IFX_ERAY_NDAT1_ND1_OFF (1)

/** \\brief  Length for Ifx_ERAY_NDAT1_Bits.ND20 */
#define IFX_ERAY_NDAT1_ND20_LEN (1)

/** \\brief  Mask for Ifx_ERAY_NDAT1_Bits.ND20 */
#define IFX_ERAY_NDAT1_ND20_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_NDAT1_Bits.ND20 */
#define IFX_ERAY_NDAT1_ND20_OFF (20)

/** \\brief  Length for Ifx_ERAY_NDAT1_Bits.ND21 */
#define IFX_ERAY_NDAT1_ND21_LEN (1)

/** \\brief  Mask for Ifx_ERAY_NDAT1_Bits.ND21 */
#define IFX_ERAY_NDAT1_ND21_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_NDAT1_Bits.ND21 */
#define IFX_ERAY_NDAT1_ND21_OFF (21)

/** \\brief  Length for Ifx_ERAY_NDAT1_Bits.ND22 */
#define IFX_ERAY_NDAT1_ND22_LEN (1)

/** \\brief  Mask for Ifx_ERAY_NDAT1_Bits.ND22 */
#define IFX_ERAY_NDAT1_ND22_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_NDAT1_Bits.ND22 */
#define IFX_ERAY_NDAT1_ND22_OFF (22)

/** \\brief  Length for Ifx_ERAY_NDAT1_Bits.ND23 */
#define IFX_ERAY_NDAT1_ND23_LEN (1)

/** \\brief  Mask for Ifx_ERAY_NDAT1_Bits.ND23 */
#define IFX_ERAY_NDAT1_ND23_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_NDAT1_Bits.ND23 */
#define IFX_ERAY_NDAT1_ND23_OFF (23)

/** \\brief  Length for Ifx_ERAY_NDAT1_Bits.ND24 */
#define IFX_ERAY_NDAT1_ND24_LEN (1)

/** \\brief  Mask for Ifx_ERAY_NDAT1_Bits.ND24 */
#define IFX_ERAY_NDAT1_ND24_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_NDAT1_Bits.ND24 */
#define IFX_ERAY_NDAT1_ND24_OFF (24)

/** \\brief  Length for Ifx_ERAY_NDAT1_Bits.ND25 */
#define IFX_ERAY_NDAT1_ND25_LEN (1)

/** \\brief  Mask for Ifx_ERAY_NDAT1_Bits.ND25 */
#define IFX_ERAY_NDAT1_ND25_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_NDAT1_Bits.ND25 */
#define IFX_ERAY_NDAT1_ND25_OFF (25)

/** \\brief  Length for Ifx_ERAY_NDAT1_Bits.ND26 */
#define IFX_ERAY_NDAT1_ND26_LEN (1)

/** \\brief  Mask for Ifx_ERAY_NDAT1_Bits.ND26 */
#define IFX_ERAY_NDAT1_ND26_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_NDAT1_Bits.ND26 */
#define IFX_ERAY_NDAT1_ND26_OFF (26)

/** \\brief  Length for Ifx_ERAY_NDAT1_Bits.ND27 */
#define IFX_ERAY_NDAT1_ND27_LEN (1)

