keeper999/EngineControl_Aurix/01_Get_Src/BSW/VD56_BSW/VD56_GEN_BSW/MCAL_TC29X_DRV_P1/Drv/IfxEray_bf.h
/** \\brief  Mask for Ifx_ERAY_NDAT2_Bits.ND43 */
#define IFX_ERAY_NDAT2_ND43_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_NDAT2_Bits.ND43 */
#define IFX_ERAY_NDAT2_ND43_OFF (11)

/** \\brief  Length for Ifx_ERAY_NDAT2_Bits.ND44 */
#define IFX_ERAY_NDAT2_ND44_LEN (1)

/** \\brief  Mask for Ifx_ERAY_NDAT2_Bits.ND44 */
#define IFX_ERAY_NDAT2_ND44_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_NDAT2_Bits.ND44 */
#define IFX_ERAY_NDAT2_ND44_OFF (12)

/** \\brief  Length for Ifx_ERAY_NDAT2_Bits.ND45 */
#define IFX_ERAY_NDAT2_ND45_LEN (1)

/** \\brief  Mask for Ifx_ERAY_NDAT2_Bits.ND45 */
#define IFX_ERAY_NDAT2_ND45_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_NDAT2_Bits.ND45 */
#define IFX_ERAY_NDAT2_ND45_OFF (13)

/** \\brief  Length for Ifx_ERAY_NDAT2_Bits.ND46 */
#define IFX_ERAY_NDAT2_ND46_LEN (1)

/** \\brief  Mask for Ifx_ERAY_NDAT2_Bits.ND46 */
#define IFX_ERAY_NDAT2_ND46_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_NDAT2_Bits.ND46 */
#define IFX_ERAY_NDAT2_ND46_OFF (14)

/** \\brief  Length for Ifx_ERAY_NDAT2_Bits.ND47 */
#define IFX_ERAY_NDAT2_ND47_LEN (1)

/** \\brief  Mask for Ifx_ERAY_NDAT2_Bits.ND47 */
#define IFX_ERAY_NDAT2_ND47_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_NDAT2_Bits.ND47 */
#define IFX_ERAY_NDAT2_ND47_OFF (15)

/** \\brief  Length for Ifx_ERAY_NDAT2_Bits.ND48 */
#define IFX_ERAY_NDAT2_ND48_LEN (1)

/** \\brief  Mask for Ifx_ERAY_NDAT2_Bits.ND48 */
#define IFX_ERAY_NDAT2_ND48_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_NDAT2_Bits.ND48 */
#define IFX_ERAY_NDAT2_ND48_OFF (16)

/** \\brief  Length for Ifx_ERAY_NDAT2_Bits.ND49 */
#define IFX_ERAY_NDAT2_ND49_LEN (1)

/** \\brief  Mask for Ifx_ERAY_NDAT2_Bits.ND49 */
#define IFX_ERAY_NDAT2_ND49_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_NDAT2_Bits.ND49 */
#define IFX_ERAY_NDAT2_ND49_OFF (17)

/** \\brief  Length for Ifx_ERAY_NDAT2_Bits.ND50 */
#define IFX_ERAY_NDAT2_ND50_LEN (1)

/** \\brief  Mask for Ifx_ERAY_NDAT2_Bits.ND50 */
#define IFX_ERAY_NDAT2_ND50_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_NDAT2_Bits.ND50 */
#define IFX_ERAY_NDAT2_ND50_OFF (18)

/** \\brief  Length for Ifx_ERAY_NDAT2_Bits.ND51 */
#define IFX_ERAY_NDAT2_ND51_LEN (1)

/** \\brief  Mask for Ifx_ERAY_NDAT2_Bits.ND51 */
#define IFX_ERAY_NDAT2_ND51_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_NDAT2_Bits.ND51 */
#define IFX_ERAY_NDAT2_ND51_OFF (19)

/** \\brief  Length for Ifx_ERAY_NDAT2_Bits.ND52 */
#define IFX_ERAY_NDAT2_ND52_LEN (1)

/** \\brief  Mask for Ifx_ERAY_NDAT2_Bits.ND52 */
#define IFX_ERAY_NDAT2_ND52_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_NDAT2_Bits.ND52 */
#define IFX_ERAY_NDAT2_ND52_OFF (20)

/** \\brief  Length for Ifx_ERAY_NDAT2_Bits.ND53 */
#define IFX_ERAY_NDAT2_ND53_LEN (1)

/** \\brief  Mask for Ifx_ERAY_NDAT2_Bits.ND53 */
#define IFX_ERAY_NDAT2_ND53_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_NDAT2_Bits.ND53 */
#define IFX_ERAY_NDAT2_ND53_OFF (21)

/** \\brief  Length for Ifx_ERAY_NDAT2_Bits.ND54 */
#define IFX_ERAY_NDAT2_ND54_LEN (1)

/** \\brief  Mask for Ifx_ERAY_NDAT2_Bits.ND54 */
#define IFX_ERAY_NDAT2_ND54_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_NDAT2_Bits.ND54 */
#define IFX_ERAY_NDAT2_ND54_OFF (22)

/** \\brief  Length for Ifx_ERAY_NDAT2_Bits.ND55 */
#define IFX_ERAY_NDAT2_ND55_LEN (1)

/** \\brief  Mask for Ifx_ERAY_NDAT2_Bits.ND55 */
#define IFX_ERAY_NDAT2_ND55_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_NDAT2_Bits.ND55 */
#define IFX_ERAY_NDAT2_ND55_OFF (23)

/** \\brief  Length for Ifx_ERAY_NDAT2_Bits.ND56 */
#define IFX_ERAY_NDAT2_ND56_LEN (1)

/** \\brief  Mask for Ifx_ERAY_NDAT2_Bits.ND56 */
#define IFX_ERAY_NDAT2_ND56_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_NDAT2_Bits.ND56 */
#define IFX_ERAY_NDAT2_ND56_OFF (24)

/** \\brief  Length for Ifx_ERAY_NDAT2_Bits.ND57 */
#define IFX_ERAY_NDAT2_ND57_LEN (1)

/** \\brief  Mask for Ifx_ERAY_NDAT2_Bits.ND57 */
#define IFX_ERAY_NDAT2_ND57_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_NDAT2_Bits.ND57 */
#define IFX_ERAY_NDAT2_ND57_OFF (25)

/** \\brief  Length for Ifx_ERAY_NDAT2_Bits.ND58 */
#define IFX_ERAY_NDAT2_ND58_LEN (1)

/** \\brief  Mask for Ifx_ERAY_NDAT2_Bits.ND58 */
#define IFX_ERAY_NDAT2_ND58_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_NDAT2_Bits.ND58 */
#define IFX_ERAY_NDAT2_ND58_OFF (26)

/** \\brief  Length for Ifx_ERAY_NDAT2_Bits.ND59 */
#define IFX_ERAY_NDAT2_ND59_LEN (1)

/** \\brief  Mask for Ifx_ERAY_NDAT2_Bits.ND59 */
#define IFX_ERAY_NDAT2_ND59_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_NDAT2_Bits.ND59 */
#define IFX_ERAY_NDAT2_ND59_OFF (27)

/** \\brief  Length for Ifx_ERAY_NDAT2_Bits.ND60 */
#define IFX_ERAY_NDAT2_ND60_LEN (1)

/** \\brief  Mask for Ifx_ERAY_NDAT2_Bits.ND60 */
#define IFX_ERAY_NDAT2_ND60_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_NDAT2_Bits.ND60 */
#define IFX_ERAY_NDAT2_ND60_OFF (28)

/** \\brief  Length for Ifx_ERAY_NDAT2_Bits.ND61 */
#define IFX_ERAY_NDAT2_ND61_LEN (1)

/** \\brief  Mask for Ifx_ERAY_NDAT2_Bits.ND61 */
#define IFX_ERAY_NDAT2_ND61_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_NDAT2_Bits.ND61 */
#define IFX_ERAY_NDAT2_ND61_OFF (29)

/** \\brief  Length for Ifx_ERAY_NDAT2_Bits.ND62 */
#define IFX_ERAY_NDAT2_ND62_LEN (1)

/** \\brief  Mask for Ifx_ERAY_NDAT2_Bits.ND62 */
#define IFX_ERAY_NDAT2_ND62_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_NDAT2_Bits.ND62 */
#define IFX_ERAY_NDAT2_ND62_OFF (30)

/** \\brief  Length for Ifx_ERAY_NDAT2_Bits.ND63 */
#define IFX_ERAY_NDAT2_ND63_LEN (1)

/** \\brief  Mask for Ifx_ERAY_NDAT2_Bits.ND63 */
#define IFX_ERAY_NDAT2_ND63_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_NDAT2_Bits.ND63 */
#define IFX_ERAY_NDAT2_ND63_OFF (31)

/** \\brief  Length for Ifx_ERAY_NDAT3_Bits.ND64 */
#define IFX_ERAY_NDAT3_ND64_LEN (1)

/** \\brief  Mask for Ifx_ERAY_NDAT3_Bits.ND64 */
#define IFX_ERAY_NDAT3_ND64_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_NDAT3_Bits.ND64 */
#define IFX_ERAY_NDAT3_ND64_OFF (0)

