keeper999/EngineControl_Aurix/01_Get_Src/BSW/VD56_BSW/VD56_GEN_BSW/MCAL_TC29X_DRV_P1/Drv/IfxEray_bf.h
/** \\brief  Length for Ifx_ERAY_NDAT3_Bits.ND65 */
#define IFX_ERAY_NDAT3_ND65_LEN (1)

/** \\brief  Mask for Ifx_ERAY_NDAT3_Bits.ND65 */
#define IFX_ERAY_NDAT3_ND65_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_NDAT3_Bits.ND65 */
#define IFX_ERAY_NDAT3_ND65_OFF (1)

/** \\brief  Length for Ifx_ERAY_NDAT3_Bits.ND66 */
#define IFX_ERAY_NDAT3_ND66_LEN (1)

/** \\brief  Mask for Ifx_ERAY_NDAT3_Bits.ND66 */
#define IFX_ERAY_NDAT3_ND66_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_NDAT3_Bits.ND66 */
#define IFX_ERAY_NDAT3_ND66_OFF (2)

/** \\brief  Length for Ifx_ERAY_NDAT3_Bits.ND67 */
#define IFX_ERAY_NDAT3_ND67_LEN (1)

/** \\brief  Mask for Ifx_ERAY_NDAT3_Bits.ND67 */
#define IFX_ERAY_NDAT3_ND67_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_NDAT3_Bits.ND67 */
#define IFX_ERAY_NDAT3_ND67_OFF (3)

/** \\brief  Length for Ifx_ERAY_NDAT3_Bits.ND68 */
#define IFX_ERAY_NDAT3_ND68_LEN (1)

/** \\brief  Mask for Ifx_ERAY_NDAT3_Bits.ND68 */
#define IFX_ERAY_NDAT3_ND68_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_NDAT3_Bits.ND68 */
#define IFX_ERAY_NDAT3_ND68_OFF (4)

/** \\brief  Length for Ifx_ERAY_NDAT3_Bits.ND69 */
#define IFX_ERAY_NDAT3_ND69_LEN (1)

/** \\brief  Mask for Ifx_ERAY_NDAT3_Bits.ND69 */
#define IFX_ERAY_NDAT3_ND69_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_NDAT3_Bits.ND69 */
#define IFX_ERAY_NDAT3_ND69_OFF (5)

/** \\brief  Length for Ifx_ERAY_NDAT3_Bits.ND70 */
#define IFX_ERAY_NDAT3_ND70_LEN (1)

/** \\brief  Mask for Ifx_ERAY_NDAT3_Bits.ND70 */
#define IFX_ERAY_NDAT3_ND70_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_NDAT3_Bits.ND70 */
#define IFX_ERAY_NDAT3_ND70_OFF (6)

/** \\brief  Length for Ifx_ERAY_NDAT3_Bits.ND71 */
#define IFX_ERAY_NDAT3_ND71_LEN (1)

/** \\brief  Mask for Ifx_ERAY_NDAT3_Bits.ND71 */
#define IFX_ERAY_NDAT3_ND71_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_NDAT3_Bits.ND71 */
#define IFX_ERAY_NDAT3_ND71_OFF (7)

/** \\brief  Length for Ifx_ERAY_NDAT3_Bits.ND72 */
#define IFX_ERAY_NDAT3_ND72_LEN (1)

/** \\brief  Mask for Ifx_ERAY_NDAT3_Bits.ND72 */
#define IFX_ERAY_NDAT3_ND72_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_NDAT3_Bits.ND72 */
#define IFX_ERAY_NDAT3_ND72_OFF (8)

/** \\brief  Length for Ifx_ERAY_NDAT3_Bits.ND73 */
#define IFX_ERAY_NDAT3_ND73_LEN (1)

/** \\brief  Mask for Ifx_ERAY_NDAT3_Bits.ND73 */
#define IFX_ERAY_NDAT3_ND73_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_NDAT3_Bits.ND73 */
#define IFX_ERAY_NDAT3_ND73_OFF (9)

/** \\brief  Length for Ifx_ERAY_NDAT3_Bits.ND74 */
#define IFX_ERAY_NDAT3_ND74_LEN (1)

/** \\brief  Mask for Ifx_ERAY_NDAT3_Bits.ND74 */
#define IFX_ERAY_NDAT3_ND74_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_NDAT3_Bits.ND74 */
#define IFX_ERAY_NDAT3_ND74_OFF (10)

/** \\brief  Length for Ifx_ERAY_NDAT3_Bits.ND75 */
#define IFX_ERAY_NDAT3_ND75_LEN (1)

/** \\brief  Mask for Ifx_ERAY_NDAT3_Bits.ND75 */
#define IFX_ERAY_NDAT3_ND75_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_NDAT3_Bits.ND75 */
#define IFX_ERAY_NDAT3_ND75_OFF (11)

/** \\brief  Length for Ifx_ERAY_NDAT3_Bits.ND76 */
#define IFX_ERAY_NDAT3_ND76_LEN (1)

/** \\brief  Mask for Ifx_ERAY_NDAT3_Bits.ND76 */
#define IFX_ERAY_NDAT3_ND76_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_NDAT3_Bits.ND76 */
#define IFX_ERAY_NDAT3_ND76_OFF (12)

/** \\brief  Length for Ifx_ERAY_NDAT3_Bits.ND77 */
#define IFX_ERAY_NDAT3_ND77_LEN (1)

/** \\brief  Mask for Ifx_ERAY_NDAT3_Bits.ND77 */
#define IFX_ERAY_NDAT3_ND77_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_NDAT3_Bits.ND77 */
#define IFX_ERAY_NDAT3_ND77_OFF (13)

/** \\brief  Length for Ifx_ERAY_NDAT3_Bits.ND78 */
#define IFX_ERAY_NDAT3_ND78_LEN (1)

/** \\brief  Mask for Ifx_ERAY_NDAT3_Bits.ND78 */
#define IFX_ERAY_NDAT3_ND78_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_NDAT3_Bits.ND78 */
#define IFX_ERAY_NDAT3_ND78_OFF (14)

/** \\brief  Length for Ifx_ERAY_NDAT3_Bits.ND79 */
#define IFX_ERAY_NDAT3_ND79_LEN (1)

/** \\brief  Mask for Ifx_ERAY_NDAT3_Bits.ND79 */
#define IFX_ERAY_NDAT3_ND79_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_NDAT3_Bits.ND79 */
#define IFX_ERAY_NDAT3_ND79_OFF (15)

/** \\brief  Length for Ifx_ERAY_NDAT3_Bits.ND80 */
#define IFX_ERAY_NDAT3_ND80_LEN (1)

/** \\brief  Mask for Ifx_ERAY_NDAT3_Bits.ND80 */
#define IFX_ERAY_NDAT3_ND80_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_NDAT3_Bits.ND80 */
#define IFX_ERAY_NDAT3_ND80_OFF (16)

/** \\brief  Length for Ifx_ERAY_NDAT3_Bits.ND81 */
#define IFX_ERAY_NDAT3_ND81_LEN (1)

/** \\brief  Mask for Ifx_ERAY_NDAT3_Bits.ND81 */
#define IFX_ERAY_NDAT3_ND81_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_NDAT3_Bits.ND81 */
#define IFX_ERAY_NDAT3_ND81_OFF (17)

/** \\brief  Length for Ifx_ERAY_NDAT3_Bits.ND82 */
#define IFX_ERAY_NDAT3_ND82_LEN (1)

/** \\brief  Mask for Ifx_ERAY_NDAT3_Bits.ND82 */
#define IFX_ERAY_NDAT3_ND82_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_NDAT3_Bits.ND82 */
#define IFX_ERAY_NDAT3_ND82_OFF (18)

/** \\brief  Length for Ifx_ERAY_NDAT3_Bits.ND83 */
#define IFX_ERAY_NDAT3_ND83_LEN (1)

/** \\brief  Mask for Ifx_ERAY_NDAT3_Bits.ND83 */
#define IFX_ERAY_NDAT3_ND83_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_NDAT3_Bits.ND83 */
#define IFX_ERAY_NDAT3_ND83_OFF (19)

/** \\brief  Length for Ifx_ERAY_NDAT3_Bits.ND84 */
#define IFX_ERAY_NDAT3_ND84_LEN (1)

/** \\brief  Mask for Ifx_ERAY_NDAT3_Bits.ND84 */
#define IFX_ERAY_NDAT3_ND84_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_NDAT3_Bits.ND84 */
#define IFX_ERAY_NDAT3_ND84_OFF (20)

/** \\brief  Length for Ifx_ERAY_NDAT3_Bits.ND85 */
#define IFX_ERAY_NDAT3_ND85_LEN (1)

/** \\brief  Mask for Ifx_ERAY_NDAT3_Bits.ND85 */
#define IFX_ERAY_NDAT3_ND85_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_NDAT3_Bits.ND85 */
#define IFX_ERAY_NDAT3_ND85_OFF (21)

/** \\brief  Length for Ifx_ERAY_NDAT3_Bits.ND86 */
#define IFX_ERAY_NDAT3_ND86_LEN (1)

/** \\brief  Mask for Ifx_ERAY_NDAT3_Bits.ND86 */
#define IFX_ERAY_NDAT3_ND86_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_NDAT3_Bits.ND86 */
#define IFX_ERAY_NDAT3_ND86_OFF (22)

/** \\brief  Length for Ifx_ERAY_NDAT3_Bits.ND87 */
#define IFX_ERAY_NDAT3_ND87_LEN (1)

