keeper999/EngineControl_Aurix/01_Get_Src/BSW/VD56_BSW/VD56_GEN_BSW/MCAL_TC29X_DRV_P1/Drv/IfxEray_bf.h
/** \\brief  Mask for Ifx_ERAY_NDAT3_Bits.ND87 */
#define IFX_ERAY_NDAT3_ND87_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_NDAT3_Bits.ND87 */
#define IFX_ERAY_NDAT3_ND87_OFF (23)

/** \\brief  Length for Ifx_ERAY_NDAT3_Bits.ND88 */
#define IFX_ERAY_NDAT3_ND88_LEN (1)

/** \\brief  Mask for Ifx_ERAY_NDAT3_Bits.ND88 */
#define IFX_ERAY_NDAT3_ND88_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_NDAT3_Bits.ND88 */
#define IFX_ERAY_NDAT3_ND88_OFF (24)

/** \\brief  Length for Ifx_ERAY_NDAT3_Bits.ND89 */
#define IFX_ERAY_NDAT3_ND89_LEN (1)

/** \\brief  Mask for Ifx_ERAY_NDAT3_Bits.ND89 */
#define IFX_ERAY_NDAT3_ND89_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_NDAT3_Bits.ND89 */
#define IFX_ERAY_NDAT3_ND89_OFF (25)

/** \\brief  Length for Ifx_ERAY_NDAT3_Bits.ND90 */
#define IFX_ERAY_NDAT3_ND90_LEN (1)

/** \\brief  Mask for Ifx_ERAY_NDAT3_Bits.ND90 */
#define IFX_ERAY_NDAT3_ND90_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_NDAT3_Bits.ND90 */
#define IFX_ERAY_NDAT3_ND90_OFF (26)

/** \\brief  Length for Ifx_ERAY_NDAT3_Bits.ND91 */
#define IFX_ERAY_NDAT3_ND91_LEN (1)

/** \\brief  Mask for Ifx_ERAY_NDAT3_Bits.ND91 */
#define IFX_ERAY_NDAT3_ND91_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_NDAT3_Bits.ND91 */
#define IFX_ERAY_NDAT3_ND91_OFF (27)

/** \\brief  Length for Ifx_ERAY_NDAT3_Bits.ND92 */
#define IFX_ERAY_NDAT3_ND92_LEN (1)

/** \\brief  Mask for Ifx_ERAY_NDAT3_Bits.ND92 */
#define IFX_ERAY_NDAT3_ND92_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_NDAT3_Bits.ND92 */
#define IFX_ERAY_NDAT3_ND92_OFF (28)

/** \\brief  Length for Ifx_ERAY_NDAT3_Bits.ND93 */
#define IFX_ERAY_NDAT3_ND93_LEN (1)

/** \\brief  Mask for Ifx_ERAY_NDAT3_Bits.ND93 */
#define IFX_ERAY_NDAT3_ND93_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_NDAT3_Bits.ND93 */
#define IFX_ERAY_NDAT3_ND93_OFF (29)

/** \\brief  Length for Ifx_ERAY_NDAT3_Bits.ND94 */
#define IFX_ERAY_NDAT3_ND94_LEN (1)

/** \\brief  Mask for Ifx_ERAY_NDAT3_Bits.ND94 */
#define IFX_ERAY_NDAT3_ND94_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_NDAT3_Bits.ND94 */
#define IFX_ERAY_NDAT3_ND94_OFF (30)

/** \\brief  Length for Ifx_ERAY_NDAT3_Bits.ND95 */
#define IFX_ERAY_NDAT3_ND95_LEN (1)

/** \\brief  Mask for Ifx_ERAY_NDAT3_Bits.ND95 */
#define IFX_ERAY_NDAT3_ND95_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_NDAT3_Bits.ND95 */
#define IFX_ERAY_NDAT3_ND95_OFF (31)

/** \\brief  Length for Ifx_ERAY_NDAT4_Bits.ND100 */
#define IFX_ERAY_NDAT4_ND100_LEN (1)

/** \\brief  Mask for Ifx_ERAY_NDAT4_Bits.ND100 */
#define IFX_ERAY_NDAT4_ND100_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_NDAT4_Bits.ND100 */
#define IFX_ERAY_NDAT4_ND100_OFF (4)

/** \\brief  Length for Ifx_ERAY_NDAT4_Bits.ND101 */
#define IFX_ERAY_NDAT4_ND101_LEN (1)

/** \\brief  Mask for Ifx_ERAY_NDAT4_Bits.ND101 */
#define IFX_ERAY_NDAT4_ND101_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_NDAT4_Bits.ND101 */
#define IFX_ERAY_NDAT4_ND101_OFF (5)

/** \\brief  Length for Ifx_ERAY_NDAT4_Bits.ND102 */
#define IFX_ERAY_NDAT4_ND102_LEN (1)

/** \\brief  Mask for Ifx_ERAY_NDAT4_Bits.ND102 */
#define IFX_ERAY_NDAT4_ND102_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_NDAT4_Bits.ND102 */
#define IFX_ERAY_NDAT4_ND102_OFF (6)

/** \\brief  Length for Ifx_ERAY_NDAT4_Bits.ND103 */
#define IFX_ERAY_NDAT4_ND103_LEN (1)

/** \\brief  Mask for Ifx_ERAY_NDAT4_Bits.ND103 */
#define IFX_ERAY_NDAT4_ND103_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_NDAT4_Bits.ND103 */
#define IFX_ERAY_NDAT4_ND103_OFF (7)

/** \\brief  Length for Ifx_ERAY_NDAT4_Bits.ND104 */
#define IFX_ERAY_NDAT4_ND104_LEN (1)

/** \\brief  Mask for Ifx_ERAY_NDAT4_Bits.ND104 */
#define IFX_ERAY_NDAT4_ND104_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_NDAT4_Bits.ND104 */
#define IFX_ERAY_NDAT4_ND104_OFF (8)

/** \\brief  Length for Ifx_ERAY_NDAT4_Bits.ND105 */
#define IFX_ERAY_NDAT4_ND105_LEN (1)

/** \\brief  Mask for Ifx_ERAY_NDAT4_Bits.ND105 */
#define IFX_ERAY_NDAT4_ND105_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_NDAT4_Bits.ND105 */
#define IFX_ERAY_NDAT4_ND105_OFF (9)

/** \\brief  Length for Ifx_ERAY_NDAT4_Bits.ND106 */
#define IFX_ERAY_NDAT4_ND106_LEN (1)

/** \\brief  Mask for Ifx_ERAY_NDAT4_Bits.ND106 */
#define IFX_ERAY_NDAT4_ND106_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_NDAT4_Bits.ND106 */
#define IFX_ERAY_NDAT4_ND106_OFF (10)

/** \\brief  Length for Ifx_ERAY_NDAT4_Bits.ND107 */
#define IFX_ERAY_NDAT4_ND107_LEN (1)

/** \\brief  Mask for Ifx_ERAY_NDAT4_Bits.ND107 */
#define IFX_ERAY_NDAT4_ND107_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_NDAT4_Bits.ND107 */
#define IFX_ERAY_NDAT4_ND107_OFF (11)

/** \\brief  Length for Ifx_ERAY_NDAT4_Bits.ND108 */
#define IFX_ERAY_NDAT4_ND108_LEN (1)

/** \\brief  Mask for Ifx_ERAY_NDAT4_Bits.ND108 */
#define IFX_ERAY_NDAT4_ND108_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_NDAT4_Bits.ND108 */
#define IFX_ERAY_NDAT4_ND108_OFF (12)

/** \\brief  Length for Ifx_ERAY_NDAT4_Bits.ND109 */
#define IFX_ERAY_NDAT4_ND109_LEN (1)

/** \\brief  Mask for Ifx_ERAY_NDAT4_Bits.ND109 */
#define IFX_ERAY_NDAT4_ND109_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_NDAT4_Bits.ND109 */
#define IFX_ERAY_NDAT4_ND109_OFF (13)

/** \\brief  Length for Ifx_ERAY_NDAT4_Bits.ND110 */
#define IFX_ERAY_NDAT4_ND110_LEN (1)

/** \\brief  Mask for Ifx_ERAY_NDAT4_Bits.ND110 */
#define IFX_ERAY_NDAT4_ND110_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_NDAT4_Bits.ND110 */
#define IFX_ERAY_NDAT4_ND110_OFF (14)

/** \\brief  Length for Ifx_ERAY_NDAT4_Bits.ND111 */
#define IFX_ERAY_NDAT4_ND111_LEN (1)

/** \\brief  Mask for Ifx_ERAY_NDAT4_Bits.ND111 */
#define IFX_ERAY_NDAT4_ND111_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_NDAT4_Bits.ND111 */
#define IFX_ERAY_NDAT4_ND111_OFF (15)

/** \\brief  Length for Ifx_ERAY_NDAT4_Bits.ND112 */
#define IFX_ERAY_NDAT4_ND112_LEN (1)

/** \\brief  Mask for Ifx_ERAY_NDAT4_Bits.ND112 */
#define IFX_ERAY_NDAT4_ND112_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_NDAT4_Bits.ND112 */
#define IFX_ERAY_NDAT4_ND112_OFF (16)

