keeper999/EngineControl_Aurix/01_Get_Src/BSW/VD56_BSW/VD56_GEN_BSW/MCAL_TC29X_DRV_P1/Drv/IfxEray_bf.h
/** \\brief  Length for Ifx_ERAY_NDAT4_Bits.ND113 */
#define IFX_ERAY_NDAT4_ND113_LEN (1)

/** \\brief  Mask for Ifx_ERAY_NDAT4_Bits.ND113 */
#define IFX_ERAY_NDAT4_ND113_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_NDAT4_Bits.ND113 */
#define IFX_ERAY_NDAT4_ND113_OFF (17)

/** \\brief  Length for Ifx_ERAY_NDAT4_Bits.ND114 */
#define IFX_ERAY_NDAT4_ND114_LEN (1)

/** \\brief  Mask for Ifx_ERAY_NDAT4_Bits.ND114 */
#define IFX_ERAY_NDAT4_ND114_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_NDAT4_Bits.ND114 */
#define IFX_ERAY_NDAT4_ND114_OFF (18)

/** \\brief  Length for Ifx_ERAY_NDAT4_Bits.ND115 */
#define IFX_ERAY_NDAT4_ND115_LEN (1)

/** \\brief  Mask for Ifx_ERAY_NDAT4_Bits.ND115 */
#define IFX_ERAY_NDAT4_ND115_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_NDAT4_Bits.ND115 */
#define IFX_ERAY_NDAT4_ND115_OFF (19)

/** \\brief  Length for Ifx_ERAY_NDAT4_Bits.ND116 */
#define IFX_ERAY_NDAT4_ND116_LEN (1)

/** \\brief  Mask for Ifx_ERAY_NDAT4_Bits.ND116 */
#define IFX_ERAY_NDAT4_ND116_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_NDAT4_Bits.ND116 */
#define IFX_ERAY_NDAT4_ND116_OFF (20)

/** \\brief  Length for Ifx_ERAY_NDAT4_Bits.ND117 */
#define IFX_ERAY_NDAT4_ND117_LEN (1)

/** \\brief  Mask for Ifx_ERAY_NDAT4_Bits.ND117 */
#define IFX_ERAY_NDAT4_ND117_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_NDAT4_Bits.ND117 */
#define IFX_ERAY_NDAT4_ND117_OFF (21)

/** \\brief  Length for Ifx_ERAY_NDAT4_Bits.ND118 */
#define IFX_ERAY_NDAT4_ND118_LEN (1)

/** \\brief  Mask for Ifx_ERAY_NDAT4_Bits.ND118 */
#define IFX_ERAY_NDAT4_ND118_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_NDAT4_Bits.ND118 */
#define IFX_ERAY_NDAT4_ND118_OFF (22)

/** \\brief  Length for Ifx_ERAY_NDAT4_Bits.ND119 */
#define IFX_ERAY_NDAT4_ND119_LEN (1)

/** \\brief  Mask for Ifx_ERAY_NDAT4_Bits.ND119 */
#define IFX_ERAY_NDAT4_ND119_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_NDAT4_Bits.ND119 */
#define IFX_ERAY_NDAT4_ND119_OFF (23)

/** \\brief  Length for Ifx_ERAY_NDAT4_Bits.ND120 */
#define IFX_ERAY_NDAT4_ND120_LEN (1)

/** \\brief  Mask for Ifx_ERAY_NDAT4_Bits.ND120 */
#define IFX_ERAY_NDAT4_ND120_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_NDAT4_Bits.ND120 */
#define IFX_ERAY_NDAT4_ND120_OFF (24)

/** \\brief  Length for Ifx_ERAY_NDAT4_Bits.ND121 */
#define IFX_ERAY_NDAT4_ND121_LEN (1)

/** \\brief  Mask for Ifx_ERAY_NDAT4_Bits.ND121 */
#define IFX_ERAY_NDAT4_ND121_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_NDAT4_Bits.ND121 */
#define IFX_ERAY_NDAT4_ND121_OFF (25)

/** \\brief  Length for Ifx_ERAY_NDAT4_Bits.ND122 */
#define IFX_ERAY_NDAT4_ND122_LEN (1)

/** \\brief  Mask for Ifx_ERAY_NDAT4_Bits.ND122 */
#define IFX_ERAY_NDAT4_ND122_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_NDAT4_Bits.ND122 */
#define IFX_ERAY_NDAT4_ND122_OFF (26)

/** \\brief  Length for Ifx_ERAY_NDAT4_Bits.ND123 */
#define IFX_ERAY_NDAT4_ND123_LEN (1)

/** \\brief  Mask for Ifx_ERAY_NDAT4_Bits.ND123 */
#define IFX_ERAY_NDAT4_ND123_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_NDAT4_Bits.ND123 */
#define IFX_ERAY_NDAT4_ND123_OFF (27)

/** \\brief  Length for Ifx_ERAY_NDAT4_Bits.ND124 */
#define IFX_ERAY_NDAT4_ND124_LEN (1)

/** \\brief  Mask for Ifx_ERAY_NDAT4_Bits.ND124 */
#define IFX_ERAY_NDAT4_ND124_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_NDAT4_Bits.ND124 */
#define IFX_ERAY_NDAT4_ND124_OFF (28)

/** \\brief  Length for Ifx_ERAY_NDAT4_Bits.ND125 */
#define IFX_ERAY_NDAT4_ND125_LEN (1)

/** \\brief  Mask for Ifx_ERAY_NDAT4_Bits.ND125 */
#define IFX_ERAY_NDAT4_ND125_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_NDAT4_Bits.ND125 */
#define IFX_ERAY_NDAT4_ND125_OFF (29)

/** \\brief  Length for Ifx_ERAY_NDAT4_Bits.ND126 */
#define IFX_ERAY_NDAT4_ND126_LEN (1)

/** \\brief  Mask for Ifx_ERAY_NDAT4_Bits.ND126 */
#define IFX_ERAY_NDAT4_ND126_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_NDAT4_Bits.ND126 */
#define IFX_ERAY_NDAT4_ND126_OFF (30)

/** \\brief  Length for Ifx_ERAY_NDAT4_Bits.ND127 */
#define IFX_ERAY_NDAT4_ND127_LEN (1)

/** \\brief  Mask for Ifx_ERAY_NDAT4_Bits.ND127 */
#define IFX_ERAY_NDAT4_ND127_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_NDAT4_Bits.ND127 */
#define IFX_ERAY_NDAT4_ND127_OFF (31)

/** \\brief  Length for Ifx_ERAY_NDAT4_Bits.ND96 */
#define IFX_ERAY_NDAT4_ND96_LEN (1)

/** \\brief  Mask for Ifx_ERAY_NDAT4_Bits.ND96 */
#define IFX_ERAY_NDAT4_ND96_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_NDAT4_Bits.ND96 */
#define IFX_ERAY_NDAT4_ND96_OFF (0)

/** \\brief  Length for Ifx_ERAY_NDAT4_Bits.ND97 */
#define IFX_ERAY_NDAT4_ND97_LEN (1)

/** \\brief  Mask for Ifx_ERAY_NDAT4_Bits.ND97 */
#define IFX_ERAY_NDAT4_ND97_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_NDAT4_Bits.ND97 */
#define IFX_ERAY_NDAT4_ND97_OFF (1)

/** \\brief  Length for Ifx_ERAY_NDAT4_Bits.ND98 */
#define IFX_ERAY_NDAT4_ND98_LEN (1)

/** \\brief  Mask for Ifx_ERAY_NDAT4_Bits.ND98 */
#define IFX_ERAY_NDAT4_ND98_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_NDAT4_Bits.ND98 */
#define IFX_ERAY_NDAT4_ND98_OFF (2)

/** \\brief  Length for Ifx_ERAY_NDAT4_Bits.ND99 */
#define IFX_ERAY_NDAT4_ND99_LEN (1)

/** \\brief  Mask for Ifx_ERAY_NDAT4_Bits.ND99 */
#define IFX_ERAY_NDAT4_ND99_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_NDAT4_Bits.ND99 */
#define IFX_ERAY_NDAT4_ND99_OFF (3)

/** \\brief  Length for Ifx_ERAY_NDIC1_Bits.NDIP0 */
#define IFX_ERAY_NDIC1_NDIP0_LEN (1)

/** \\brief  Mask for Ifx_ERAY_NDIC1_Bits.NDIP0 */
#define IFX_ERAY_NDIC1_NDIP0_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_NDIC1_Bits.NDIP0 */
#define IFX_ERAY_NDIC1_NDIP0_OFF (0)

/** \\brief  Length for Ifx_ERAY_NDIC1_Bits.NDIP10 */
#define IFX_ERAY_NDIC1_NDIP10_LEN (1)

/** \\brief  Mask for Ifx_ERAY_NDIC1_Bits.NDIP10 */
#define IFX_ERAY_NDIC1_NDIP10_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_NDIC1_Bits.NDIP10 */
#define IFX_ERAY_NDIC1_NDIP10_OFF (10)

/** \\brief  Length for Ifx_ERAY_NDIC1_Bits.NDIP11 */
#define IFX_ERAY_NDIC1_NDIP11_LEN (1)

/** \\brief  Mask for Ifx_ERAY_NDIC1_Bits.NDIP11 */
#define IFX_ERAY_NDIC1_NDIP11_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_NDIC1_Bits.NDIP11 */
#define IFX_ERAY_NDIC1_NDIP11_OFF (11)

/** \\brief  Length for Ifx_ERAY_NDIC1_Bits.NDIP12 */
#define IFX_ERAY_NDIC1_NDIP12_LEN (1)

/** \\brief  Mask for Ifx_ERAY_NDIC1_Bits.NDIP12 */
#define IFX_ERAY_NDIC1_NDIP12_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_NDIC1_Bits.NDIP12 */
#define IFX_ERAY_NDIC1_NDIP12_OFF (12)

/** \\brief  Length for Ifx_ERAY_NDIC1_Bits.NDIP13 */
#define IFX_ERAY_NDIC1_NDIP13_LEN (1)

/** \\brief  Mask for Ifx_ERAY_NDIC1_Bits.NDIP13 */
#define IFX_ERAY_NDIC1_NDIP13_MSK (0x1)

