keeper999/EngineControl_Aurix/01_Get_Src/BSW/VD56_BSW/VD56_GEN_BSW/MCAL_TC29X_DRV_P1/Drv/IfxEray_bf.h
/** \\brief  Offset for Ifx_ERAY_NDIC1_Bits.NDIP13 */
#define IFX_ERAY_NDIC1_NDIP13_OFF (13)

/** \\brief  Length for Ifx_ERAY_NDIC1_Bits.NDIP14 */
#define IFX_ERAY_NDIC1_NDIP14_LEN (1)

/** \\brief  Mask for Ifx_ERAY_NDIC1_Bits.NDIP14 */
#define IFX_ERAY_NDIC1_NDIP14_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_NDIC1_Bits.NDIP14 */
#define IFX_ERAY_NDIC1_NDIP14_OFF (14)

/** \\brief  Length for Ifx_ERAY_NDIC1_Bits.NDIP15 */
#define IFX_ERAY_NDIC1_NDIP15_LEN (1)

/** \\brief  Mask for Ifx_ERAY_NDIC1_Bits.NDIP15 */
#define IFX_ERAY_NDIC1_NDIP15_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_NDIC1_Bits.NDIP15 */
#define IFX_ERAY_NDIC1_NDIP15_OFF (15)

/** \\brief  Length for Ifx_ERAY_NDIC1_Bits.NDIP16 */
#define IFX_ERAY_NDIC1_NDIP16_LEN (1)

/** \\brief  Mask for Ifx_ERAY_NDIC1_Bits.NDIP16 */
#define IFX_ERAY_NDIC1_NDIP16_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_NDIC1_Bits.NDIP16 */
#define IFX_ERAY_NDIC1_NDIP16_OFF (16)

/** \\brief  Length for Ifx_ERAY_NDIC1_Bits.NDIP17 */
#define IFX_ERAY_NDIC1_NDIP17_LEN (1)

/** \\brief  Mask for Ifx_ERAY_NDIC1_Bits.NDIP17 */
#define IFX_ERAY_NDIC1_NDIP17_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_NDIC1_Bits.NDIP17 */
#define IFX_ERAY_NDIC1_NDIP17_OFF (17)

/** \\brief  Length for Ifx_ERAY_NDIC1_Bits.NDIP18 */
#define IFX_ERAY_NDIC1_NDIP18_LEN (1)

/** \\brief  Mask for Ifx_ERAY_NDIC1_Bits.NDIP18 */
#define IFX_ERAY_NDIC1_NDIP18_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_NDIC1_Bits.NDIP18 */
#define IFX_ERAY_NDIC1_NDIP18_OFF (18)

/** \\brief  Length for Ifx_ERAY_NDIC1_Bits.NDIP19 */
#define IFX_ERAY_NDIC1_NDIP19_LEN (1)

/** \\brief  Mask for Ifx_ERAY_NDIC1_Bits.NDIP19 */
#define IFX_ERAY_NDIC1_NDIP19_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_NDIC1_Bits.NDIP19 */
#define IFX_ERAY_NDIC1_NDIP19_OFF (19)

/** \\brief  Length for Ifx_ERAY_NDIC1_Bits.NDIP1 */
#define IFX_ERAY_NDIC1_NDIP1_LEN (1)

/** \\brief  Mask for Ifx_ERAY_NDIC1_Bits.NDIP1 */
#define IFX_ERAY_NDIC1_NDIP1_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_NDIC1_Bits.NDIP1 */
#define IFX_ERAY_NDIC1_NDIP1_OFF (1)

/** \\brief  Length for Ifx_ERAY_NDIC1_Bits.NDIP20 */
#define IFX_ERAY_NDIC1_NDIP20_LEN (1)

/** \\brief  Mask for Ifx_ERAY_NDIC1_Bits.NDIP20 */
#define IFX_ERAY_NDIC1_NDIP20_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_NDIC1_Bits.NDIP20 */
#define IFX_ERAY_NDIC1_NDIP20_OFF (20)

/** \\brief  Length for Ifx_ERAY_NDIC1_Bits.NDIP21 */
#define IFX_ERAY_NDIC1_NDIP21_LEN (1)

/** \\brief  Mask for Ifx_ERAY_NDIC1_Bits.NDIP21 */
#define IFX_ERAY_NDIC1_NDIP21_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_NDIC1_Bits.NDIP21 */
#define IFX_ERAY_NDIC1_NDIP21_OFF (21)

/** \\brief  Length for Ifx_ERAY_NDIC1_Bits.NDIP22 */
#define IFX_ERAY_NDIC1_NDIP22_LEN (1)

/** \\brief  Mask for Ifx_ERAY_NDIC1_Bits.NDIP22 */
#define IFX_ERAY_NDIC1_NDIP22_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_NDIC1_Bits.NDIP22 */
#define IFX_ERAY_NDIC1_NDIP22_OFF (22)

/** \\brief  Length for Ifx_ERAY_NDIC1_Bits.NDIP23 */
#define IFX_ERAY_NDIC1_NDIP23_LEN (1)

/** \\brief  Mask for Ifx_ERAY_NDIC1_Bits.NDIP23 */
#define IFX_ERAY_NDIC1_NDIP23_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_NDIC1_Bits.NDIP23 */
#define IFX_ERAY_NDIC1_NDIP23_OFF (23)

/** \\brief  Length for Ifx_ERAY_NDIC1_Bits.NDIP24 */
#define IFX_ERAY_NDIC1_NDIP24_LEN (1)

/** \\brief  Mask for Ifx_ERAY_NDIC1_Bits.NDIP24 */
#define IFX_ERAY_NDIC1_NDIP24_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_NDIC1_Bits.NDIP24 */
#define IFX_ERAY_NDIC1_NDIP24_OFF (24)

/** \\brief  Length for Ifx_ERAY_NDIC1_Bits.NDIP25 */
#define IFX_ERAY_NDIC1_NDIP25_LEN (1)

/** \\brief  Mask for Ifx_ERAY_NDIC1_Bits.NDIP25 */
#define IFX_ERAY_NDIC1_NDIP25_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_NDIC1_Bits.NDIP25 */
#define IFX_ERAY_NDIC1_NDIP25_OFF (25)

/** \\brief  Length for Ifx_ERAY_NDIC1_Bits.NDIP26 */
#define IFX_ERAY_NDIC1_NDIP26_LEN (1)

/** \\brief  Mask for Ifx_ERAY_NDIC1_Bits.NDIP26 */
#define IFX_ERAY_NDIC1_NDIP26_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_NDIC1_Bits.NDIP26 */
#define IFX_ERAY_NDIC1_NDIP26_OFF (26)

/** \\brief  Length for Ifx_ERAY_NDIC1_Bits.NDIP27 */
#define IFX_ERAY_NDIC1_NDIP27_LEN (1)

/** \\brief  Mask for Ifx_ERAY_NDIC1_Bits.NDIP27 */
#define IFX_ERAY_NDIC1_NDIP27_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_NDIC1_Bits.NDIP27 */
#define IFX_ERAY_NDIC1_NDIP27_OFF (27)

/** \\brief  Length for Ifx_ERAY_NDIC1_Bits.NDIP28 */
#define IFX_ERAY_NDIC1_NDIP28_LEN (1)

/** \\brief  Mask for Ifx_ERAY_NDIC1_Bits.NDIP28 */
#define IFX_ERAY_NDIC1_NDIP28_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_NDIC1_Bits.NDIP28 */
#define IFX_ERAY_NDIC1_NDIP28_OFF (28)

/** \\brief  Length for Ifx_ERAY_NDIC1_Bits.NDIP29 */
#define IFX_ERAY_NDIC1_NDIP29_LEN (1)

/** \\brief  Mask for Ifx_ERAY_NDIC1_Bits.NDIP29 */
#define IFX_ERAY_NDIC1_NDIP29_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_NDIC1_Bits.NDIP29 */
#define IFX_ERAY_NDIC1_NDIP29_OFF (29)

/** \\brief  Length for Ifx_ERAY_NDIC1_Bits.NDIP2 */
#define IFX_ERAY_NDIC1_NDIP2_LEN (1)

/** \\brief  Mask for Ifx_ERAY_NDIC1_Bits.NDIP2 */
#define IFX_ERAY_NDIC1_NDIP2_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_NDIC1_Bits.NDIP2 */
#define IFX_ERAY_NDIC1_NDIP2_OFF (2)

/** \\brief  Length for Ifx_ERAY_NDIC1_Bits.NDIP30 */
#define IFX_ERAY_NDIC1_NDIP30_LEN (1)

/** \\brief  Mask for Ifx_ERAY_NDIC1_Bits.NDIP30 */
#define IFX_ERAY_NDIC1_NDIP30_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_NDIC1_Bits.NDIP30 */
#define IFX_ERAY_NDIC1_NDIP30_OFF (30)

/** \\brief  Length for Ifx_ERAY_NDIC1_Bits.NDIP31 */
#define IFX_ERAY_NDIC1_NDIP31_LEN (1)

/** \\brief  Mask for Ifx_ERAY_NDIC1_Bits.NDIP31 */
#define IFX_ERAY_NDIC1_NDIP31_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_NDIC1_Bits.NDIP31 */
#define IFX_ERAY_NDIC1_NDIP31_OFF (31)

/** \\brief  Length for Ifx_ERAY_NDIC1_Bits.NDIP3 */
#define IFX_ERAY_NDIC1_NDIP3_LEN (1)

/** \\brief  Mask for Ifx_ERAY_NDIC1_Bits.NDIP3 */
#define IFX_ERAY_NDIC1_NDIP3_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_NDIC1_Bits.NDIP3 */
#define IFX_ERAY_NDIC1_NDIP3_OFF (3)

/** \\brief  Length for Ifx_ERAY_NDIC1_Bits.NDIP4 */
#define IFX_ERAY_NDIC1_NDIP4_LEN (1)

/** \\brief  Mask for Ifx_ERAY_NDIC1_Bits.NDIP4 */
#define IFX_ERAY_NDIC1_NDIP4_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_NDIC1_Bits.NDIP4 */
#define IFX_ERAY_NDIC1_NDIP4_OFF (4)

/** \\brief  Length for Ifx_ERAY_NDIC1_Bits.NDIP5 */
#define IFX_ERAY_NDIC1_NDIP5_LEN (1)

/** \\brief  Mask for Ifx_ERAY_NDIC1_Bits.NDIP5 */
#define IFX_ERAY_NDIC1_NDIP5_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_NDIC1_Bits.NDIP5 */
#define IFX_ERAY_NDIC1_NDIP5_OFF (5)

/** \\brief  Length for Ifx_ERAY_NDIC1_Bits.NDIP6 */
#define IFX_ERAY_NDIC1_NDIP6_LEN (1)

/** \\brief  Mask for Ifx_ERAY_NDIC1_Bits.NDIP6 */
#define IFX_ERAY_NDIC1_NDIP6_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_NDIC1_Bits.NDIP6 */
#define IFX_ERAY_NDIC1_NDIP6_OFF (6)

