keeper999/EngineControl_Aurix/01_Get_Src/BSW/VD56_BSW/VD56_GEN_BSW/MCAL_TC29X_DRV_P1/Drv/IfxEray_bf.h
/** \\brief  Length for Ifx_ERAY_NDIC1_Bits.NDIP7 */
#define IFX_ERAY_NDIC1_NDIP7_LEN (1)

/** \\brief  Mask for Ifx_ERAY_NDIC1_Bits.NDIP7 */
#define IFX_ERAY_NDIC1_NDIP7_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_NDIC1_Bits.NDIP7 */
#define IFX_ERAY_NDIC1_NDIP7_OFF (7)

/** \\brief  Length for Ifx_ERAY_NDIC1_Bits.NDIP8 */
#define IFX_ERAY_NDIC1_NDIP8_LEN (1)

/** \\brief  Mask for Ifx_ERAY_NDIC1_Bits.NDIP8 */
#define IFX_ERAY_NDIC1_NDIP8_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_NDIC1_Bits.NDIP8 */
#define IFX_ERAY_NDIC1_NDIP8_OFF (8)

/** \\brief  Length for Ifx_ERAY_NDIC1_Bits.NDIP9 */
#define IFX_ERAY_NDIC1_NDIP9_LEN (1)

/** \\brief  Mask for Ifx_ERAY_NDIC1_Bits.NDIP9 */
#define IFX_ERAY_NDIC1_NDIP9_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_NDIC1_Bits.NDIP9 */
#define IFX_ERAY_NDIC1_NDIP9_OFF (9)

/** \\brief  Length for Ifx_ERAY_NDIC2_Bits.NDIP32 */
#define IFX_ERAY_NDIC2_NDIP32_LEN (1)

/** \\brief  Mask for Ifx_ERAY_NDIC2_Bits.NDIP32 */
#define IFX_ERAY_NDIC2_NDIP32_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_NDIC2_Bits.NDIP32 */
#define IFX_ERAY_NDIC2_NDIP32_OFF (0)

/** \\brief  Length for Ifx_ERAY_NDIC2_Bits.NDIP33 */
#define IFX_ERAY_NDIC2_NDIP33_LEN (1)

/** \\brief  Mask for Ifx_ERAY_NDIC2_Bits.NDIP33 */
#define IFX_ERAY_NDIC2_NDIP33_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_NDIC2_Bits.NDIP33 */
#define IFX_ERAY_NDIC2_NDIP33_OFF (1)

/** \\brief  Length for Ifx_ERAY_NDIC2_Bits.NDIP34 */
#define IFX_ERAY_NDIC2_NDIP34_LEN (1)

/** \\brief  Mask for Ifx_ERAY_NDIC2_Bits.NDIP34 */
#define IFX_ERAY_NDIC2_NDIP34_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_NDIC2_Bits.NDIP34 */
#define IFX_ERAY_NDIC2_NDIP34_OFF (2)

/** \\brief  Length for Ifx_ERAY_NDIC2_Bits.NDIP35 */
#define IFX_ERAY_NDIC2_NDIP35_LEN (1)

/** \\brief  Mask for Ifx_ERAY_NDIC2_Bits.NDIP35 */
#define IFX_ERAY_NDIC2_NDIP35_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_NDIC2_Bits.NDIP35 */
#define IFX_ERAY_NDIC2_NDIP35_OFF (3)

/** \\brief  Length for Ifx_ERAY_NDIC2_Bits.NDIP36 */
#define IFX_ERAY_NDIC2_NDIP36_LEN (1)

/** \\brief  Mask for Ifx_ERAY_NDIC2_Bits.NDIP36 */
#define IFX_ERAY_NDIC2_NDIP36_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_NDIC2_Bits.NDIP36 */
#define IFX_ERAY_NDIC2_NDIP36_OFF (4)

/** \\brief  Length for Ifx_ERAY_NDIC2_Bits.NDIP37 */
#define IFX_ERAY_NDIC2_NDIP37_LEN (1)

/** \\brief  Mask for Ifx_ERAY_NDIC2_Bits.NDIP37 */
#define IFX_ERAY_NDIC2_NDIP37_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_NDIC2_Bits.NDIP37 */
#define IFX_ERAY_NDIC2_NDIP37_OFF (5)

/** \\brief  Length for Ifx_ERAY_NDIC2_Bits.NDIP38 */
#define IFX_ERAY_NDIC2_NDIP38_LEN (1)

/** \\brief  Mask for Ifx_ERAY_NDIC2_Bits.NDIP38 */
#define IFX_ERAY_NDIC2_NDIP38_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_NDIC2_Bits.NDIP38 */
#define IFX_ERAY_NDIC2_NDIP38_OFF (6)

/** \\brief  Length for Ifx_ERAY_NDIC2_Bits.NDIP39 */
#define IFX_ERAY_NDIC2_NDIP39_LEN (1)

/** \\brief  Mask for Ifx_ERAY_NDIC2_Bits.NDIP39 */
#define IFX_ERAY_NDIC2_NDIP39_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_NDIC2_Bits.NDIP39 */
#define IFX_ERAY_NDIC2_NDIP39_OFF (7)

/** \\brief  Length for Ifx_ERAY_NDIC2_Bits.NDIP40 */
#define IFX_ERAY_NDIC2_NDIP40_LEN (1)

/** \\brief  Mask for Ifx_ERAY_NDIC2_Bits.NDIP40 */
#define IFX_ERAY_NDIC2_NDIP40_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_NDIC2_Bits.NDIP40 */
#define IFX_ERAY_NDIC2_NDIP40_OFF (8)

/** \\brief  Length for Ifx_ERAY_NDIC2_Bits.NDIP41 */
#define IFX_ERAY_NDIC2_NDIP41_LEN (1)

/** \\brief  Mask for Ifx_ERAY_NDIC2_Bits.NDIP41 */
#define IFX_ERAY_NDIC2_NDIP41_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_NDIC2_Bits.NDIP41 */
#define IFX_ERAY_NDIC2_NDIP41_OFF (9)

/** \\brief  Length for Ifx_ERAY_NDIC2_Bits.NDIP42 */
#define IFX_ERAY_NDIC2_NDIP42_LEN (1)

/** \\brief  Mask for Ifx_ERAY_NDIC2_Bits.NDIP42 */
#define IFX_ERAY_NDIC2_NDIP42_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_NDIC2_Bits.NDIP42 */
#define IFX_ERAY_NDIC2_NDIP42_OFF (10)

/** \\brief  Length for Ifx_ERAY_NDIC2_Bits.NDIP43 */
#define IFX_ERAY_NDIC2_NDIP43_LEN (1)

/** \\brief  Mask for Ifx_ERAY_NDIC2_Bits.NDIP43 */
#define IFX_ERAY_NDIC2_NDIP43_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_NDIC2_Bits.NDIP43 */
#define IFX_ERAY_NDIC2_NDIP43_OFF (11)

/** \\brief  Length for Ifx_ERAY_NDIC2_Bits.NDIP44 */
#define IFX_ERAY_NDIC2_NDIP44_LEN (1)

/** \\brief  Mask for Ifx_ERAY_NDIC2_Bits.NDIP44 */
#define IFX_ERAY_NDIC2_NDIP44_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_NDIC2_Bits.NDIP44 */
#define IFX_ERAY_NDIC2_NDIP44_OFF (12)

/** \\brief  Length for Ifx_ERAY_NDIC2_Bits.NDIP45 */
#define IFX_ERAY_NDIC2_NDIP45_LEN (1)

/** \\brief  Mask for Ifx_ERAY_NDIC2_Bits.NDIP45 */
#define IFX_ERAY_NDIC2_NDIP45_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_NDIC2_Bits.NDIP45 */
#define IFX_ERAY_NDIC2_NDIP45_OFF (13)

/** \\brief  Length for Ifx_ERAY_NDIC2_Bits.NDIP46 */
#define IFX_ERAY_NDIC2_NDIP46_LEN (1)

/** \\brief  Mask for Ifx_ERAY_NDIC2_Bits.NDIP46 */
#define IFX_ERAY_NDIC2_NDIP46_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_NDIC2_Bits.NDIP46 */
#define IFX_ERAY_NDIC2_NDIP46_OFF (14)

/** \\brief  Length for Ifx_ERAY_NDIC2_Bits.NDIP47 */
#define IFX_ERAY_NDIC2_NDIP47_LEN (1)

/** \\brief  Mask for Ifx_ERAY_NDIC2_Bits.NDIP47 */
#define IFX_ERAY_NDIC2_NDIP47_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_NDIC2_Bits.NDIP47 */
#define IFX_ERAY_NDIC2_NDIP47_OFF (15)

/** \\brief  Length for Ifx_ERAY_NDIC2_Bits.NDIP48 */
#define IFX_ERAY_NDIC2_NDIP48_LEN (1)

/** \\brief  Mask for Ifx_ERAY_NDIC2_Bits.NDIP48 */
#define IFX_ERAY_NDIC2_NDIP48_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_NDIC2_Bits.NDIP48 */
#define IFX_ERAY_NDIC2_NDIP48_OFF (16)

/** \\brief  Length for Ifx_ERAY_NDIC2_Bits.NDIP49 */
#define IFX_ERAY_NDIC2_NDIP49_LEN (1)

/** \\brief  Mask for Ifx_ERAY_NDIC2_Bits.NDIP49 */
#define IFX_ERAY_NDIC2_NDIP49_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_NDIC2_Bits.NDIP49 */
#define IFX_ERAY_NDIC2_NDIP49_OFF (17)

/** \\brief  Length for Ifx_ERAY_NDIC2_Bits.NDIP50 */
#define IFX_ERAY_NDIC2_NDIP50_LEN (1)

/** \\brief  Mask for Ifx_ERAY_NDIC2_Bits.NDIP50 */
#define IFX_ERAY_NDIC2_NDIP50_MSK (0x1)

