keeper999/EngineControl_Aurix/01_Get_Src/BSW/VD56_BSW/VD56_GEN_BSW/MCAL_TC29X_DRV_P1/Drv/IfxEray_bf.h
/** \\brief  Offset for Ifx_ERAY_NDIC2_Bits.NDIP50 */
#define IFX_ERAY_NDIC2_NDIP50_OFF (18)

/** \\brief  Length for Ifx_ERAY_NDIC2_Bits.NDIP51 */
#define IFX_ERAY_NDIC2_NDIP51_LEN (1)

/** \\brief  Mask for Ifx_ERAY_NDIC2_Bits.NDIP51 */
#define IFX_ERAY_NDIC2_NDIP51_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_NDIC2_Bits.NDIP51 */
#define IFX_ERAY_NDIC2_NDIP51_OFF (19)

/** \\brief  Length for Ifx_ERAY_NDIC2_Bits.NDIP52 */
#define IFX_ERAY_NDIC2_NDIP52_LEN (1)

/** \\brief  Mask for Ifx_ERAY_NDIC2_Bits.NDIP52 */
#define IFX_ERAY_NDIC2_NDIP52_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_NDIC2_Bits.NDIP52 */
#define IFX_ERAY_NDIC2_NDIP52_OFF (20)

/** \\brief  Length for Ifx_ERAY_NDIC2_Bits.NDIP53 */
#define IFX_ERAY_NDIC2_NDIP53_LEN (1)

/** \\brief  Mask for Ifx_ERAY_NDIC2_Bits.NDIP53 */
#define IFX_ERAY_NDIC2_NDIP53_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_NDIC2_Bits.NDIP53 */
#define IFX_ERAY_NDIC2_NDIP53_OFF (21)

/** \\brief  Length for Ifx_ERAY_NDIC2_Bits.NDIP54 */
#define IFX_ERAY_NDIC2_NDIP54_LEN (1)

/** \\brief  Mask for Ifx_ERAY_NDIC2_Bits.NDIP54 */
#define IFX_ERAY_NDIC2_NDIP54_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_NDIC2_Bits.NDIP54 */
#define IFX_ERAY_NDIC2_NDIP54_OFF (22)

/** \\brief  Length for Ifx_ERAY_NDIC2_Bits.NDIP55 */
#define IFX_ERAY_NDIC2_NDIP55_LEN (1)

/** \\brief  Mask for Ifx_ERAY_NDIC2_Bits.NDIP55 */
#define IFX_ERAY_NDIC2_NDIP55_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_NDIC2_Bits.NDIP55 */
#define IFX_ERAY_NDIC2_NDIP55_OFF (23)

/** \\brief  Length for Ifx_ERAY_NDIC2_Bits.NDIP56 */
#define IFX_ERAY_NDIC2_NDIP56_LEN (1)

/** \\brief  Mask for Ifx_ERAY_NDIC2_Bits.NDIP56 */
#define IFX_ERAY_NDIC2_NDIP56_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_NDIC2_Bits.NDIP56 */
#define IFX_ERAY_NDIC2_NDIP56_OFF (24)

/** \\brief  Length for Ifx_ERAY_NDIC2_Bits.NDIP57 */
#define IFX_ERAY_NDIC2_NDIP57_LEN (1)

/** \\brief  Mask for Ifx_ERAY_NDIC2_Bits.NDIP57 */
#define IFX_ERAY_NDIC2_NDIP57_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_NDIC2_Bits.NDIP57 */
#define IFX_ERAY_NDIC2_NDIP57_OFF (25)

/** \\brief  Length for Ifx_ERAY_NDIC2_Bits.NDIP58 */
#define IFX_ERAY_NDIC2_NDIP58_LEN (1)

/** \\brief  Mask for Ifx_ERAY_NDIC2_Bits.NDIP58 */
#define IFX_ERAY_NDIC2_NDIP58_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_NDIC2_Bits.NDIP58 */
#define IFX_ERAY_NDIC2_NDIP58_OFF (26)

/** \\brief  Length for Ifx_ERAY_NDIC2_Bits.NDIP59 */
#define IFX_ERAY_NDIC2_NDIP59_LEN (1)

/** \\brief  Mask for Ifx_ERAY_NDIC2_Bits.NDIP59 */
#define IFX_ERAY_NDIC2_NDIP59_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_NDIC2_Bits.NDIP59 */
#define IFX_ERAY_NDIC2_NDIP59_OFF (27)

/** \\brief  Length for Ifx_ERAY_NDIC2_Bits.NDIP60 */
#define IFX_ERAY_NDIC2_NDIP60_LEN (1)

/** \\brief  Mask for Ifx_ERAY_NDIC2_Bits.NDIP60 */
#define IFX_ERAY_NDIC2_NDIP60_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_NDIC2_Bits.NDIP60 */
#define IFX_ERAY_NDIC2_NDIP60_OFF (28)

/** \\brief  Length for Ifx_ERAY_NDIC2_Bits.NDIP61 */
#define IFX_ERAY_NDIC2_NDIP61_LEN (1)

/** \\brief  Mask for Ifx_ERAY_NDIC2_Bits.NDIP61 */
#define IFX_ERAY_NDIC2_NDIP61_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_NDIC2_Bits.NDIP61 */
#define IFX_ERAY_NDIC2_NDIP61_OFF (29)

/** \\brief  Length for Ifx_ERAY_NDIC2_Bits.NDIP62 */
#define IFX_ERAY_NDIC2_NDIP62_LEN (1)

/** \\brief  Mask for Ifx_ERAY_NDIC2_Bits.NDIP62 */
#define IFX_ERAY_NDIC2_NDIP62_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_NDIC2_Bits.NDIP62 */
#define IFX_ERAY_NDIC2_NDIP62_OFF (30)

/** \\brief  Length for Ifx_ERAY_NDIC2_Bits.NDIP63 */
#define IFX_ERAY_NDIC2_NDIP63_LEN (1)

/** \\brief  Mask for Ifx_ERAY_NDIC2_Bits.NDIP63 */
#define IFX_ERAY_NDIC2_NDIP63_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_NDIC2_Bits.NDIP63 */
#define IFX_ERAY_NDIC2_NDIP63_OFF (31)

/** \\brief  Length for Ifx_ERAY_NDIC3_Bits.NDIP64 */
#define IFX_ERAY_NDIC3_NDIP64_LEN (1)

/** \\brief  Mask for Ifx_ERAY_NDIC3_Bits.NDIP64 */
#define IFX_ERAY_NDIC3_NDIP64_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_NDIC3_Bits.NDIP64 */
#define IFX_ERAY_NDIC3_NDIP64_OFF (0)

/** \\brief  Length for Ifx_ERAY_NDIC3_Bits.NDIP65 */
#define IFX_ERAY_NDIC3_NDIP65_LEN (1)

/** \\brief  Mask for Ifx_ERAY_NDIC3_Bits.NDIP65 */
#define IFX_ERAY_NDIC3_NDIP65_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_NDIC3_Bits.NDIP65 */
#define IFX_ERAY_NDIC3_NDIP65_OFF (1)

/** \\brief  Length for Ifx_ERAY_NDIC3_Bits.NDIP66 */
#define IFX_ERAY_NDIC3_NDIP66_LEN (1)

/** \\brief  Mask for Ifx_ERAY_NDIC3_Bits.NDIP66 */
#define IFX_ERAY_NDIC3_NDIP66_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_NDIC3_Bits.NDIP66 */
#define IFX_ERAY_NDIC3_NDIP66_OFF (2)

/** \\brief  Length for Ifx_ERAY_NDIC3_Bits.NDIP67 */
#define IFX_ERAY_NDIC3_NDIP67_LEN (1)

/** \\brief  Mask for Ifx_ERAY_NDIC3_Bits.NDIP67 */
#define IFX_ERAY_NDIC3_NDIP67_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_NDIC3_Bits.NDIP67 */
#define IFX_ERAY_NDIC3_NDIP67_OFF (3)

/** \\brief  Length for Ifx_ERAY_NDIC3_Bits.NDIP68 */
#define IFX_ERAY_NDIC3_NDIP68_LEN (1)

/** \\brief  Mask for Ifx_ERAY_NDIC3_Bits.NDIP68 */
#define IFX_ERAY_NDIC3_NDIP68_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_NDIC3_Bits.NDIP68 */
#define IFX_ERAY_NDIC3_NDIP68_OFF (4)

/** \\brief  Length for Ifx_ERAY_NDIC3_Bits.NDIP69 */
#define IFX_ERAY_NDIC3_NDIP69_LEN (1)

/** \\brief  Mask for Ifx_ERAY_NDIC3_Bits.NDIP69 */
#define IFX_ERAY_NDIC3_NDIP69_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_NDIC3_Bits.NDIP69 */
#define IFX_ERAY_NDIC3_NDIP69_OFF (5)

/** \\brief  Length for Ifx_ERAY_NDIC3_Bits.NDIP70 */
#define IFX_ERAY_NDIC3_NDIP70_LEN (1)

/** \\brief  Mask for Ifx_ERAY_NDIC3_Bits.NDIP70 */
#define IFX_ERAY_NDIC3_NDIP70_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_NDIC3_Bits.NDIP70 */
#define IFX_ERAY_NDIC3_NDIP70_OFF (6)

/** \\brief  Length for Ifx_ERAY_NDIC3_Bits.NDIP71 */
#define IFX_ERAY_NDIC3_NDIP71_LEN (1)

/** \\brief  Mask for Ifx_ERAY_NDIC3_Bits.NDIP71 */
#define IFX_ERAY_NDIC3_NDIP71_MSK (0x1)

