keeper999/EngineControl_Aurix/01_Get_Src/BSW/VD56_BSW/VD56_GEN_BSW/MCAL_TC29X_DRV_P1/Drv/IfxEray_bf.h
/** \\brief  Offset for Ifx_ERAY_NDIC3_Bits.NDIP71 */
#define IFX_ERAY_NDIC3_NDIP71_OFF (7)

/** \\brief  Length for Ifx_ERAY_NDIC3_Bits.NDIP72 */
#define IFX_ERAY_NDIC3_NDIP72_LEN (1)

/** \\brief  Mask for Ifx_ERAY_NDIC3_Bits.NDIP72 */
#define IFX_ERAY_NDIC3_NDIP72_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_NDIC3_Bits.NDIP72 */
#define IFX_ERAY_NDIC3_NDIP72_OFF (8)

/** \\brief  Length for Ifx_ERAY_NDIC3_Bits.NDIP73 */
#define IFX_ERAY_NDIC3_NDIP73_LEN (1)

/** \\brief  Mask for Ifx_ERAY_NDIC3_Bits.NDIP73 */
#define IFX_ERAY_NDIC3_NDIP73_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_NDIC3_Bits.NDIP73 */
#define IFX_ERAY_NDIC3_NDIP73_OFF (9)

/** \\brief  Length for Ifx_ERAY_NDIC3_Bits.NDIP74 */
#define IFX_ERAY_NDIC3_NDIP74_LEN (1)

/** \\brief  Mask for Ifx_ERAY_NDIC3_Bits.NDIP74 */
#define IFX_ERAY_NDIC3_NDIP74_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_NDIC3_Bits.NDIP74 */
#define IFX_ERAY_NDIC3_NDIP74_OFF (10)

/** \\brief  Length for Ifx_ERAY_NDIC3_Bits.NDIP75 */
#define IFX_ERAY_NDIC3_NDIP75_LEN (1)

/** \\brief  Mask for Ifx_ERAY_NDIC3_Bits.NDIP75 */
#define IFX_ERAY_NDIC3_NDIP75_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_NDIC3_Bits.NDIP75 */
#define IFX_ERAY_NDIC3_NDIP75_OFF (11)

/** \\brief  Length for Ifx_ERAY_NDIC3_Bits.NDIP76 */
#define IFX_ERAY_NDIC3_NDIP76_LEN (1)

/** \\brief  Mask for Ifx_ERAY_NDIC3_Bits.NDIP76 */
#define IFX_ERAY_NDIC3_NDIP76_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_NDIC3_Bits.NDIP76 */
#define IFX_ERAY_NDIC3_NDIP76_OFF (12)

/** \\brief  Length for Ifx_ERAY_NDIC3_Bits.NDIP77 */
#define IFX_ERAY_NDIC3_NDIP77_LEN (1)

/** \\brief  Mask for Ifx_ERAY_NDIC3_Bits.NDIP77 */
#define IFX_ERAY_NDIC3_NDIP77_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_NDIC3_Bits.NDIP77 */
#define IFX_ERAY_NDIC3_NDIP77_OFF (13)

/** \\brief  Length for Ifx_ERAY_NDIC3_Bits.NDIP78 */
#define IFX_ERAY_NDIC3_NDIP78_LEN (1)

/** \\brief  Mask for Ifx_ERAY_NDIC3_Bits.NDIP78 */
#define IFX_ERAY_NDIC3_NDIP78_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_NDIC3_Bits.NDIP78 */
#define IFX_ERAY_NDIC3_NDIP78_OFF (14)

/** \\brief  Length for Ifx_ERAY_NDIC3_Bits.NDIP79 */
#define IFX_ERAY_NDIC3_NDIP79_LEN (1)

/** \\brief  Mask for Ifx_ERAY_NDIC3_Bits.NDIP79 */
#define IFX_ERAY_NDIC3_NDIP79_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_NDIC3_Bits.NDIP79 */
#define IFX_ERAY_NDIC3_NDIP79_OFF (15)

/** \\brief  Length for Ifx_ERAY_NDIC3_Bits.NDIP80 */
#define IFX_ERAY_NDIC3_NDIP80_LEN (1)

/** \\brief  Mask for Ifx_ERAY_NDIC3_Bits.NDIP80 */
#define IFX_ERAY_NDIC3_NDIP80_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_NDIC3_Bits.NDIP80 */
#define IFX_ERAY_NDIC3_NDIP80_OFF (16)

/** \\brief  Length for Ifx_ERAY_NDIC3_Bits.NDIP81 */
#define IFX_ERAY_NDIC3_NDIP81_LEN (1)

/** \\brief  Mask for Ifx_ERAY_NDIC3_Bits.NDIP81 */
#define IFX_ERAY_NDIC3_NDIP81_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_NDIC3_Bits.NDIP81 */
#define IFX_ERAY_NDIC3_NDIP81_OFF (17)

/** \\brief  Length for Ifx_ERAY_NDIC3_Bits.NDIP82 */
#define IFX_ERAY_NDIC3_NDIP82_LEN (1)

/** \\brief  Mask for Ifx_ERAY_NDIC3_Bits.NDIP82 */
#define IFX_ERAY_NDIC3_NDIP82_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_NDIC3_Bits.NDIP82 */
#define IFX_ERAY_NDIC3_NDIP82_OFF (18)

/** \\brief  Length for Ifx_ERAY_NDIC3_Bits.NDIP83 */
#define IFX_ERAY_NDIC3_NDIP83_LEN (1)

/** \\brief  Mask for Ifx_ERAY_NDIC3_Bits.NDIP83 */
#define IFX_ERAY_NDIC3_NDIP83_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_NDIC3_Bits.NDIP83 */
#define IFX_ERAY_NDIC3_NDIP83_OFF (19)

/** \\brief  Length for Ifx_ERAY_NDIC3_Bits.NDIP84 */
#define IFX_ERAY_NDIC3_NDIP84_LEN (1)

/** \\brief  Mask for Ifx_ERAY_NDIC3_Bits.NDIP84 */
#define IFX_ERAY_NDIC3_NDIP84_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_NDIC3_Bits.NDIP84 */
#define IFX_ERAY_NDIC3_NDIP84_OFF (20)

/** \\brief  Length for Ifx_ERAY_NDIC3_Bits.NDIP85 */
#define IFX_ERAY_NDIC3_NDIP85_LEN (1)

/** \\brief  Mask for Ifx_ERAY_NDIC3_Bits.NDIP85 */
#define IFX_ERAY_NDIC3_NDIP85_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_NDIC3_Bits.NDIP85 */
#define IFX_ERAY_NDIC3_NDIP85_OFF (21)

/** \\brief  Length for Ifx_ERAY_NDIC3_Bits.NDIP86 */
#define IFX_ERAY_NDIC3_NDIP86_LEN (1)

/** \\brief  Mask for Ifx_ERAY_NDIC3_Bits.NDIP86 */
#define IFX_ERAY_NDIC3_NDIP86_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_NDIC3_Bits.NDIP86 */
#define IFX_ERAY_NDIC3_NDIP86_OFF (22)

/** \\brief  Length for Ifx_ERAY_NDIC3_Bits.NDIP87 */
#define IFX_ERAY_NDIC3_NDIP87_LEN (1)

/** \\brief  Mask for Ifx_ERAY_NDIC3_Bits.NDIP87 */
#define IFX_ERAY_NDIC3_NDIP87_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_NDIC3_Bits.NDIP87 */
#define IFX_ERAY_NDIC3_NDIP87_OFF (23)

/** \\brief  Length for Ifx_ERAY_NDIC3_Bits.NDIP88 */
#define IFX_ERAY_NDIC3_NDIP88_LEN (1)

/** \\brief  Mask for Ifx_ERAY_NDIC3_Bits.NDIP88 */
#define IFX_ERAY_NDIC3_NDIP88_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_NDIC3_Bits.NDIP88 */
#define IFX_ERAY_NDIC3_NDIP88_OFF (24)

/** \\brief  Length for Ifx_ERAY_NDIC3_Bits.NDIP89 */
#define IFX_ERAY_NDIC3_NDIP89_LEN (1)

/** \\brief  Mask for Ifx_ERAY_NDIC3_Bits.NDIP89 */
#define IFX_ERAY_NDIC3_NDIP89_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_NDIC3_Bits.NDIP89 */
#define IFX_ERAY_NDIC3_NDIP89_OFF (25)

/** \\brief  Length for Ifx_ERAY_NDIC3_Bits.NDIP90 */
#define IFX_ERAY_NDIC3_NDIP90_LEN (1)

/** \\brief  Mask for Ifx_ERAY_NDIC3_Bits.NDIP90 */
#define IFX_ERAY_NDIC3_NDIP90_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_NDIC3_Bits.NDIP90 */
#define IFX_ERAY_NDIC3_NDIP90_OFF (26)

/** \\brief  Length for Ifx_ERAY_NDIC3_Bits.NDIP91 */
#define IFX_ERAY_NDIC3_NDIP91_LEN (1)

/** \\brief  Mask for Ifx_ERAY_NDIC3_Bits.NDIP91 */
#define IFX_ERAY_NDIC3_NDIP91_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_NDIC3_Bits.NDIP91 */
#define IFX_ERAY_NDIC3_NDIP91_OFF (27)

/** \\brief  Length for Ifx_ERAY_NDIC3_Bits.NDIP92 */
#define IFX_ERAY_NDIC3_NDIP92_LEN (1)

/** \\brief  Mask for Ifx_ERAY_NDIC3_Bits.NDIP92 */
#define IFX_ERAY_NDIC3_NDIP92_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_NDIC3_Bits.NDIP92 */
#define IFX_ERAY_NDIC3_NDIP92_OFF (28)

