keeper999/EngineControl_Aurix/01_Get_Src/BSW/VD56_BSW/VD56_GEN_BSW/MCAL_TC29X_DRV_P1/Drv/IfxEray_bf.h
/** \\brief  Length for Ifx_ERAY_NDIC3_Bits.NDIP93 */
#define IFX_ERAY_NDIC3_NDIP93_LEN (1)

/** \\brief  Mask for Ifx_ERAY_NDIC3_Bits.NDIP93 */
#define IFX_ERAY_NDIC3_NDIP93_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_NDIC3_Bits.NDIP93 */
#define IFX_ERAY_NDIC3_NDIP93_OFF (29)

/** \\brief  Length for Ifx_ERAY_NDIC3_Bits.NDIP94 */
#define IFX_ERAY_NDIC3_NDIP94_LEN (1)

/** \\brief  Mask for Ifx_ERAY_NDIC3_Bits.NDIP94 */
#define IFX_ERAY_NDIC3_NDIP94_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_NDIC3_Bits.NDIP94 */
#define IFX_ERAY_NDIC3_NDIP94_OFF (30)

/** \\brief  Length for Ifx_ERAY_NDIC3_Bits.NDIP95 */
#define IFX_ERAY_NDIC3_NDIP95_LEN (1)

/** \\brief  Mask for Ifx_ERAY_NDIC3_Bits.NDIP95 */
#define IFX_ERAY_NDIC3_NDIP95_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_NDIC3_Bits.NDIP95 */
#define IFX_ERAY_NDIC3_NDIP95_OFF (31)

/** \\brief  Length for Ifx_ERAY_NDIC4_Bits.NDIP100 */
#define IFX_ERAY_NDIC4_NDIP100_LEN (1)

/** \\brief  Mask for Ifx_ERAY_NDIC4_Bits.NDIP100 */
#define IFX_ERAY_NDIC4_NDIP100_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_NDIC4_Bits.NDIP100 */
#define IFX_ERAY_NDIC4_NDIP100_OFF (4)

/** \\brief  Length for Ifx_ERAY_NDIC4_Bits.NDIP101 */
#define IFX_ERAY_NDIC4_NDIP101_LEN (1)

/** \\brief  Mask for Ifx_ERAY_NDIC4_Bits.NDIP101 */
#define IFX_ERAY_NDIC4_NDIP101_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_NDIC4_Bits.NDIP101 */
#define IFX_ERAY_NDIC4_NDIP101_OFF (5)

/** \\brief  Length for Ifx_ERAY_NDIC4_Bits.NDIP102 */
#define IFX_ERAY_NDIC4_NDIP102_LEN (1)

/** \\brief  Mask for Ifx_ERAY_NDIC4_Bits.NDIP102 */
#define IFX_ERAY_NDIC4_NDIP102_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_NDIC4_Bits.NDIP102 */
#define IFX_ERAY_NDIC4_NDIP102_OFF (6)

/** \\brief  Length for Ifx_ERAY_NDIC4_Bits.NDIP103 */
#define IFX_ERAY_NDIC4_NDIP103_LEN (1)

/** \\brief  Mask for Ifx_ERAY_NDIC4_Bits.NDIP103 */
#define IFX_ERAY_NDIC4_NDIP103_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_NDIC4_Bits.NDIP103 */
#define IFX_ERAY_NDIC4_NDIP103_OFF (7)

/** \\brief  Length for Ifx_ERAY_NDIC4_Bits.NDIP104 */
#define IFX_ERAY_NDIC4_NDIP104_LEN (1)

/** \\brief  Mask for Ifx_ERAY_NDIC4_Bits.NDIP104 */
#define IFX_ERAY_NDIC4_NDIP104_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_NDIC4_Bits.NDIP104 */
#define IFX_ERAY_NDIC4_NDIP104_OFF (8)

/** \\brief  Length for Ifx_ERAY_NDIC4_Bits.NDIP105 */
#define IFX_ERAY_NDIC4_NDIP105_LEN (1)

/** \\brief  Mask for Ifx_ERAY_NDIC4_Bits.NDIP105 */
#define IFX_ERAY_NDIC4_NDIP105_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_NDIC4_Bits.NDIP105 */
#define IFX_ERAY_NDIC4_NDIP105_OFF (9)

/** \\brief  Length for Ifx_ERAY_NDIC4_Bits.NDIP106 */
#define IFX_ERAY_NDIC4_NDIP106_LEN (1)

/** \\brief  Mask for Ifx_ERAY_NDIC4_Bits.NDIP106 */
#define IFX_ERAY_NDIC4_NDIP106_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_NDIC4_Bits.NDIP106 */
#define IFX_ERAY_NDIC4_NDIP106_OFF (10)

/** \\brief  Length for Ifx_ERAY_NDIC4_Bits.NDIP107 */
#define IFX_ERAY_NDIC4_NDIP107_LEN (1)

/** \\brief  Mask for Ifx_ERAY_NDIC4_Bits.NDIP107 */
#define IFX_ERAY_NDIC4_NDIP107_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_NDIC4_Bits.NDIP107 */
#define IFX_ERAY_NDIC4_NDIP107_OFF (11)

/** \\brief  Length for Ifx_ERAY_NDIC4_Bits.NDIP108 */
#define IFX_ERAY_NDIC4_NDIP108_LEN (1)

/** \\brief  Mask for Ifx_ERAY_NDIC4_Bits.NDIP108 */
#define IFX_ERAY_NDIC4_NDIP108_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_NDIC4_Bits.NDIP108 */
#define IFX_ERAY_NDIC4_NDIP108_OFF (12)

/** \\brief  Length for Ifx_ERAY_NDIC4_Bits.NDIP109 */
#define IFX_ERAY_NDIC4_NDIP109_LEN (1)

/** \\brief  Mask for Ifx_ERAY_NDIC4_Bits.NDIP109 */
#define IFX_ERAY_NDIC4_NDIP109_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_NDIC4_Bits.NDIP109 */
#define IFX_ERAY_NDIC4_NDIP109_OFF (13)

/** \\brief  Length for Ifx_ERAY_NDIC4_Bits.NDIP110 */
#define IFX_ERAY_NDIC4_NDIP110_LEN (1)

/** \\brief  Mask for Ifx_ERAY_NDIC4_Bits.NDIP110 */
#define IFX_ERAY_NDIC4_NDIP110_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_NDIC4_Bits.NDIP110 */
#define IFX_ERAY_NDIC4_NDIP110_OFF (14)

/** \\brief  Length for Ifx_ERAY_NDIC4_Bits.NDIP111 */
#define IFX_ERAY_NDIC4_NDIP111_LEN (1)

/** \\brief  Mask for Ifx_ERAY_NDIC4_Bits.NDIP111 */
#define IFX_ERAY_NDIC4_NDIP111_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_NDIC4_Bits.NDIP111 */
#define IFX_ERAY_NDIC4_NDIP111_OFF (15)

/** \\brief  Length for Ifx_ERAY_NDIC4_Bits.NDIP112 */
#define IFX_ERAY_NDIC4_NDIP112_LEN (1)

/** \\brief  Mask for Ifx_ERAY_NDIC4_Bits.NDIP112 */
#define IFX_ERAY_NDIC4_NDIP112_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_NDIC4_Bits.NDIP112 */
#define IFX_ERAY_NDIC4_NDIP112_OFF (16)

/** \\brief  Length for Ifx_ERAY_NDIC4_Bits.NDIP113 */
#define IFX_ERAY_NDIC4_NDIP113_LEN (1)

/** \\brief  Mask for Ifx_ERAY_NDIC4_Bits.NDIP113 */
#define IFX_ERAY_NDIC4_NDIP113_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_NDIC4_Bits.NDIP113 */
#define IFX_ERAY_NDIC4_NDIP113_OFF (17)

/** \\brief  Length for Ifx_ERAY_NDIC4_Bits.NDIP114 */
#define IFX_ERAY_NDIC4_NDIP114_LEN (1)

/** \\brief  Mask for Ifx_ERAY_NDIC4_Bits.NDIP114 */
#define IFX_ERAY_NDIC4_NDIP114_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_NDIC4_Bits.NDIP114 */
#define IFX_ERAY_NDIC4_NDIP114_OFF (18)

/** \\brief  Length for Ifx_ERAY_NDIC4_Bits.NDIP115 */
#define IFX_ERAY_NDIC4_NDIP115_LEN (1)

/** \\brief  Mask for Ifx_ERAY_NDIC4_Bits.NDIP115 */
#define IFX_ERAY_NDIC4_NDIP115_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_NDIC4_Bits.NDIP115 */
#define IFX_ERAY_NDIC4_NDIP115_OFF (19)

/** \\brief  Length for Ifx_ERAY_NDIC4_Bits.NDIP116 */
#define IFX_ERAY_NDIC4_NDIP116_LEN (1)

/** \\brief  Mask for Ifx_ERAY_NDIC4_Bits.NDIP116 */
#define IFX_ERAY_NDIC4_NDIP116_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_NDIC4_Bits.NDIP116 */
#define IFX_ERAY_NDIC4_NDIP116_OFF (20)

/** \\brief  Length for Ifx_ERAY_NDIC4_Bits.NDIP117 */
#define IFX_ERAY_NDIC4_NDIP117_LEN (1)

/** \\brief  Mask for Ifx_ERAY_NDIC4_Bits.NDIP117 */
#define IFX_ERAY_NDIC4_NDIP117_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_NDIC4_Bits.NDIP117 */
#define IFX_ERAY_NDIC4_NDIP117_OFF (21)

/** \\brief  Length for Ifx_ERAY_NDIC4_Bits.NDIP118 */
#define IFX_ERAY_NDIC4_NDIP118_LEN (1)

/** \\brief  Mask for Ifx_ERAY_NDIC4_Bits.NDIP118 */
#define IFX_ERAY_NDIC4_NDIP118_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_NDIC4_Bits.NDIP118 */
#define IFX_ERAY_NDIC4_NDIP118_OFF (22)

/** \\brief  Length for Ifx_ERAY_NDIC4_Bits.NDIP119 */
#define IFX_ERAY_NDIC4_NDIP119_LEN (1)

/** \\brief  Mask for Ifx_ERAY_NDIC4_Bits.NDIP119 */
#define IFX_ERAY_NDIC4_NDIP119_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_NDIC4_Bits.NDIP119 */
#define IFX_ERAY_NDIC4_NDIP119_OFF (23)

