keeper999/EngineControl_Aurix/01_Get_Src/BSW/VD56_BSW/VD56_GEN_BSW/MCAL_TC29X_DRV_P1/Drv/IfxEray_bf.h
/** \\brief  Length for Ifx_ERAY_NDIC4_Bits.NDIP120 */
#define IFX_ERAY_NDIC4_NDIP120_LEN (1)

/** \\brief  Mask for Ifx_ERAY_NDIC4_Bits.NDIP120 */
#define IFX_ERAY_NDIC4_NDIP120_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_NDIC4_Bits.NDIP120 */
#define IFX_ERAY_NDIC4_NDIP120_OFF (24)

/** \\brief  Length for Ifx_ERAY_NDIC4_Bits.NDIP121 */
#define IFX_ERAY_NDIC4_NDIP121_LEN (1)

/** \\brief  Mask for Ifx_ERAY_NDIC4_Bits.NDIP121 */
#define IFX_ERAY_NDIC4_NDIP121_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_NDIC4_Bits.NDIP121 */
#define IFX_ERAY_NDIC4_NDIP121_OFF (25)

/** \\brief  Length for Ifx_ERAY_NDIC4_Bits.NDIP122 */
#define IFX_ERAY_NDIC4_NDIP122_LEN (1)

/** \\brief  Mask for Ifx_ERAY_NDIC4_Bits.NDIP122 */
#define IFX_ERAY_NDIC4_NDIP122_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_NDIC4_Bits.NDIP122 */
#define IFX_ERAY_NDIC4_NDIP122_OFF (26)

/** \\brief  Length for Ifx_ERAY_NDIC4_Bits.NDIP123 */
#define IFX_ERAY_NDIC4_NDIP123_LEN (1)

/** \\brief  Mask for Ifx_ERAY_NDIC4_Bits.NDIP123 */
#define IFX_ERAY_NDIC4_NDIP123_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_NDIC4_Bits.NDIP123 */
#define IFX_ERAY_NDIC4_NDIP123_OFF (27)

/** \\brief  Length for Ifx_ERAY_NDIC4_Bits.NDIP124 */
#define IFX_ERAY_NDIC4_NDIP124_LEN (1)

/** \\brief  Mask for Ifx_ERAY_NDIC4_Bits.NDIP124 */
#define IFX_ERAY_NDIC4_NDIP124_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_NDIC4_Bits.NDIP124 */
#define IFX_ERAY_NDIC4_NDIP124_OFF (28)

/** \\brief  Length for Ifx_ERAY_NDIC4_Bits.NDIP125 */
#define IFX_ERAY_NDIC4_NDIP125_LEN (1)

/** \\brief  Mask for Ifx_ERAY_NDIC4_Bits.NDIP125 */
#define IFX_ERAY_NDIC4_NDIP125_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_NDIC4_Bits.NDIP125 */
#define IFX_ERAY_NDIC4_NDIP125_OFF (29)

/** \\brief  Length for Ifx_ERAY_NDIC4_Bits.NDIP126 */
#define IFX_ERAY_NDIC4_NDIP126_LEN (1)

/** \\brief  Mask for Ifx_ERAY_NDIC4_Bits.NDIP126 */
#define IFX_ERAY_NDIC4_NDIP126_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_NDIC4_Bits.NDIP126 */
#define IFX_ERAY_NDIC4_NDIP126_OFF (30)

/** \\brief  Length for Ifx_ERAY_NDIC4_Bits.NDIP127 */
#define IFX_ERAY_NDIC4_NDIP127_LEN (1)

/** \\brief  Mask for Ifx_ERAY_NDIC4_Bits.NDIP127 */
#define IFX_ERAY_NDIC4_NDIP127_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_NDIC4_Bits.NDIP127 */
#define IFX_ERAY_NDIC4_NDIP127_OFF (31)

/** \\brief  Length for Ifx_ERAY_NDIC4_Bits.NDIP96 */
#define IFX_ERAY_NDIC4_NDIP96_LEN (1)

/** \\brief  Mask for Ifx_ERAY_NDIC4_Bits.NDIP96 */
#define IFX_ERAY_NDIC4_NDIP96_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_NDIC4_Bits.NDIP96 */
#define IFX_ERAY_NDIC4_NDIP96_OFF (0)

/** \\brief  Length for Ifx_ERAY_NDIC4_Bits.NDIP97 */
#define IFX_ERAY_NDIC4_NDIP97_LEN (1)

/** \\brief  Mask for Ifx_ERAY_NDIC4_Bits.NDIP97 */
#define IFX_ERAY_NDIC4_NDIP97_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_NDIC4_Bits.NDIP97 */
#define IFX_ERAY_NDIC4_NDIP97_OFF (1)

/** \\brief  Length for Ifx_ERAY_NDIC4_Bits.NDIP98 */
#define IFX_ERAY_NDIC4_NDIP98_LEN (1)

/** \\brief  Mask for Ifx_ERAY_NDIC4_Bits.NDIP98 */
#define IFX_ERAY_NDIC4_NDIP98_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_NDIC4_Bits.NDIP98 */
#define IFX_ERAY_NDIC4_NDIP98_OFF (2)

/** \\brief  Length for Ifx_ERAY_NDIC4_Bits.NDIP99 */
#define IFX_ERAY_NDIC4_NDIP99_LEN (1)

/** \\brief  Mask for Ifx_ERAY_NDIC4_Bits.NDIP99 */
#define IFX_ERAY_NDIC4_NDIP99_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_NDIC4_Bits.NDIP99 */
#define IFX_ERAY_NDIC4_NDIP99_OFF (3)

/** \\brief  Length for Ifx_ERAY_NEMC_Bits.NML */
#define IFX_ERAY_NEMC_NML_LEN (4)

/** \\brief  Mask for Ifx_ERAY_NEMC_Bits.NML */
#define IFX_ERAY_NEMC_NML_MSK (0xf)

/** \\brief  Offset for Ifx_ERAY_NEMC_Bits.NML */
#define IFX_ERAY_NEMC_NML_OFF (0)

/** \\brief  Length for Ifx_ERAY_NMV_Bits.NM */
#define IFX_ERAY_NMV_NM_LEN (32)

/** \\brief  Mask for Ifx_ERAY_NMV_Bits.NM */
#define IFX_ERAY_NMV_NM_MSK (0xffffffff)

/** \\brief  Offset for Ifx_ERAY_NMV_Bits.NM */
#define IFX_ERAY_NMV_NM_OFF (0)

/** \\brief  Length for Ifx_ERAY_OBCM_Bits.RDSH */
#define IFX_ERAY_OBCM_RDSH_LEN (1)

/** \\brief  Mask for Ifx_ERAY_OBCM_Bits.RDSH */
#define IFX_ERAY_OBCM_RDSH_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_OBCM_Bits.RDSH */
#define IFX_ERAY_OBCM_RDSH_OFF (17)

/** \\brief  Length for Ifx_ERAY_OBCM_Bits.RDSS */
#define IFX_ERAY_OBCM_RDSS_LEN (1)

/** \\brief  Mask for Ifx_ERAY_OBCM_Bits.RDSS */
#define IFX_ERAY_OBCM_RDSS_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_OBCM_Bits.RDSS */
#define IFX_ERAY_OBCM_RDSS_OFF (1)

/** \\brief  Length for Ifx_ERAY_OBCM_Bits.RHSH */
#define IFX_ERAY_OBCM_RHSH_LEN (1)

/** \\brief  Mask for Ifx_ERAY_OBCM_Bits.RHSH */
#define IFX_ERAY_OBCM_RHSH_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_OBCM_Bits.RHSH */
#define IFX_ERAY_OBCM_RHSH_OFF (16)

/** \\brief  Length for Ifx_ERAY_OBCM_Bits.RHSS */
#define IFX_ERAY_OBCM_RHSS_LEN (1)

/** \\brief  Mask for Ifx_ERAY_OBCM_Bits.RHSS */
#define IFX_ERAY_OBCM_RHSS_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_OBCM_Bits.RHSS */
#define IFX_ERAY_OBCM_RHSS_OFF (0)

/** \\brief  Length for Ifx_ERAY_OBCR_Bits.OBRH */
#define IFX_ERAY_OBCR_OBRH_LEN (7)

/** \\brief  Mask for Ifx_ERAY_OBCR_Bits.OBRH */
#define IFX_ERAY_OBCR_OBRH_MSK (0x7f)

/** \\brief  Offset for Ifx_ERAY_OBCR_Bits.OBRH */
#define IFX_ERAY_OBCR_OBRH_OFF (16)

/** \\brief  Length for Ifx_ERAY_OBCR_Bits.OBRS */
#define IFX_ERAY_OBCR_OBRS_LEN (7)

/** \\brief  Mask for Ifx_ERAY_OBCR_Bits.OBRS */
#define IFX_ERAY_OBCR_OBRS_MSK (0x7f)

/** \\brief  Offset for Ifx_ERAY_OBCR_Bits.OBRS */
#define IFX_ERAY_OBCR_OBRS_OFF (0)

/** \\brief  Length for Ifx_ERAY_OBCR_Bits.OBSYS */
#define IFX_ERAY_OBCR_OBSYS_LEN (1)

/** \\brief  Mask for Ifx_ERAY_OBCR_Bits.OBSYS */
#define IFX_ERAY_OBCR_OBSYS_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_OBCR_Bits.OBSYS */
#define IFX_ERAY_OBCR_OBSYS_OFF (15)

/** \\brief  Length for Ifx_ERAY_OBCR_Bits.REQ */
#define IFX_ERAY_OBCR_REQ_LEN (1)

/** \\brief  Mask for Ifx_ERAY_OBCR_Bits.REQ */
#define IFX_ERAY_OBCR_REQ_MSK (0x1)

