keeper999/EngineControl_Aurix/01_Get_Src/BSW/VD56_BSW/VD56_GEN_BSW/MCAL_TC29X_DRV_P1/Drv/IfxEray_bf.h
/** \\brief  Offset for Ifx_ERAY_OBCR_Bits.REQ */
#define IFX_ERAY_OBCR_REQ_OFF (9)

/** \\brief  Length for Ifx_ERAY_OBCR_Bits.VIEW */
#define IFX_ERAY_OBCR_VIEW_LEN (1)

/** \\brief  Mask for Ifx_ERAY_OBCR_Bits.VIEW */
#define IFX_ERAY_OBCR_VIEW_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_OBCR_Bits.VIEW */
#define IFX_ERAY_OBCR_VIEW_OFF (8)

/** \\brief  Length for Ifx_ERAY_OCS_Bits.SUS */
#define IFX_ERAY_OCS_SUS_LEN (4)

/** \\brief  Mask for Ifx_ERAY_OCS_Bits.SUS */
#define IFX_ERAY_OCS_SUS_MSK (0xf)

/** \\brief  Offset for Ifx_ERAY_OCS_Bits.SUS */
#define IFX_ERAY_OCS_SUS_OFF (24)

/** \\brief  Length for Ifx_ERAY_OCS_Bits.SUS_P */
#define IFX_ERAY_OCS_SUS_P_LEN (1)

/** \\brief  Mask for Ifx_ERAY_OCS_Bits.SUS_P */
#define IFX_ERAY_OCS_SUS_P_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_OCS_Bits.SUS_P */
#define IFX_ERAY_OCS_SUS_P_OFF (28)

/** \\brief  Length for Ifx_ERAY_OCS_Bits.SUSSTA */
#define IFX_ERAY_OCS_SUSSTA_LEN (1)

/** \\brief  Mask for Ifx_ERAY_OCS_Bits.SUSSTA */
#define IFX_ERAY_OCS_SUSSTA_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_OCS_Bits.SUSSTA */
#define IFX_ERAY_OCS_SUSSTA_OFF (29)

/** \\brief  Length for Ifx_ERAY_OCV_Bits.OCV */
#define IFX_ERAY_OCV_OCV_LEN (19)

/** \\brief  Mask for Ifx_ERAY_OCV_Bits.OCV */
#define IFX_ERAY_OCV_OCV_MSK (0x7ffff)

/** \\brief  Offset for Ifx_ERAY_OCV_Bits.OCV */
#define IFX_ERAY_OCV_OCV_OFF (0)

/** \\brief  Length for Ifx_ERAY_OSID_Bits.OID */
#define IFX_ERAY_OSID_OID_LEN (10)

/** \\brief  Mask for Ifx_ERAY_OSID_Bits.OID */
#define IFX_ERAY_OSID_OID_MSK (0x3ff)

/** \\brief  Offset for Ifx_ERAY_OSID_Bits.OID */
#define IFX_ERAY_OSID_OID_OFF (0)

/** \\brief  Length for Ifx_ERAY_OSID_Bits.RXOA */
#define IFX_ERAY_OSID_RXOA_LEN (1)

/** \\brief  Mask for Ifx_ERAY_OSID_Bits.RXOA */
#define IFX_ERAY_OSID_RXOA_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_OSID_Bits.RXOA */
#define IFX_ERAY_OSID_RXOA_OFF (14)

/** \\brief  Length for Ifx_ERAY_OSID_Bits.RXOB */
#define IFX_ERAY_OSID_RXOB_LEN (1)

/** \\brief  Mask for Ifx_ERAY_OSID_Bits.RXOB */
#define IFX_ERAY_OSID_RXOB_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_OSID_Bits.RXOB */
#define IFX_ERAY_OSID_RXOB_OFF (15)

/** \\brief  Length for Ifx_ERAY_OTSS_Bits.OTGB0 */
#define IFX_ERAY_OTSS_OTGB0_LEN (2)

/** \\brief  Mask for Ifx_ERAY_OTSS_Bits.OTGB0 */
#define IFX_ERAY_OTSS_OTGB0_MSK (0x3)

/** \\brief  Offset for Ifx_ERAY_OTSS_Bits.OTGB0 */
#define IFX_ERAY_OTSS_OTGB0_OFF (0)

/** \\brief  Length for Ifx_ERAY_OTSS_Bits.OTGB1 */
#define IFX_ERAY_OTSS_OTGB1_LEN (2)

/** \\brief  Mask for Ifx_ERAY_OTSS_Bits.OTGB1 */
#define IFX_ERAY_OTSS_OTGB1_MSK (0x3)

/** \\brief  Offset for Ifx_ERAY_OTSS_Bits.OTGB1 */
#define IFX_ERAY_OTSS_OTGB1_OFF (8)

/** \\brief  Length for Ifx_ERAY_OTSS_Bits.OTGB2 */
#define IFX_ERAY_OTSS_OTGB2_LEN (1)

/** \\brief  Mask for Ifx_ERAY_OTSS_Bits.OTGB2 */
#define IFX_ERAY_OTSS_OTGB2_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_OTSS_Bits.OTGB2 */
#define IFX_ERAY_OTSS_OTGB2_OFF (16)

/** \\brief  Length for Ifx_ERAY_PRTC1_Bits.BRP */
#define IFX_ERAY_PRTC1_BRP_LEN (2)

/** \\brief  Mask for Ifx_ERAY_PRTC1_Bits.BRP */
#define IFX_ERAY_PRTC1_BRP_MSK (0x3)

/** \\brief  Offset for Ifx_ERAY_PRTC1_Bits.BRP */
#define IFX_ERAY_PRTC1_BRP_OFF (14)

/** \\brief  Length for Ifx_ERAY_PRTC1_Bits.CASM */
#define IFX_ERAY_PRTC1_CASM_LEN (7)

/** \\brief  Mask for Ifx_ERAY_PRTC1_Bits.CASM */
#define IFX_ERAY_PRTC1_CASM_MSK (0x7f)

/** \\brief  Offset for Ifx_ERAY_PRTC1_Bits.CASM */
#define IFX_ERAY_PRTC1_CASM_OFF (4)

/** \\brief  Length for Ifx_ERAY_PRTC1_Bits.RWP */
#define IFX_ERAY_PRTC1_RWP_LEN (6)

/** \\brief  Mask for Ifx_ERAY_PRTC1_Bits.RWP */
#define IFX_ERAY_PRTC1_RWP_MSK (0x3f)

/** \\brief  Offset for Ifx_ERAY_PRTC1_Bits.RWP */
#define IFX_ERAY_PRTC1_RWP_OFF (26)

/** \\brief  Length for Ifx_ERAY_PRTC1_Bits.RXW */
#define IFX_ERAY_PRTC1_RXW_LEN (9)

/** \\brief  Mask for Ifx_ERAY_PRTC1_Bits.RXW */
#define IFX_ERAY_PRTC1_RXW_MSK (0x1ff)

/** \\brief  Offset for Ifx_ERAY_PRTC1_Bits.RXW */
#define IFX_ERAY_PRTC1_RXW_OFF (16)

/** \\brief  Length for Ifx_ERAY_PRTC1_Bits.SPP */
#define IFX_ERAY_PRTC1_SPP_LEN (2)

/** \\brief  Mask for Ifx_ERAY_PRTC1_Bits.SPP */
#define IFX_ERAY_PRTC1_SPP_MSK (0x3)

/** \\brief  Offset for Ifx_ERAY_PRTC1_Bits.SPP */
#define IFX_ERAY_PRTC1_SPP_OFF (12)

/** \\brief  Length for Ifx_ERAY_PRTC1_Bits.TSST */
#define IFX_ERAY_PRTC1_TSST_LEN (4)

/** \\brief  Mask for Ifx_ERAY_PRTC1_Bits.TSST */
#define IFX_ERAY_PRTC1_TSST_MSK (0xf)

/** \\brief  Offset for Ifx_ERAY_PRTC1_Bits.TSST */
#define IFX_ERAY_PRTC1_TSST_OFF (0)

/** \\brief  Length for Ifx_ERAY_PRTC2_Bits.RXI */
#define IFX_ERAY_PRTC2_RXI_LEN (6)

/** \\brief  Mask for Ifx_ERAY_PRTC2_Bits.RXI */
#define IFX_ERAY_PRTC2_RXI_MSK (0x3f)

/** \\brief  Offset for Ifx_ERAY_PRTC2_Bits.RXI */
#define IFX_ERAY_PRTC2_RXI_OFF (0)

/** \\brief  Length for Ifx_ERAY_PRTC2_Bits.RXL */
#define IFX_ERAY_PRTC2_RXL_LEN (6)

/** \\brief  Mask for Ifx_ERAY_PRTC2_Bits.RXL */
#define IFX_ERAY_PRTC2_RXL_MSK (0x3f)

/** \\brief  Offset for Ifx_ERAY_PRTC2_Bits.RXL */
#define IFX_ERAY_PRTC2_RXL_OFF (8)

/** \\brief  Length for Ifx_ERAY_PRTC2_Bits.TXI */
#define IFX_ERAY_PRTC2_TXI_LEN (8)

/** \\brief  Mask for Ifx_ERAY_PRTC2_Bits.TXI */
#define IFX_ERAY_PRTC2_TXI_MSK (0xff)

/** \\brief  Offset for Ifx_ERAY_PRTC2_Bits.TXI */
#define IFX_ERAY_PRTC2_TXI_OFF (16)

/** \\brief  Length for Ifx_ERAY_PRTC2_Bits.TXL */
#define IFX_ERAY_PRTC2_TXL_LEN (6)

/** \\brief  Mask for Ifx_ERAY_PRTC2_Bits.TXL */
#define IFX_ERAY_PRTC2_TXL_MSK (0x3f)

/** \\brief  Offset for Ifx_ERAY_PRTC2_Bits.TXL */
#define IFX_ERAY_PRTC2_TXL_OFF (24)

/** \\brief  Length for Ifx_ERAY_RCV_Bits.RCV */
#define IFX_ERAY_RCV_RCV_LEN (12)

/** \\brief  Mask for Ifx_ERAY_RCV_Bits.RCV */
#define IFX_ERAY_RCV_RCV_MSK (0xfff)

/** \\brief  Offset for Ifx_ERAY_RCV_Bits.RCV */
#define IFX_ERAY_RCV_RCV_OFF (0)

/** \\brief  Length for Ifx_ERAY_RDDS_Bits.MDRB0 */
#define IFX_ERAY_RDDS_MDRB0_LEN (8)

/** \\brief  Mask for Ifx_ERAY_RDDS_Bits.MDRB0 */
#define IFX_ERAY_RDDS_MDRB0_MSK (0xff)

/** \\brief  Offset for Ifx_ERAY_RDDS_Bits.MDRB0 */
#define IFX_ERAY_RDDS_MDRB0_OFF (0)

