keeper999/EngineControl_Aurix/01_Get_Src/BSW/VD56_BSW/VD56_GEN_BSW/MCAL_TC29X_DRV_P1/Drv/IfxEray_bf.h
/** \\brief  Length for Ifx_ERAY_RDDS_Bits.MDRB1 */
#define IFX_ERAY_RDDS_MDRB1_LEN (8)

/** \\brief  Mask for Ifx_ERAY_RDDS_Bits.MDRB1 */
#define IFX_ERAY_RDDS_MDRB1_MSK (0xff)

/** \\brief  Offset for Ifx_ERAY_RDDS_Bits.MDRB1 */
#define IFX_ERAY_RDDS_MDRB1_OFF (8)

/** \\brief  Length for Ifx_ERAY_RDDS_Bits.MDRB2 */
#define IFX_ERAY_RDDS_MDRB2_LEN (8)

/** \\brief  Mask for Ifx_ERAY_RDDS_Bits.MDRB2 */
#define IFX_ERAY_RDDS_MDRB2_MSK (0xff)

/** \\brief  Offset for Ifx_ERAY_RDDS_Bits.MDRB2 */
#define IFX_ERAY_RDDS_MDRB2_OFF (16)

/** \\brief  Length for Ifx_ERAY_RDDS_Bits.MDRB3 */
#define IFX_ERAY_RDDS_MDRB3_LEN (8)

/** \\brief  Mask for Ifx_ERAY_RDDS_Bits.MDRB3 */
#define IFX_ERAY_RDDS_MDRB3_MSK (0xff)

/** \\brief  Offset for Ifx_ERAY_RDDS_Bits.MDRB3 */
#define IFX_ERAY_RDDS_MDRB3_OFF (24)

/** \\brief  Length for Ifx_ERAY_RDHS1_Bits.CFG */
#define IFX_ERAY_RDHS1_CFG_LEN (1)

/** \\brief  Mask for Ifx_ERAY_RDHS1_Bits.CFG */
#define IFX_ERAY_RDHS1_CFG_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_RDHS1_Bits.CFG */
#define IFX_ERAY_RDHS1_CFG_OFF (26)

/** \\brief  Length for Ifx_ERAY_RDHS1_Bits.CHA */
#define IFX_ERAY_RDHS1_CHA_LEN (1)

/** \\brief  Mask for Ifx_ERAY_RDHS1_Bits.CHA */
#define IFX_ERAY_RDHS1_CHA_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_RDHS1_Bits.CHA */
#define IFX_ERAY_RDHS1_CHA_OFF (24)

/** \\brief  Length for Ifx_ERAY_RDHS1_Bits.CHB */
#define IFX_ERAY_RDHS1_CHB_LEN (1)

/** \\brief  Mask for Ifx_ERAY_RDHS1_Bits.CHB */
#define IFX_ERAY_RDHS1_CHB_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_RDHS1_Bits.CHB */
#define IFX_ERAY_RDHS1_CHB_OFF (25)

/** \\brief  Length for Ifx_ERAY_RDHS1_Bits.CYC */
#define IFX_ERAY_RDHS1_CYC_LEN (7)

/** \\brief  Mask for Ifx_ERAY_RDHS1_Bits.CYC */
#define IFX_ERAY_RDHS1_CYC_MSK (0x7f)

/** \\brief  Offset for Ifx_ERAY_RDHS1_Bits.CYC */
#define IFX_ERAY_RDHS1_CYC_OFF (16)

/** \\brief  Length for Ifx_ERAY_RDHS1_Bits.FID */
#define IFX_ERAY_RDHS1_FID_LEN (11)

/** \\brief  Mask for Ifx_ERAY_RDHS1_Bits.FID */
#define IFX_ERAY_RDHS1_FID_MSK (0x7ff)

/** \\brief  Offset for Ifx_ERAY_RDHS1_Bits.FID */
#define IFX_ERAY_RDHS1_FID_OFF (0)

/** \\brief  Length for Ifx_ERAY_RDHS1_Bits.MBI */
#define IFX_ERAY_RDHS1_MBI_LEN (1)

/** \\brief  Mask for Ifx_ERAY_RDHS1_Bits.MBI */
#define IFX_ERAY_RDHS1_MBI_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_RDHS1_Bits.MBI */
#define IFX_ERAY_RDHS1_MBI_OFF (29)

/** \\brief  Length for Ifx_ERAY_RDHS1_Bits.PPIT */
#define IFX_ERAY_RDHS1_PPIT_LEN (1)

/** \\brief  Mask for Ifx_ERAY_RDHS1_Bits.PPIT */
#define IFX_ERAY_RDHS1_PPIT_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_RDHS1_Bits.PPIT */
#define IFX_ERAY_RDHS1_PPIT_OFF (27)

/** \\brief  Length for Ifx_ERAY_RDHS1_Bits.TXM */
#define IFX_ERAY_RDHS1_TXM_LEN (1)

/** \\brief  Mask for Ifx_ERAY_RDHS1_Bits.TXM */
#define IFX_ERAY_RDHS1_TXM_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_RDHS1_Bits.TXM */
#define IFX_ERAY_RDHS1_TXM_OFF (28)

/** \\brief  Length for Ifx_ERAY_RDHS2_Bits.CRC */
#define IFX_ERAY_RDHS2_CRC_LEN (11)

/** \\brief  Mask for Ifx_ERAY_RDHS2_Bits.CRC */
#define IFX_ERAY_RDHS2_CRC_MSK (0x7ff)

/** \\brief  Offset for Ifx_ERAY_RDHS2_Bits.CRC */
#define IFX_ERAY_RDHS2_CRC_OFF (0)

/** \\brief  Length for Ifx_ERAY_RDHS2_Bits.PLC */
#define IFX_ERAY_RDHS2_PLC_LEN (7)

/** \\brief  Mask for Ifx_ERAY_RDHS2_Bits.PLC */
#define IFX_ERAY_RDHS2_PLC_MSK (0x7f)

/** \\brief  Offset for Ifx_ERAY_RDHS2_Bits.PLC */
#define IFX_ERAY_RDHS2_PLC_OFF (16)

/** \\brief  Length for Ifx_ERAY_RDHS2_Bits.PLR */
#define IFX_ERAY_RDHS2_PLR_LEN (7)

/** \\brief  Mask for Ifx_ERAY_RDHS2_Bits.PLR */
#define IFX_ERAY_RDHS2_PLR_MSK (0x7f)

/** \\brief  Offset for Ifx_ERAY_RDHS2_Bits.PLR */
#define IFX_ERAY_RDHS2_PLR_OFF (24)

/** \\brief  Length for Ifx_ERAY_RDHS3_Bits.DP */
#define IFX_ERAY_RDHS3_DP_LEN (11)

/** \\brief  Mask for Ifx_ERAY_RDHS3_Bits.DP */
#define IFX_ERAY_RDHS3_DP_MSK (0x7ff)

/** \\brief  Offset for Ifx_ERAY_RDHS3_Bits.DP */
#define IFX_ERAY_RDHS3_DP_OFF (0)

/** \\brief  Length for Ifx_ERAY_RDHS3_Bits.NFI */
#define IFX_ERAY_RDHS3_NFI_LEN (1)

/** \\brief  Mask for Ifx_ERAY_RDHS3_Bits.NFI */
#define IFX_ERAY_RDHS3_NFI_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_RDHS3_Bits.NFI */
#define IFX_ERAY_RDHS3_NFI_OFF (27)

/** \\brief  Length for Ifx_ERAY_RDHS3_Bits.PPI */
#define IFX_ERAY_RDHS3_PPI_LEN (1)

/** \\brief  Mask for Ifx_ERAY_RDHS3_Bits.PPI */
#define IFX_ERAY_RDHS3_PPI_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_RDHS3_Bits.PPI */
#define IFX_ERAY_RDHS3_PPI_OFF (28)

/** \\brief  Length for Ifx_ERAY_RDHS3_Bits.RCC */
#define IFX_ERAY_RDHS3_RCC_LEN (6)

/** \\brief  Mask for Ifx_ERAY_RDHS3_Bits.RCC */
#define IFX_ERAY_RDHS3_RCC_MSK (0x3f)

/** \\brief  Offset for Ifx_ERAY_RDHS3_Bits.RCC */
#define IFX_ERAY_RDHS3_RCC_OFF (16)

/** \\brief  Length for Ifx_ERAY_RDHS3_Bits.RCI */
#define IFX_ERAY_RDHS3_RCI_LEN (1)

/** \\brief  Mask for Ifx_ERAY_RDHS3_Bits.RCI */
#define IFX_ERAY_RDHS3_RCI_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_RDHS3_Bits.RCI */
#define IFX_ERAY_RDHS3_RCI_OFF (24)

/** \\brief  Length for Ifx_ERAY_RDHS3_Bits.RES */
#define IFX_ERAY_RDHS3_RES_LEN (1)

/** \\brief  Mask for Ifx_ERAY_RDHS3_Bits.RES */
#define IFX_ERAY_RDHS3_RES_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_RDHS3_Bits.RES */
#define IFX_ERAY_RDHS3_RES_OFF (29)

/** \\brief  Length for Ifx_ERAY_RDHS3_Bits.SFI */
#define IFX_ERAY_RDHS3_SFI_LEN (1)

/** \\brief  Mask for Ifx_ERAY_RDHS3_Bits.SFI */
#define IFX_ERAY_RDHS3_SFI_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_RDHS3_Bits.SFI */
#define IFX_ERAY_RDHS3_SFI_OFF (25)

/** \\brief  Length for Ifx_ERAY_RDHS3_Bits.SYN */
#define IFX_ERAY_RDHS3_SYN_LEN (1)

/** \\brief  Mask for Ifx_ERAY_RDHS3_Bits.SYN */
#define IFX_ERAY_RDHS3_SYN_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_RDHS3_Bits.SYN */
#define IFX_ERAY_RDHS3_SYN_OFF (26)

/** \\brief  Length for Ifx_ERAY_SCV_Bits.SCCA */
#define IFX_ERAY_SCV_SCCA_LEN (11)

/** \\brief  Mask for Ifx_ERAY_SCV_Bits.SCCA */
#define IFX_ERAY_SCV_SCCA_MSK (0x7ff)

