keeper999/EngineControl_Aurix/01_Get_Src/BSW/VD56_BSW/VD56_GEN_BSW/MCAL_TC29X_DRV_P1/Drv/IfxEray_bf.h
/** \\brief  Offset for Ifx_ERAY_SCV_Bits.SCCA */
#define IFX_ERAY_SCV_SCCA_OFF (0)

/** \\brief  Length for Ifx_ERAY_SCV_Bits.SCCB */
#define IFX_ERAY_SCV_SCCB_LEN (11)

/** \\brief  Mask for Ifx_ERAY_SCV_Bits.SCCB */
#define IFX_ERAY_SCV_SCCB_MSK (0x7ff)

/** \\brief  Offset for Ifx_ERAY_SCV_Bits.SCCB */
#define IFX_ERAY_SCV_SCCB_OFF (16)

/** \\brief  Length for Ifx_ERAY_SFS_Bits.MOCS */
#define IFX_ERAY_SFS_MOCS_LEN (1)

/** \\brief  Mask for Ifx_ERAY_SFS_Bits.MOCS */
#define IFX_ERAY_SFS_MOCS_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_SFS_Bits.MOCS */
#define IFX_ERAY_SFS_MOCS_OFF (16)

/** \\brief  Length for Ifx_ERAY_SFS_Bits.MRCS */
#define IFX_ERAY_SFS_MRCS_LEN (1)

/** \\brief  Mask for Ifx_ERAY_SFS_Bits.MRCS */
#define IFX_ERAY_SFS_MRCS_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_SFS_Bits.MRCS */
#define IFX_ERAY_SFS_MRCS_OFF (18)

/** \\brief  Length for Ifx_ERAY_SFS_Bits.OCLR */
#define IFX_ERAY_SFS_OCLR_LEN (1)

/** \\brief  Mask for Ifx_ERAY_SFS_Bits.OCLR */
#define IFX_ERAY_SFS_OCLR_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_SFS_Bits.OCLR */
#define IFX_ERAY_SFS_OCLR_OFF (17)

/** \\brief  Length for Ifx_ERAY_SFS_Bits.RCLR */
#define IFX_ERAY_SFS_RCLR_LEN (1)

/** \\brief  Mask for Ifx_ERAY_SFS_Bits.RCLR */
#define IFX_ERAY_SFS_RCLR_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_SFS_Bits.RCLR */
#define IFX_ERAY_SFS_RCLR_OFF (19)

/** \\brief  Length for Ifx_ERAY_SFS_Bits.VSAE */
#define IFX_ERAY_SFS_VSAE_LEN (4)

/** \\brief  Mask for Ifx_ERAY_SFS_Bits.VSAE */
#define IFX_ERAY_SFS_VSAE_MSK (0xf)

/** \\brief  Offset for Ifx_ERAY_SFS_Bits.VSAE */
#define IFX_ERAY_SFS_VSAE_OFF (0)

/** \\brief  Length for Ifx_ERAY_SFS_Bits.VSAO */
#define IFX_ERAY_SFS_VSAO_LEN (4)

/** \\brief  Mask for Ifx_ERAY_SFS_Bits.VSAO */
#define IFX_ERAY_SFS_VSAO_MSK (0xf)

/** \\brief  Offset for Ifx_ERAY_SFS_Bits.VSAO */
#define IFX_ERAY_SFS_VSAO_OFF (4)

/** \\brief  Length for Ifx_ERAY_SFS_Bits.VSBE */
#define IFX_ERAY_SFS_VSBE_LEN (4)

/** \\brief  Mask for Ifx_ERAY_SFS_Bits.VSBE */
#define IFX_ERAY_SFS_VSBE_MSK (0xf)

/** \\brief  Offset for Ifx_ERAY_SFS_Bits.VSBE */
#define IFX_ERAY_SFS_VSBE_OFF (8)

/** \\brief  Length for Ifx_ERAY_SFS_Bits.VSBO */
#define IFX_ERAY_SFS_VSBO_LEN (4)

/** \\brief  Mask for Ifx_ERAY_SFS_Bits.VSBO */
#define IFX_ERAY_SFS_VSBO_MSK (0xf)

/** \\brief  Offset for Ifx_ERAY_SFS_Bits.VSBO */
#define IFX_ERAY_SFS_VSBO_OFF (12)

/** \\brief  Length for Ifx_ERAY_SIER_Bits.CASE */
#define IFX_ERAY_SIER_CASE_LEN (1)

/** \\brief  Mask for Ifx_ERAY_SIER_Bits.CASE */
#define IFX_ERAY_SIER_CASE_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_SIER_Bits.CASE */
#define IFX_ERAY_SIER_CASE_OFF (1)

/** \\brief  Length for Ifx_ERAY_SIER_Bits.CYCSE */
#define IFX_ERAY_SIER_CYCSE_LEN (1)

/** \\brief  Mask for Ifx_ERAY_SIER_Bits.CYCSE */
#define IFX_ERAY_SIER_CYCSE_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_SIER_Bits.CYCSE */
#define IFX_ERAY_SIER_CYCSE_OFF (2)

/** \\brief  Length for Ifx_ERAY_SIER_Bits.MBSIE */
#define IFX_ERAY_SIER_MBSIE_LEN (1)

/** \\brief  Mask for Ifx_ERAY_SIER_Bits.MBSIE */
#define IFX_ERAY_SIER_MBSIE_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_SIER_Bits.MBSIE */
#define IFX_ERAY_SIER_MBSIE_OFF (14)

/** \\brief  Length for Ifx_ERAY_SIER_Bits.MTSAE */
#define IFX_ERAY_SIER_MTSAE_LEN (1)

/** \\brief  Mask for Ifx_ERAY_SIER_Bits.MTSAE */
#define IFX_ERAY_SIER_MTSAE_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_SIER_Bits.MTSAE */
#define IFX_ERAY_SIER_MTSAE_OFF (17)

/** \\brief  Length for Ifx_ERAY_SIER_Bits.MTSBE */
#define IFX_ERAY_SIER_MTSBE_LEN (1)

/** \\brief  Mask for Ifx_ERAY_SIER_Bits.MTSBE */
#define IFX_ERAY_SIER_MTSBE_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_SIER_Bits.MTSBE */
#define IFX_ERAY_SIER_MTSBE_OFF (25)

/** \\brief  Length for Ifx_ERAY_SIER_Bits.NMVCE */
#define IFX_ERAY_SIER_NMVCE_LEN (1)

/** \\brief  Mask for Ifx_ERAY_SIER_Bits.NMVCE */
#define IFX_ERAY_SIER_NMVCE_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_SIER_Bits.NMVCE */
#define IFX_ERAY_SIER_NMVCE_OFF (7)

/** \\brief  Length for Ifx_ERAY_SIER_Bits.RFCLE */
#define IFX_ERAY_SIER_RFCLE_LEN (1)

/** \\brief  Mask for Ifx_ERAY_SIER_Bits.RFCLE */
#define IFX_ERAY_SIER_RFCLE_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_SIER_Bits.RFCLE */
#define IFX_ERAY_SIER_RFCLE_OFF (6)

/** \\brief  Length for Ifx_ERAY_SIER_Bits.RFNEE */
#define IFX_ERAY_SIER_RFNEE_LEN (1)

/** \\brief  Mask for Ifx_ERAY_SIER_Bits.RFNEE */
#define IFX_ERAY_SIER_RFNEE_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_SIER_Bits.RFNEE */
#define IFX_ERAY_SIER_RFNEE_OFF (5)

/** \\brief  Length for Ifx_ERAY_SIER_Bits.RXIE */
#define IFX_ERAY_SIER_RXIE_LEN (1)

/** \\brief  Mask for Ifx_ERAY_SIER_Bits.RXIE */
#define IFX_ERAY_SIER_RXIE_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_SIER_Bits.RXIE */
#define IFX_ERAY_SIER_RXIE_OFF (4)

/** \\brief  Length for Ifx_ERAY_SIER_Bits.SDSE */
#define IFX_ERAY_SIER_SDSE_LEN (1)

/** \\brief  Mask for Ifx_ERAY_SIER_Bits.SDSE */
#define IFX_ERAY_SIER_SDSE_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_SIER_Bits.SDSE */
#define IFX_ERAY_SIER_SDSE_OFF (15)

/** \\brief  Length for Ifx_ERAY_SIER_Bits.SUCSE */
#define IFX_ERAY_SIER_SUCSE_LEN (1)

/** \\brief  Mask for Ifx_ERAY_SIER_Bits.SUCSE */
#define IFX_ERAY_SIER_SUCSE_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_SIER_Bits.SUCSE */
#define IFX_ERAY_SIER_SUCSE_OFF (13)

/** \\brief  Length for Ifx_ERAY_SIER_Bits.SWEE */
#define IFX_ERAY_SIER_SWEE_LEN (1)

/** \\brief  Mask for Ifx_ERAY_SIER_Bits.SWEE */
#define IFX_ERAY_SIER_SWEE_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_SIER_Bits.SWEE */
#define IFX_ERAY_SIER_SWEE_OFF (12)

/** \\brief  Length for Ifx_ERAY_SIER_Bits.TI0E */
#define IFX_ERAY_SIER_TI0E_LEN (1)

/** \\brief  Mask for Ifx_ERAY_SIER_Bits.TI0E */
#define IFX_ERAY_SIER_TI0E_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_SIER_Bits.TI0E */
#define IFX_ERAY_SIER_TI0E_OFF (8)

