keeper999/EngineControl_Aurix/01_Get_Src/BSW/VD56_BSW/VD56_GEN_BSW/MCAL_TC29X_DRV_P1/Drv/IfxEray_bf.h
/** \\brief  Offset for Ifx_ERAY_SILS_Bits.WSTL */
#define IFX_ERAY_SILS_WSTL_OFF (0)

/** \\brief  Length for Ifx_ERAY_SILS_Bits.WUPAL */
#define IFX_ERAY_SILS_WUPAL_LEN (1)

/** \\brief  Mask for Ifx_ERAY_SILS_Bits.WUPAL */
#define IFX_ERAY_SILS_WUPAL_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_SILS_Bits.WUPAL */
#define IFX_ERAY_SILS_WUPAL_OFF (16)

/** \\brief  Length for Ifx_ERAY_SILS_Bits.WUPBL */
#define IFX_ERAY_SILS_WUPBL_LEN (1)

/** \\brief  Mask for Ifx_ERAY_SILS_Bits.WUPBL */
#define IFX_ERAY_SILS_WUPBL_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_SILS_Bits.WUPBL */
#define IFX_ERAY_SILS_WUPBL_OFF (24)

/** \\brief  Length for Ifx_ERAY_SIR_Bits.CAS */
#define IFX_ERAY_SIR_CAS_LEN (1)

/** \\brief  Mask for Ifx_ERAY_SIR_Bits.CAS */
#define IFX_ERAY_SIR_CAS_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_SIR_Bits.CAS */
#define IFX_ERAY_SIR_CAS_OFF (1)

/** \\brief  Length for Ifx_ERAY_SIR_Bits.CYCS */
#define IFX_ERAY_SIR_CYCS_LEN (1)

/** \\brief  Mask for Ifx_ERAY_SIR_Bits.CYCS */
#define IFX_ERAY_SIR_CYCS_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_SIR_Bits.CYCS */
#define IFX_ERAY_SIR_CYCS_OFF (2)

/** \\brief  Length for Ifx_ERAY_SIR_Bits.MBSI */
#define IFX_ERAY_SIR_MBSI_LEN (1)

/** \\brief  Mask for Ifx_ERAY_SIR_Bits.MBSI */
#define IFX_ERAY_SIR_MBSI_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_SIR_Bits.MBSI */
#define IFX_ERAY_SIR_MBSI_OFF (14)

/** \\brief  Length for Ifx_ERAY_SIR_Bits.MTSA */
#define IFX_ERAY_SIR_MTSA_LEN (1)

/** \\brief  Mask for Ifx_ERAY_SIR_Bits.MTSA */
#define IFX_ERAY_SIR_MTSA_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_SIR_Bits.MTSA */
#define IFX_ERAY_SIR_MTSA_OFF (17)

/** \\brief  Length for Ifx_ERAY_SIR_Bits.MTSB */
#define IFX_ERAY_SIR_MTSB_LEN (1)

/** \\brief  Mask for Ifx_ERAY_SIR_Bits.MTSB */
#define IFX_ERAY_SIR_MTSB_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_SIR_Bits.MTSB */
#define IFX_ERAY_SIR_MTSB_OFF (25)

/** \\brief  Length for Ifx_ERAY_SIR_Bits.NMVC */
#define IFX_ERAY_SIR_NMVC_LEN (1)

/** \\brief  Mask for Ifx_ERAY_SIR_Bits.NMVC */
#define IFX_ERAY_SIR_NMVC_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_SIR_Bits.NMVC */
#define IFX_ERAY_SIR_NMVC_OFF (7)

/** \\brief  Length for Ifx_ERAY_SIR_Bits.RFCL */
#define IFX_ERAY_SIR_RFCL_LEN (1)

/** \\brief  Mask for Ifx_ERAY_SIR_Bits.RFCL */
#define IFX_ERAY_SIR_RFCL_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_SIR_Bits.RFCL */
#define IFX_ERAY_SIR_RFCL_OFF (6)

/** \\brief  Length for Ifx_ERAY_SIR_Bits.RFNE */
#define IFX_ERAY_SIR_RFNE_LEN (1)

/** \\brief  Mask for Ifx_ERAY_SIR_Bits.RFNE */
#define IFX_ERAY_SIR_RFNE_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_SIR_Bits.RFNE */
#define IFX_ERAY_SIR_RFNE_OFF (5)

/** \\brief  Length for Ifx_ERAY_SIR_Bits.RXI */
#define IFX_ERAY_SIR_RXI_LEN (1)

/** \\brief  Mask for Ifx_ERAY_SIR_Bits.RXI */
#define IFX_ERAY_SIR_RXI_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_SIR_Bits.RXI */
#define IFX_ERAY_SIR_RXI_OFF (4)

/** \\brief  Length for Ifx_ERAY_SIR_Bits.SDS */
#define IFX_ERAY_SIR_SDS_LEN (1)

/** \\brief  Mask for Ifx_ERAY_SIR_Bits.SDS */
#define IFX_ERAY_SIR_SDS_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_SIR_Bits.SDS */
#define IFX_ERAY_SIR_SDS_OFF (15)

/** \\brief  Length for Ifx_ERAY_SIR_Bits.SUCS */
#define IFX_ERAY_SIR_SUCS_LEN (1)

/** \\brief  Mask for Ifx_ERAY_SIR_Bits.SUCS */
#define IFX_ERAY_SIR_SUCS_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_SIR_Bits.SUCS */
#define IFX_ERAY_SIR_SUCS_OFF (13)

/** \\brief  Length for Ifx_ERAY_SIR_Bits.SWE */
#define IFX_ERAY_SIR_SWE_LEN (1)

/** \\brief  Mask for Ifx_ERAY_SIR_Bits.SWE */
#define IFX_ERAY_SIR_SWE_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_SIR_Bits.SWE */
#define IFX_ERAY_SIR_SWE_OFF (12)

/** \\brief  Length for Ifx_ERAY_SIR_Bits.TI0 */
#define IFX_ERAY_SIR_TI0_LEN (1)

/** \\brief  Mask for Ifx_ERAY_SIR_Bits.TI0 */
#define IFX_ERAY_SIR_TI0_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_SIR_Bits.TI0 */
#define IFX_ERAY_SIR_TI0_OFF (8)

/** \\brief  Length for Ifx_ERAY_SIR_Bits.TI1 */
#define IFX_ERAY_SIR_TI1_LEN (1)

/** \\brief  Mask for Ifx_ERAY_SIR_Bits.TI1 */
#define IFX_ERAY_SIR_TI1_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_SIR_Bits.TI1 */
#define IFX_ERAY_SIR_TI1_OFF (9)

/** \\brief  Length for Ifx_ERAY_SIR_Bits.TIBC */
#define IFX_ERAY_SIR_TIBC_LEN (1)

/** \\brief  Mask for Ifx_ERAY_SIR_Bits.TIBC */
#define IFX_ERAY_SIR_TIBC_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_SIR_Bits.TIBC */
#define IFX_ERAY_SIR_TIBC_OFF (10)

/** \\brief  Length for Ifx_ERAY_SIR_Bits.TOBC */
#define IFX_ERAY_SIR_TOBC_LEN (1)

/** \\brief  Mask for Ifx_ERAY_SIR_Bits.TOBC */
#define IFX_ERAY_SIR_TOBC_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_SIR_Bits.TOBC */
#define IFX_ERAY_SIR_TOBC_OFF (11)

/** \\brief  Length for Ifx_ERAY_SIR_Bits.TXI */
#define IFX_ERAY_SIR_TXI_LEN (1)

/** \\brief  Mask for Ifx_ERAY_SIR_Bits.TXI */
#define IFX_ERAY_SIR_TXI_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_SIR_Bits.TXI */
#define IFX_ERAY_SIR_TXI_OFF (3)

/** \\brief  Length for Ifx_ERAY_SIR_Bits.WST */
#define IFX_ERAY_SIR_WST_LEN (1)

/** \\brief  Mask for Ifx_ERAY_SIR_Bits.WST */
#define IFX_ERAY_SIR_WST_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_SIR_Bits.WST */
#define IFX_ERAY_SIR_WST_OFF (0)

/** \\brief  Length for Ifx_ERAY_SIR_Bits.WUPA */
#define IFX_ERAY_SIR_WUPA_LEN (1)

/** \\brief  Mask for Ifx_ERAY_SIR_Bits.WUPA */
#define IFX_ERAY_SIR_WUPA_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_SIR_Bits.WUPA */
#define IFX_ERAY_SIR_WUPA_OFF (16)

/** \\brief  Length for Ifx_ERAY_SIR_Bits.WUPB */
#define IFX_ERAY_SIR_WUPB_LEN (1)

/** \\brief  Mask for Ifx_ERAY_SIR_Bits.WUPB */
#define IFX_ERAY_SIR_WUPB_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_SIR_Bits.WUPB */
#define IFX_ERAY_SIR_WUPB_OFF (24)

/** \\brief  Length for Ifx_ERAY_STPW1_Bits.EDGE */
#define IFX_ERAY_STPW1_EDGE_LEN (1)

/** \\brief  Mask for Ifx_ERAY_STPW1_Bits.EDGE */
#define IFX_ERAY_STPW1_EDGE_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_STPW1_Bits.EDGE */
#define IFX_ERAY_STPW1_EDGE_OFF (2)

/** \\brief  Length for Ifx_ERAY_STPW1_Bits.EETP */
#define IFX_ERAY_STPW1_EETP_LEN (1)

