keeper999/EngineControl_Aurix/01_Get_Src/BSW/VD56_BSW/VD56_GEN_BSW/MCAL_TC29X_DRV_P1/Drv/IfxEray_bf.h
/** \\brief  Length for Ifx_ERAY_TXRQ2_Bits.TXR53 */
#define IFX_ERAY_TXRQ2_TXR53_LEN (1)

/** \\brief  Mask for Ifx_ERAY_TXRQ2_Bits.TXR53 */
#define IFX_ERAY_TXRQ2_TXR53_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_TXRQ2_Bits.TXR53 */
#define IFX_ERAY_TXRQ2_TXR53_OFF (21)

/** \\brief  Length for Ifx_ERAY_TXRQ2_Bits.TXR54 */
#define IFX_ERAY_TXRQ2_TXR54_LEN (1)

/** \\brief  Mask for Ifx_ERAY_TXRQ2_Bits.TXR54 */
#define IFX_ERAY_TXRQ2_TXR54_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_TXRQ2_Bits.TXR54 */
#define IFX_ERAY_TXRQ2_TXR54_OFF (22)

/** \\brief  Length for Ifx_ERAY_TXRQ2_Bits.TXR55 */
#define IFX_ERAY_TXRQ2_TXR55_LEN (1)

/** \\brief  Mask for Ifx_ERAY_TXRQ2_Bits.TXR55 */
#define IFX_ERAY_TXRQ2_TXR55_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_TXRQ2_Bits.TXR55 */
#define IFX_ERAY_TXRQ2_TXR55_OFF (23)

/** \\brief  Length for Ifx_ERAY_TXRQ2_Bits.TXR56 */
#define IFX_ERAY_TXRQ2_TXR56_LEN (1)

/** \\brief  Mask for Ifx_ERAY_TXRQ2_Bits.TXR56 */
#define IFX_ERAY_TXRQ2_TXR56_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_TXRQ2_Bits.TXR56 */
#define IFX_ERAY_TXRQ2_TXR56_OFF (24)

/** \\brief  Length for Ifx_ERAY_TXRQ2_Bits.TXR57 */
#define IFX_ERAY_TXRQ2_TXR57_LEN (1)

/** \\brief  Mask for Ifx_ERAY_TXRQ2_Bits.TXR57 */
#define IFX_ERAY_TXRQ2_TXR57_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_TXRQ2_Bits.TXR57 */
#define IFX_ERAY_TXRQ2_TXR57_OFF (25)

/** \\brief  Length for Ifx_ERAY_TXRQ2_Bits.TXR58 */
#define IFX_ERAY_TXRQ2_TXR58_LEN (1)

/** \\brief  Mask for Ifx_ERAY_TXRQ2_Bits.TXR58 */
#define IFX_ERAY_TXRQ2_TXR58_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_TXRQ2_Bits.TXR58 */
#define IFX_ERAY_TXRQ2_TXR58_OFF (26)

/** \\brief  Length for Ifx_ERAY_TXRQ2_Bits.TXR59 */
#define IFX_ERAY_TXRQ2_TXR59_LEN (1)

/** \\brief  Mask for Ifx_ERAY_TXRQ2_Bits.TXR59 */
#define IFX_ERAY_TXRQ2_TXR59_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_TXRQ2_Bits.TXR59 */
#define IFX_ERAY_TXRQ2_TXR59_OFF (27)

/** \\brief  Length for Ifx_ERAY_TXRQ2_Bits.TXR60 */
#define IFX_ERAY_TXRQ2_TXR60_LEN (1)

/** \\brief  Mask for Ifx_ERAY_TXRQ2_Bits.TXR60 */
#define IFX_ERAY_TXRQ2_TXR60_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_TXRQ2_Bits.TXR60 */
#define IFX_ERAY_TXRQ2_TXR60_OFF (28)

/** \\brief  Length for Ifx_ERAY_TXRQ2_Bits.TXR61 */
#define IFX_ERAY_TXRQ2_TXR61_LEN (1)

/** \\brief  Mask for Ifx_ERAY_TXRQ2_Bits.TXR61 */
#define IFX_ERAY_TXRQ2_TXR61_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_TXRQ2_Bits.TXR61 */
#define IFX_ERAY_TXRQ2_TXR61_OFF (29)

/** \\brief  Length for Ifx_ERAY_TXRQ2_Bits.TXR62 */
#define IFX_ERAY_TXRQ2_TXR62_LEN (1)

/** \\brief  Mask for Ifx_ERAY_TXRQ2_Bits.TXR62 */
#define IFX_ERAY_TXRQ2_TXR62_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_TXRQ2_Bits.TXR62 */
#define IFX_ERAY_TXRQ2_TXR62_OFF (30)

/** \\brief  Length for Ifx_ERAY_TXRQ2_Bits.TXR63 */
#define IFX_ERAY_TXRQ2_TXR63_LEN (1)

/** \\brief  Mask for Ifx_ERAY_TXRQ2_Bits.TXR63 */
#define IFX_ERAY_TXRQ2_TXR63_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_TXRQ2_Bits.TXR63 */
#define IFX_ERAY_TXRQ2_TXR63_OFF (31)

/** \\brief  Length for Ifx_ERAY_TXRQ3_Bits.TXR64 */
#define IFX_ERAY_TXRQ3_TXR64_LEN (1)

/** \\brief  Mask for Ifx_ERAY_TXRQ3_Bits.TXR64 */
#define IFX_ERAY_TXRQ3_TXR64_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_TXRQ3_Bits.TXR64 */
#define IFX_ERAY_TXRQ3_TXR64_OFF (0)

/** \\brief  Length for Ifx_ERAY_TXRQ3_Bits.TXR65 */
#define IFX_ERAY_TXRQ3_TXR65_LEN (1)

/** \\brief  Mask for Ifx_ERAY_TXRQ3_Bits.TXR65 */
#define IFX_ERAY_TXRQ3_TXR65_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_TXRQ3_Bits.TXR65 */
#define IFX_ERAY_TXRQ3_TXR65_OFF (1)

/** \\brief  Length for Ifx_ERAY_TXRQ3_Bits.TXR66 */
#define IFX_ERAY_TXRQ3_TXR66_LEN (1)

/** \\brief  Mask for Ifx_ERAY_TXRQ3_Bits.TXR66 */
#define IFX_ERAY_TXRQ3_TXR66_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_TXRQ3_Bits.TXR66 */
#define IFX_ERAY_TXRQ3_TXR66_OFF (2)

/** \\brief  Length for Ifx_ERAY_TXRQ3_Bits.TXR67 */
#define IFX_ERAY_TXRQ3_TXR67_LEN (1)

/** \\brief  Mask for Ifx_ERAY_TXRQ3_Bits.TXR67 */
#define IFX_ERAY_TXRQ3_TXR67_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_TXRQ3_Bits.TXR67 */
#define IFX_ERAY_TXRQ3_TXR67_OFF (3)

/** \\brief  Length for Ifx_ERAY_TXRQ3_Bits.TXR68 */
#define IFX_ERAY_TXRQ3_TXR68_LEN (1)

/** \\brief  Mask for Ifx_ERAY_TXRQ3_Bits.TXR68 */
#define IFX_ERAY_TXRQ3_TXR68_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_TXRQ3_Bits.TXR68 */
#define IFX_ERAY_TXRQ3_TXR68_OFF (4)

/** \\brief  Length for Ifx_ERAY_TXRQ3_Bits.TXR69 */
#define IFX_ERAY_TXRQ3_TXR69_LEN (1)

/** \\brief  Mask for Ifx_ERAY_TXRQ3_Bits.TXR69 */
#define IFX_ERAY_TXRQ3_TXR69_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_TXRQ3_Bits.TXR69 */
#define IFX_ERAY_TXRQ3_TXR69_OFF (5)

/** \\brief  Length for Ifx_ERAY_TXRQ3_Bits.TXR70 */
#define IFX_ERAY_TXRQ3_TXR70_LEN (1)

/** \\brief  Mask for Ifx_ERAY_TXRQ3_Bits.TXR70 */
#define IFX_ERAY_TXRQ3_TXR70_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_TXRQ3_Bits.TXR70 */
#define IFX_ERAY_TXRQ3_TXR70_OFF (6)

/** \\brief  Length for Ifx_ERAY_TXRQ3_Bits.TXR71 */
#define IFX_ERAY_TXRQ3_TXR71_LEN (1)

/** \\brief  Mask for Ifx_ERAY_TXRQ3_Bits.TXR71 */
#define IFX_ERAY_TXRQ3_TXR71_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_TXRQ3_Bits.TXR71 */
#define IFX_ERAY_TXRQ3_TXR71_OFF (7)

/** \\brief  Length for Ifx_ERAY_TXRQ3_Bits.TXR72 */
#define IFX_ERAY_TXRQ3_TXR72_LEN (1)

/** \\brief  Mask for Ifx_ERAY_TXRQ3_Bits.TXR72 */
#define IFX_ERAY_TXRQ3_TXR72_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_TXRQ3_Bits.TXR72 */
#define IFX_ERAY_TXRQ3_TXR72_OFF (8)

/** \\brief  Length for Ifx_ERAY_TXRQ3_Bits.TXR73 */
#define IFX_ERAY_TXRQ3_TXR73_LEN (1)

/** \\brief  Mask for Ifx_ERAY_TXRQ3_Bits.TXR73 */
#define IFX_ERAY_TXRQ3_TXR73_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_TXRQ3_Bits.TXR73 */
#define IFX_ERAY_TXRQ3_TXR73_OFF (9)

/** \\brief  Length for Ifx_ERAY_TXRQ3_Bits.TXR74 */
#define IFX_ERAY_TXRQ3_TXR74_LEN (1)

/** \\brief  Mask for Ifx_ERAY_TXRQ3_Bits.TXR74 */
#define IFX_ERAY_TXRQ3_TXR74_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_TXRQ3_Bits.TXR74 */
#define IFX_ERAY_TXRQ3_TXR74_OFF (10)

